{
  "url": "https://netstrata.com.au/recycle-food-scraps-for-good-rather-than-landfill/",
  "timestamp": "2025-11-03T17:52:04.475288",
  "success": true,
  "content": {
    "title": "Recycle Food Scraps for Good Rather than Landfill",
    "date": "2021-09-23T16:37:35+00:00",
    "category": null,
    "author": "S J",
    "main_content": "According to the City of Sydney, food waste typically accounts for one third of their residents’ red rubbish bins. If the food scraps were collected separately, the Council could reduce waste destined for landfill and the scraps could be used for green electricity and fertiliser on gardens and farms. Furthermore 9 per cent of the city’s carbon emissions is generated by waste and waste management – methane gas is released as the food scraps decompose.\n\nTo test their processes, the City of Sydney Council is running a trial where participating households are being asked to separate their food scraps from other household waste. Phase 1 of the trial began in July 2019 and Phase 2 was launched in September 2020 with more than 1,000 houses and 140 apartment buildings in Sydney.\n\nThe council is now extending Phase 2 and is asking for an additional 100 apartment buildings to participate.\n\nParticipating households will be given a kitchen caddy bin, compostable caddy liner bags and a food scrap bin. The City of Sydney will then collect the food scrap bins twice a week from apartment buildings and take them to EarthPower, a food waste-to-energy processing facility in Camellia, Sydney. The facility uses anaerobic digestion technology to convert the scraps into green energy to power homes or nutrient-rich fertiliser.\n\nIf your property is in the City of Sydney council and is interested in participating, you’ll need approval from your strata committee. It may be that some units in your building participate and others don’t – which is completely fine. For more information or to register your building’s interest, email council@cityofsydney.nsw.gov.au.\n\nIf your strata scheme isn’t in the City of Sydney, you can still use your food scraps for compost or you could set up a worm farm. The Owners Corporation could consider establishing a communal worm farm where residents can deposit their food scraps – just be sure to clearly outline what can and can’t be deposited into the worm farm. There’s also nothing stopping you from having a worm farm on your own balcony.\n\nBokashi bins are another alternative for individual apartment owners. The micro-organisms in the Bokashi One Mix accelerate the breakdown of the waste when the scraps are buried beneath the soil. All kitchen waste can be composted into the Bokashi bin including fruit, vegetables, meat, fish, eggs, bread and even wilted flowers.\n\nIf you have any questions about recycling or composting, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}