{
  "url": "https://netstrata.com.au/manage-rental-bonds-online/",
  "timestamp": "2025-11-03T17:43:30.474127",
  "success": true,
  "content": {
    "title": "Manage Rental Bonds Online",
    "date": "2016-10-20T03:07:30+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Owners of strata-titled properties who decide to rent out their apartment can either appoint a real estate agent to handle the leasing process and the tenant or they can manage the lease of the apartment themselves.\n\nAs a private landlord, to make the process of renting out an apartment easier, the NSW Department of Fair Trading introduced in July 2015 the ability to lodge, manage and refund rental bonds online. To utilise this internet-based service, the landlord and the tenant login via their own accounts where they’ll be able to lodge or claim the bond and see tasks relating to the bond money.\n\nPreviously the process was handled with paper forms. Signatures have now been replaced with security measures such as mobile phone SMS codes to verify each transaction.\n\nTo register for the service, landlords will need to complete a Proof of Identity and Registration Form. Accompanying the form, landlords will need to provide three documents that prove their identity. These documents must either be an Australian driver’s licence or a current passport and two other documents such as water rates notice, council rates notice, medicare card, credit card or debit card. Landlords need to take the completed form and the document originals to any Service NSW Centre or email the form and certified copies of the documents.\n\nOnce processed, Fair Trading will email the Landlord a unique code and instructions on how to activate their Rental Bonds Online account.\n\nLandlords then need to confirm with their tenant that they’re comfortable using the online portal. If the tenant agrees, they should give their email address to the Landlord who enters the email into the system – this will trigger an automated email from Rental Bonds Online with further instructions on how to create the account and pay the bond.\n\nThe bond can be paid using a Visa card, MasterCard or through BPAY. Tenants will also need to enter their Australian bank account details into the system so that the bond can be refunded at the end of the tenancy.\n\nPaying the bond online normally takes place before a tenancy agreement is signed. If the tenancy doesn’t proceed, it’s relatively easy to request for the money to be returned through the system.\n\nIf other tenants are named on the lease, Fair Trading advises that a “Principle Tenant” should be nominated who then acts on behalf of all tenants. The Principle Tenant should pay the bond money through the online system, provide contact details for the co-tenants and distribute the bond refund if required.\n\nIf you need more information on using Rental Bonds Online or acting as a private landlord, please contact your Strata Manager.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}