{
  "url": "https://netstrata.com.au/netstrata-wollongong-finalist-in-2023-illawarra-business-awards/",
  "timestamp": "2025-11-03T17:47:42.319024",
  "success": true,
  "content": {
    "title": "Netstrata Wollongong Honoured as FINALIST in the 2023 Illawarra Business Awards",
    "date": "2023-09-01T06:51:07+00:00",
    "category": null,
    "author": "S J",
    "main_content": "#### Netstrata Wollongong Honoured as a FINALIST for “Excellent Customer Service” in the 2023 Illawarra Business Awards\n\nWe are beyond thrilled to announce that Netstrata Wollongong has been named a FINALIST in the “Excellent Customer Service” category of the prestigious 2023 Illawarra Business Awards. This honour means the world to us, and we are deeply grateful to Business Illawarra for recognising our team’s hard work and dedication to serving our community.\n\nThis annual gala ceremony is not just a night of accolades; it’s a celebration of the vibrant and diverse business ecosystem that makes the Illawarra region so unique. Being nominated in a category that places such a strong emphasis on customer service reaffirms our commitment to continually raising the bar in what we offer to our clients.\n\nWe also want to take this moment to extend our heartfelt congratulations to all the other finalists in this and other categories. Your innovation, resilience, and dedication to excellence do not go unnoticed, and they inspire us to strive even harder.\n\nAs we look forward to the gala night at the WIN Entertainment Centre, we are filled with anticipation and excitement to be among such esteemed company. Whether we take home the award or not, being a finalist is already a win for us because it recognizes the tireless efforts of our entire team.\n\nSo, here’s to Business Illawarra for bringing the community together for over 25 years through these awards, and here’s to all our fellow nominees. We wish everyone the best of luck at the awards ceremony. No matter the outcome, it will undoubtedly be a night to remember for all involved.\n\nSee you at the gala!\n\nNetstrata Wollongong\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}