{
  "url": "https://netstrata.com.au/noise-complaints/",
  "timestamp": "2025-11-03T17:49:08.229267",
  "success": true,
  "content": {
    "title": "Noise Complaints in Strata Schemes",
    "date": "2013-07-21T23:09:50+00:00",
    "category": null,
    "author": "S J",
    "main_content": "A common complaint amongst neighbours living in a strata environment is excessive noise that can be heard from one apartment to another. It might be music from a sound system, a conversation on a balcony or an eager musician practicing their instrument at an anti-social time.\n\nThere are regulations in place for acceptable levels of domestic noise. In general, each Council will have their own policy on noise levels – with specific time restrictions when silence should be observed.\n\nAs an example, let’s take a look at the various restrictions in place for residents living under the auspices of North Sydney Council.\n\n- Power tools and equipment (powered garden tools eg lawn mowers, leaf blowers; electric or pneumatic tools; chainsaws or circular saws; gas or air compressors; swimming pool or spa pumps):\n\nRestricted between 8pm to 7am on weekdays and Saturdays. 8pm to 8am on Sundays and public holidays.\n\n- Musical instruments and sound equipment (eg. radios, TVs, tape recorders, record or CD players, public address systems, computer games):\n\nRestricted before 8am and after midnight on any Friday, Saturday or day immediately before a public holiday, or before 8am and after 10pm on any other day.\n\n- Air-conditioners:\n\nRestricted 10pm to 7am on weekdays. 10pm to 8am on weekends and public holidays.\n\n[IMAGE_0]\n\nWhile North Sydney Council prohibits noise between certain hours, it is worth noting that outside these prohibiting times, “restrictions can be placed on using these articles if they cause offensive levels of noise.” Therefore if the noise source causes offense to another resident, then the user may be in breach of a noise violation regardless of the time.\n\nSo what should you do if you believe your neighbour is in breach of noise restrictions or if your neighbour’s noise is affecting the enjoyment of your apartment?\n\nAt Netstrata we recommend the following course of action.\n\nThe first step is always to try and resolve the situation amiably. We suggest calmly discussing the situation with your neighbour in an attempt to find an amicable solution for all. On many occasions, we find that neighbours may be unaware that sound from their apartment can travel and will be only too happy to rectify the situation.\n\nIf the offense occurs after hours, you are entitled to call the police who have the power to issue a Noise Abatement Order if they are satisfied the music is obtrusive and offensive. Once issued, the abatement direction must be obeyed immediately and the offender cannot breach the direction for the following 28 days. In North Sydney, an on the spot fine can be issued to repeat offenders after being directed to desist by the police or a local council officer.\n\nIf the friendly approach fails and your neighbour continues with a noise violation, the next step is to take your complaint to the Strata Committee for your building. We recommend writing a letter to the Strata Committee outlining the situation. The Strata Committee then has the option of instructing your Strata Manager at Netstrata to act on the situation.\n\nAs your Strata Managing Agent, there are a number of steps we can take to ensure the offending individual complies with the will of the Owners Corporation, however we must remain impartial for all proceedings. Upon instruction, the first step we would take is to forward a copy of the complaint to the alleged offender, citing a breach of noise regulations and the strata schemes by-laws. The offender is entitled to either issue a right of reply if they wish to deny wrong-doing or formally apologise for the offense.\n\nIf this step fails to resolve the issue, as Strata Managers, we can issue a Section 45 Notice to Comply (providing that the necessary motions are passed by the Strata Committee), which can then be enforced via a penalty fine application to the Consumers Traders and Tenancy Tribunal.\n\nIf these approaches fail, the next step is to seek an order from the Consumers Traders and Tenancy Tribunal (CTTT), a Tribunal established to resolve disputes between tenants, landlords, traders and consumers in a timely and effective manner. If you decide to take formal action, we advise that you should have fully documented evidence of the offense including specific times, dates, duration, nature or type of noise, location of the noise, and statutory declarations from other witnesses.\n\nIf you have any further questions about noise violations, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}