{
  "url": "https://netstrata.com.au/keep-safe-covid-19-delta-variant/",
  "timestamp": "2025-11-03T17:41:32.924477",
  "success": true,
  "content": {
    "title": "How to keep you and your neighbours safe against the COVID-19 Delta variant",
    "date": "2021-07-26T07:24:23+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The current lockdown in Sydney as a result of the COVID-19 delta variant spreading through the city comes with additional restrictions – especially for those living within a strata scheme. As compared with our lockdown in 2020, we all need to take this lockdown one step further to limit the spread of the highly contagious variant. Here’s a snapshot of how to keep you and your neighbours safe.\n\n#### Wear a mask in all common areas\n\nFrom July 13, everyone, including residents, tradespeople and cleaners, must wear a fitted face mask when entering and moving through the common areas of the property. This includes the corridors, lifts, staircases and shared laundry facilities. Once you’re inside your apartment you can remove the mask. All recreational common areas such as the pool or gym should be closed to all residents until we’re out of lockdown. It’s also best to limit the amount of people sharing the lift. The NSW Government have produced this poster if you’d like to display it on the notice boards.\n\n#### Limit the time you spend in the common areas\n\nNormally we’d be encouraging strata communities to be social and to get to know your neighbours. However, these are challenging times. It’s best that you don’t stop and have a chat in the common areas. If you’d like to catch up, give each other a call on the phone, have zoom call or chat on whatsapp. Rather than practicing social distancing in the common areas, it’s best to move swiftly from the front door to your apartment.\n\n#### Postpone non-essential renovations\n\nThe government has placed a temporary pause on all construction work. Even if there isn’t a government mandated pause, it’s best to put on hold all non-essential renovations for the time being. Obviously, if there’s an electrical or plumbing issue that needs rectifying, don’t hesitate to seek assistance but those nice-to-have upgrades can wait.\n\n#### Increase the common area cleaning\n\nThe owners corporation may consider increasing the frequency of the cleaning of the common areas – in particular wiping down balustrades, door handles, lift buttons and anything else that’s touched frequently. It’s a good idea to have a tub of hand sanitiser at your front door to use every time you return home. And don’t forget, the cleaners must wear masks when they’re inside the property.\n\n#### Collect deliveries at the building entrance\n\nRather than buzzing your Uber eats delivery person up to your apartment’s front door, consider the contact-less approach and get them to leave your order at the building door. Not only are you increasing the efficiency of the driver but you’re also minimising the foot traffic into your building. You might like to consider home delivery of your groceries; that way, you’ll save yourself a trip to the supermarket.\n\n#### Follow the rules\n\nIt might seem obvious but the rules are designed to prevent the spread of the virus. If you lived in a detached house and you flaunt the rules then you’re exposing your own household to the virus – which we’re told is a key reason why infections are increasing. Living within a strata community has the potential to expose many households to the virus given that everyone uses the common areas. This isn’t the time to hold parties in your apartment or even to invite guests over.\n\nIf you have any questions about how COVID-19 affects your scheme, please call your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}