{
  "url": "https://netstrata.com.au/stephen-brell-elected-to-sca-board/",
  "timestamp": "2025-11-03T17:56:14.684856",
  "success": true,
  "content": {
    "title": "Stephen Brell elected to SCA Board",
    "date": "2017-11-10T06:32:25+00:00",
    "category": null,
    "author": "S J",
    "main_content": "As the newly elected Director of Strata Community Australia, NSW, Netstrata’s Managing Director, Stephen Brell hopes to make a difference to the industry and to strata living.\n\n“It’s my intention to increase the public profile of SCA and also to increase the education and professionalism of managing agents,” said Stephen.\n\n“The SCA is the peak strata body representing managing agents, suppliers and owners that work and live in strata schemes nationally.”\n\nStephen began his strata career with Netstrata 20 years ago – in fact he was Netstrata’s first employee. He had previously worked in real estate as a property manager and sales agent.\n\nGiven his background and experience it was a logical step to pursue a position on the 2018 Board of SCA. Members voted in his favour at the AGM on October 20.\n\nStephen believes the ingredients that make a great strata manager include having excellent people skills and problem solving skills with a customer service approach.\n\n“At Netstrata, we’re focused on customer service, providing owners with direct access to their strata manager. Our managers are responsible for all aspects of management including financial, maintenance and administration; this means they’re completely aware of the issues affecting their client’s schemes rather than having these tasks performed by a different department or entity,” he said.\n\n“We also use technology and software as much as possible to provide owners with access to information.”\n\nAccording to Stephen, it’s technology that will continue to have an even more significant impact on strata living – particularly access to information for strata owners as well as the conduct of meetings, online attendance and electronic voting. Stephen hopes this will make the decision making process more inclusionary and efficient.\n\n“Technologies such as solar panels, electric batteries and charging stations will also provide Owners Corporations with viable options not only to reduce their energy costs and carbon footprints, but perhaps even become suppliers of electricity to the individual residents within their client schemes.”\n\nStephen is proud that his team have managed some strata properties since the inception of the business – more than 21 years ago.\n\n“My advice to managers is to build relationships with the suppliers to the scheme. Understand the services they provide whether it’s cleaning, maintenance or management,” he said.\n\n“It’s also important to understand strata levies. When they’re used properly, they are an investment in the maintenance of the building and should not be seen as a ‘tax’ or ‘impost’ but rather an investment contribution to the future value and saleability of the property.”\n\nAs a parting comment, Stephen said that by 2030 there will mostly likely be more Australians living and working in strata title properties than traditional free standing dwellings – so the future of the industry is bright.\n\n“It’s an emerging profession that is virtually recession proof, resistant to threats such as ‘off-shoring’ or disruptors such as Uber. It’s suitable for anyone of any age, regardless of whether you’re a school-leaver or approaching retirement. It can be a rewarding career both financially and intellectually and I’d recommend it to anyone that likes a challenge, has good problem solving skills as well as people skills.”\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}