{
  "url": "https://netstrata.com.au/no-ground-evictions/",
  "timestamp": "2025-11-03T17:49:01.862234",
  "success": true,
  "content": {
    "title": "No Ground Evictions",
    "date": "2023-04-06T06:42:13+00:00",
    "category": null,
    "author": "S J",
    "main_content": "In an effort to give tenants on rolling leases greater security in their rental property, the former Liberal Government and newly-elected Labor Government intend to replace “no ground evictions” with “reasonable ground evictions.”\n\nIn making the announcement in the lead-up to the recent NSW state election, Dominic Perrottet was quoted in the Sydney Morning Herald as saying, “These new measures will provide even greater certainty and flexibility for nearly a million renters across NSW.”\n\nThe list of reasonable grounds will be fleshed out after consultation with industry stakeholders – with the aim of also ensuing landlords still maintain appropriate rights. Possible reasonable grounds could be the desire to sell the property or perhaps the landlord wishes to move back in.\n\nIt was also the intention of the NSW Liberal Government to extend the notice period for “end of fixed-term tenancies” from 30 to 45 days. Introducing optional longer lease agreements of three or five years was also floated, together with a portable bond scheme (where tenants won’t have to pay a new bond while they’re waiting for their current bond to be returned to them, as the funds will rollover) and regulating data collection from renters.\n\nThen Labor spokeswoman for better regulation and innovation, Courtney Houssos, and now Minister said, “We want to make sure those reasons are enshrined in legislation. That is going to be our first priority for the rental commissioner.”\n\nLabor promised to appoint a newly-created NSW rental commissioner to advocate for renters. This role could potentially assist with making it easier for renters to have pets, increase rental supply and install five-year security funding for community groups and service providers.\n\nAccording to newly-minted Premier Chris Minn’s website, “a NSW Rental Commissioner will be an advocate and voice for renters by working closely with government, consumer affairs, stakeholders and renters to:\n\n- Lead consultation and drafting of legislation to introduce reasons for eviction;\n- Implement Labor’s portable bonds scheme;\n- Oversee a ban on secret rent bidding;\n- Identify barriers to increasing housing supply for renting;\n- Identify practices and gaps that erode the rights of renters;\n- Identify options for longer term agreements, giving security and certainty to both renters and owners;\n- Initiatives including educational resources for renters and owners to increase knowledge of their rights’\n- Gather data on renting and survey renters to help inform future policy making; and\n- Identify ways for renters to more easily access energy efficiency initiatives.”\n\nJenny Leong, Greens housing spokesperson, said her party was committed to ending no grounds evictions also.\n\n“It would tip the balance and immediately provide more protections on renters, if they raise concerns on maintenance and other issues they are not facing evictions by simply making a complaint,” said Jenny Leong.\n\nAt Netstrata, we support initiatives that create vibrant and harmonious strata communities. Giving tenants greater protections for where they choose to live while simultaneously maintaining landlords’ rights can only lead to more positive strata environments.\n\nIf you have any questions around how we can support with your strata community, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}