{
  "url": "https://netstrata.com.au/holiday-season/",
  "timestamp": "2025-11-03T17:37:55.706234",
  "success": true,
  "content": {
    "title": "Holiday Season",
    "date": "2023-12-11T21:00:55+00:00",
    "category": null,
    "author": "Shona Phillips",
    "main_content": "With COVID restrictions firmly in the rear-view mirror, we’re very much looking forward to the upcoming festive season. We’ve put together this article to help you and your strata community enjoy this holiday period.\n\n#### Noise pollution\n\nJust because it is the end of the year doesn’t mean that there’s a “pause” on noise related by-laws. If you’re holding a party and the noise impacts your neighbour’s enjoyment of their apartment, then you’ve breached the by-law. It’s also best to ensure that your guests are courteous when they use the common property – whether they’re walking through the corridors, using the pool or enjoying the landscaped gardens.\n\n#### Visitor parking\n\nWith increased visitors over the end of year period, the chances are the prized visitor parking spots are going to be in high demand. Designated resident spots don’t become proxy visitor parking and appropriate time limits on visitor parking still applies.\n\n#### Additional rubbish\n\nParties and gatherings will generate additional rubbish. If your scheme has communal bins, the Strata Committee may consider arranging for an increase in rubbish collection during this period to mitigate against over-flowing bins. Although it’s holiday time, continue to separate your rubbish and recycle whatever you can. Similarly, Strata Committees might find it beneficial for the common property cleaners to also come more often.\n\n#### Short-term rental\n\nThe end of year is a great time to get away and have a holiday. Thanks to short-term rental websites such as Airbnb and stayz, it’s relatively easy to supplement the cost of your holiday by renting out your apartment. However before you list the apartment, it’s best to check that your property’s by-laws permit short-term rentals. And while the guests are in your place, you’re responsible for their behaviour and you’re liable for any damage that the guests make to common property – it’s best to give them a copy of the by-laws in advance.\n\n#### Look out for your neighbours\n\nIf you decide to take a holiday, ask a trusted neighbour to keep an eye on your apartment. Maybe leave them with a key if they need to access your place. They could water your indoor and balcony plants, and empty your letter box. Most importantly, they could keep a look out for any suspicious activity.\n\n#### Emergency repairs\n\nSometimes the plumbing or the electricals decide to impact our enjoyment of the festive season. For both the Strata Committee and individual owners, it’s best to be prepared and know in advance which tradespeople are available over the end of year period. If you’re away and emergency services need to access to your apartment, consider leaving your keys with a trusted neighbour or family member.\n\nIf you have any further questions about the holiday season, give your Strata Manager a call at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}