{
  "url": "https://netstrata.com.au/strata-manager-of-the-year-2016/",
  "timestamp": "2025-11-03T17:57:53.127609",
  "success": true,
  "content": {
    "title": "Young Strata Manager of the Year shares his thoughts",
    "date": "2016-08-15T14:25:52+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The recently feted Young Strata Manager of the Year, Andrew Tunks, believes the judges were impressed by his unique approach towards strata management.\n\n“The judges’ focus appeared to be finding a manager who uses their skills to innovate. I presented a project that I was working on involving the use of existing property management software or apps on my iPhone and adapting this to strata buildings for the purpose of property inspections. I showed them a report I had drafted which I would present to committees,” said Andrew.\n\n“The judges noted that the most common complaint they receive relates to strata manages being on-site and communicating. They found my property inspection report and action list to be a helpful way of showing committees the work I had done on their property.”\n\nThe annual CHU Strata Community Awards were presented this year at a gala dinner at The Star. These awards, “recognise and reward those individuals and companies who make a significant contribution to the strata industry and community,” as stated on the Strata Community Australia website.\n\n“The award means recognition in the industry and with my peers. It has been a goal of mine to achieve this award and I am humbled by receiving it as I didn’t expect it. God willing, I hope to try again in the years to come,” said Andrew.\n\nHailing from Panania in south-west Sydney, Andrew started out by working in property management before moving across to Netstrata just over eight years ago.\n\n“The move into strata management was to further my career in the management side of properties rather than sales. Working at a real estate agency I had a choice to either move into sales or pursue other career options,” he said.\n\n“At that point, the sales market was tough and for a 21 year old trying to establish a career, strata management was very appealing. I knew strata management would be tough, but I wanted a fresh challenge so I made the move to Netstrata.”\n\n[IMAGE_0]\n\nWhen asked what makes a great strata manager, Andrew replies that the essential qualities include a good communicator, can manage stress easily and someone who constantly re-evaluates their priorities.\n\nHe acknowledges that there are challenges around every corner that keep him on his toes.\n\n“On the one hand we have new legislation looming that will prove to be one of the largest challenges for all strata managers. On the other hand, the industry is growing to be more competitive and as such costs and efficiencies are regularly reviewed. Personally the biggest challenge I face is finding the time to constantly learn and educate myself on changes in strata legislation, building warranty legislation and the changes to processes with NCAT.”\n\nWhile the award is a great recognition of his own achievements, Andrew does recognise the role Netstrata has played in nurturing his talent.\n\n“Netstrata sets the standard for professionalism and our directors always share their ideas for more effective management. I believe we will continue to reinvent our management style and experience growth,” said Andrew.\n\n“We aim to resolve the problems at a building before they are even noticed or reported by the owners. We get out to the site, and monitor our trades and the needs of the buildings. This sets us apart from other companies.”\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}