{
  "url": "https://netstrata.com.au/cttt/",
  "timestamp": "2025-11-03T17:34:28.864764",
  "success": true,
  "content": {
    "title": "Resolving Disputes Through The Consumer Trader and Tenancy Tribunal (CTTT)",
    "date": "2013-12-11T22:22:30+00:00",
    "category": null,
    "author": "S J",
    "main_content": "It’s the intention that people involved in a strata community live harmoniously together. But on occasions, disputes do arise. Excessive noise, damage to common property and keeping pets are the most common areas of contention.\n\nAs a last resort, the Consumer, Trader and Tenancy Tribunal or the CTTT was set up in 2002 to settle disagreements.\n\nDecreed under the Consumer, Trader and Tenancy Tribunal Act 2001, the CTTT merged the Fair Trading Tribunal and the Residential Tribunal together to offer an efficient dispute resolution forum for consumer, trader and tenancy matters. All orders issued by the Tribunal are legally enforceable.\n\nStrata schemes fall under the Strata and Community Schemes jurisdiction of the CTTT. In the event of a dispute, individual lot owners, Owners Corporations and occupiers can lodge an application to the CTTT. This should be considered as a final attempt, where all other forms of resolution have failed to provide a mutually satisfactory outcome.\n\nPrior to lodging an application with the CTTT, the two parties must attempt mediation. The NSW Fair Trading department employs qualified mediators who are skilled in dealing with strata and community scheme disputes.\n\nIf mediation fails then there are two options available through the CTTT: adjudication and tribunal hearings.\n\nThe adjudication process involves a determination by the CTTT based only on papers and documents submitted. There is no hearing. Once the adjudicator has made a judgement, the orders and the reasons for the decision are sent in writing to all people involved in the dispute, including the Owners Corporation and those who submitted the paperwork.\n\nDecisions can be appealed providing the appeal papers are lodged within 21 days after the order takes effect. The appeal would be held at hearing.\n\nStrata related disputes that haven’t gone through the adjudication process can also be resolved at a hearing. Common disagreements presented at a hearing include amending or revoking an order, changes to unit entitlements, changes to management statement, penalty applications, appointment of a managing agent and contributions and levies.\n\nOnce all parties have presented their evidence, the Tribunal Member will make an order and explain the reasons behind the decision.\n\nFor more information on dispute resolution with the CTTT, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}