{
  "url": "https://netstrata.com.au/supporting-your-strata-community-through-covid-19/",
  "timestamp": "2025-11-03T18:00:15.256351",
  "success": true,
  "content": {
    "title": "Supporting Your Strata Community Through COVID-19",
    "date": "2020-04-30T05:00:28+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The effects of COVID-19 are far-reaching, destabilising and unsettling. The government has advised us to practice social distancing, leave the house only when necessary and wash our hands frequently to help prevent the spread of the virus.  A strata scheme can present its own challenges to curb the spread and save lives. So how can you help each other get through this – even if your gym and pool have been temporarily closed? After all, a strata scheme is a community by virtue that you all live in the same building. What can you do to leverage the community around you to support each other?\n\nPractise social distancing in the common areas\nSocial distancing doesn’t end when you arrive at your building. You should continue to stay 1.5 metres away from your neighbours in the corridors, lifts and any other common area in your building – even if this means letting your neighbour take the lift with their family and you get in next. Your Strata Committee may consider putting up signs on the notice boards reminding owners and tenants.\n\nStay virtually connected\nJust because you can’t get closer than 1.5 metres, doesn’t mean you need to disconnect. Technology can be fantastic way to connect with your neighbours. Set up a Whatsapp or Facebook group for your scheme or building and share stories. If you’re popping down to the shops, let everyone know just in case somebody’s in need of a box of tissues. This is the time to help each other out and support each other.\n\nGive your neighbours a call\nWhile staying connected by sharing messages on a virtual group is great, don’t hesitate to pick up the phone and chat with each other. Use this opportunity to build deeper friendships with the other people in your scheme – just don’t invite anyone over for a cuppa just yet.\n\nOrganise a balcony concert\nWe’ve seen the videos from Italy, where DJ’s start pumping out music from their balcony. While you don’t necessarily need to arrange a full-on dance party, perhaps the musicians in the building could perform on the balconies. You could live stream the music with your Facebook group. Needless to say, at other times, don’t play music at a volume that the sound could travel or cause unnecessary distress with your neighbours. Tempers may fray, so please be considerate.\n\nPostpone non-essential renovations\nWhile it might be an inconvenience, your new bathroom or kitchen can wait – even if you have full Strata Committee approval. Normally the trades-people would work during the day when everyone else is out of the building at their workplaces. But now many people are working from home, so the noise from the renovations may disturb your neighbours.\n\nIncrease the common area cleaning\nThe virus can remain active on hard surfaces for a period of time after an infected person has touched them. For the safety of everyone in the scheme, it’s worth increasing the frequency of the cleaning of the common areas – in particular wiping down balustrades, door handles, lift buttons and anything else that’s touched frequently. If you’re particularly nervous, have a tub of hand sanitiser at your front door to use every time you return home.\n\nCollect deliveries at the building entrance\nFood deliveries, in particular, have spiked since the government closed seating in restaurants. Rather than buzzing your delivery person up to your apartment’s front door, consider the contact-less approach and get them to leave your order at the building door. Not only are you increasing the efficiency of the driver but you’re also minimising the traffic into your building.\n\nFollow the rules\nIt might seem obvious but the government has issued laws to prevent the spread of the virus. If you lived in a detached house and you flaunt the rules then you’re exposing your own household to the virus. Living within a strata community is very different. The potential for the spread of the virus through your scheme is far greater given that everyone uses the common areas. This isn’t the time to hold parties in your apartment or head down to the beach.\n\nIf you have any questions about how the COVID-19 affects your scheme, please call your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}