{
  "url": "https://netstrata.com.au/the-strata-managers-role-in-owners-corporation-budgeting/",
  "timestamp": "2025-11-03T18:02:35.638074",
  "success": true,
  "content": {
    "title": "The Strata Managers Role in Owners Corporation Budgeting",
    "date": "2012-08-29T03:38:51+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Budgets must be prepared annually for the administrative and sinking funds: ss. 75(1) and 75(2).\n\nAdministrative fund budgets estimate how much money the owner’s corporation will need for Actual and expected expenditure:\n\n- To maintain in good condition on a day-to-day basis the common property\n- Personal property vested in the owner’s corporation\n- To provide for insurance premiums\n- To meet other recurrent expenses\n\nRecurrent expenses includes regular expenses such as insurance excesses, water charges, electricity, carpet cleaning, lawn mowing and minor expenses relating to maintenance of common property. In budgeting for administrative expenses, strata managers need to keep track of any likely abnormal increases in expenditure. Recent examples include the exorbitant\n\nThe sinking fund budget is required to estimate how much money the owner’s corporation will Need for actual and expected expenditure for:\n\n- Painting or re-carpeting buildings or other structures on the common property\n- Acquiring personal property\n- Renewing or replacing personal property\n- Renewing or replacing fixtures or fittings that are part of the common property\n- Replacing and repairing the common property\n- Meeting other expenses of a capital nature\n\nIn estimating amounts to be credited to the sinking fund, an Owners Corporation must take into account anticipated major expenditure identified in the 10-year sinking fund plan required by s.75A. The idea of the 10-year plan is to force owners of the day to pay progressively for their use of the common property. The Act permits the owners corporation to engage expert assistance in the preparation of the plan but does not oblige the owner’s corporation to use an expert. A recent study has shown most owners do not use experts: Where plans are prepared externally and an Owners Corporation decides not to levy in Accordance with the recommended plan, there should be a good reason. Many sinking funds are underfunded and it is possible that a new member of an owner’s corporation might sue the owners corporation for not having properly funded their sinking funds before their period of ownership. Strata managers might be liable on this account as well.\n\nThank you TEYS Lawyers for this Article",
    "images": []
  }
}