{
  "url": "https://netstrata.com.au/navigating-rising-strata-insurance-premiums-challenges-and-strategies/",
  "timestamp": "2025-11-03T17:44:38.095856",
  "success": true,
  "content": {
    "title": "Navigating Rising Strata Insurance Premiums: Challenges and Strategies",
    "date": "2023-12-05T22:55:57+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Rising insurance premiums in NSW are causing a large degree of stress for Owners Corporations. Increases of 20% or more annually and limited renewal quotes can be frustrating. These challenges stem from evolving difficulties in securing insurance for strata schemes, compounded by broader economic issues affecting Australia and the world.\n\nSo, what’s behind these challenges, and how can strata schemes tackle them?\n\nBefore delving in, a quick disclaimer: This isn’t financial advice, but observations based on experiences across various schemes that Netstrata manage. To explore specifics for your scheme, reach out to your strata manager for a discussion with your strata insurance broker.\n\nThis article aims to assist members of the strata committee involved in insurance placement. If you’re an owner but not on the committee, connect with your strata manager for insights into managing this crucial matter.\n\nIn New South Wales, strata schemes are mandated by law to have specific insurance coverages, potentially including optional extras. Avoiding this requirement is only possible with a Tribunal order. Although this article focuses on strata plans, buildings within BMCs or mixed-use have additional conditions.\n\nThe challenge lies in finding insurance policies complying with NSW legislation. Strata plans face limited options: seeking insurers specialising in NSW policies, engaging non-specialist insurers to craft a custom policy, or combining overseas coverage with local insurers for complete protection. Crafting a policy to match NSW laws with an overseas insurer is challenging and costly, pushing strata plans towards local insurers or mixed policies where possible.\n\nIn our experience, quotes from NSW-focused insurers tend to be more viable. Opting for mixed policies becomes a last resort when the strata insurance market offers no relief, but it often incurs exorbitant costs.\n\nThe primary hurdle is the scarcity of insurers specialising in NSW strata, hampering market competition. Moreover, some insurers decline to quote for specific building sizes or with certain features like flammable cladding, limiting bargaining power.\n\nCompounded by economic hardships, investors’ reluctance to risk money in insurances leads to premium hikes across the board. Insurers are pulling back from covering buildings due to waning confidence post-incidents like Grenfell Tower and Mascot Towers. Consequently, insurers prefer allocating capacity elsewhere, driving premiums higher.\n\nTo address this, strata schemes should:\n\nCarefully select an insurance broker early in the renewal cycle, prioritising expertise over fees. Netstrata has the benefit of its own specialist brokerage Strata Insurance Services who are specialists in placing strata policies.\nReview remuneration models for strata managers, shifting away from commission-based structures.\nPrioritise preventative maintenance to avoid claims and rectify defects, enhancing negotiation leverage.\nInitiate early discussions with brokers and managers for upcoming renewals, allowing time to address issues that might impact premiums.\nSet realistic expectations for premiums and communicate any potential increases to owners promptly, ensuring transparency and understanding.\n\nDespite these measures, if faced with significant premium hikes, proactive communication can mitigate surprises during AGMs, ensuring owners comprehend the situation and focus on maintaining a well-kept building.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}