{
  "url": "https://netstrata.com.au/strata-hub/",
  "timestamp": "2025-11-03T17:57:33.881750",
  "success": true,
  "content": {
    "title": "Strata Hub",
    "date": "2022-07-27T07:03:40+00:00",
    "category": null,
    "author": "S J",
    "main_content": "From August 2022, all strata schemes will be required to report annually to the NSW Government through a secure online portal.\n\nAccording to the state government, “The new reporting requirement, for the first time, will digitally consolidate data about the state’s 83,000 strata schemes on the NSW Strata Hub. This will bring greater accountability on how strata schemes are being run.”\n\n“People owning and living in strata will know that NSW Government and emergency services can communicate with their strata schemes quickly and directly with:\n\n- vital community services information in the event of a crisis\n- changes to strata laws that impact them.”\n\n“Overall, benefits to strata communities include:\n\n- Access to up-to-date information, with strong privacy and security safeguards\n- Support for emergency services to contact or access your strata scheme if there is an emergency\n- Targeted communication and better strata services, thanks to accurate and up-to-date information.”\n\nThe strata scheme’s secretary or chairperson is required to submit the information. The reporting can also be delegated to the strata manager. You can register your scheme now through the Strata Hub. The NSW Government has produced a user guide to the portal.\n\nOnce you access the portal, here’s the information that needs to be completed:\n\n- Strata plan number and address\n- Registration date\n- Number of lots in the strata scheme\n- Contact details of the chairperson, secretary, strata manager (if any) and building manager (if any).\n- Nominated strata scheme contact for emergency services.\n- Date of issue for interim or final occupation certificate\n- If there is a strata renewal committee, the date it was established\n- Number of lots used for the following purposes: residential, retirement village, commercial, utility lot and other purposes\n- Number of storeys (in multi-level residential apartment buildings).\n\nYou’ll also need information from the most recent annual general meeting and supporting financial documents including:\n\n- Last AGM date\n- Date annual fire safety statement issued\n- Current insured replacement value of building\n- Reported balance of capital works fund from the last financial statements at the AGM.\n\nStrata schemes that have held at least one AGM must submit their first report by 31 December 2022. The bulk upload functionality for reporting on multiple strata schemes will be available from September.\n\nFrom 2023, the reporting must be completed within three months of the scheme’s AGM. If the contact information changes throughout the year, the portal must be updated within 28 days of the change.\n\nA series of webinar’s are being run for strata committee members and strata managers to help with the portal. You can register your interest online.\n\nIf you require any further information about the mandatory reporting requirements, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}