{
  "url": "https://netstrata.com.au/changing-entry-to-apartment/",
  "timestamp": "2025-11-03T17:32:21.227748",
  "success": true,
  "content": {
    "title": "Changing the Entry to Your Apartment",
    "date": "2017-06-06T06:19:45+00:00",
    "category": null,
    "author": "S J",
    "main_content": "While the interior of an apartment can be styled to an owner’s personal preference, there are limitations to what owners can do to their entry door that faces a common area.\n\nAs a general rule, the corridors of a strata building and the doors that face the common property fall under the auspices of the Owners Corporation. All maintenance and styling of these areas are made as a collective decision. This ensures uniformity throughout the building. The colour of the paint on the walls and doors, and the choice of carpet in the hallway are decided by the Owners Corporation.\n\nThere are occasions when owners may prefer to add their own individual touch to their entry door. The most obvious example is a decorative door knocker. Strictly speaking, owners cannot alter the appearance of the front door – including fixing their choice of door knocker. If an owner would like to personalise their door, then they should seek approval from the Strata Committee.\n\nDoormats and shoe racks are other examples. Owners might prefer to place a doormat in the common area so that they can wipe their shoes before entering the unit or for cultural reasons they’d prefer to leave their shoes on a rack outside the apartment.\n\nAn owner should always seek approval from the Strata Committee to leave a mat or rack permanently outside their door in the hallway. There may be insurance implications that would need to be resolved before permission is granted. Reassurance may also be sought that the corridor remains an easy thoroughfare for all residents in day to day activities and also in the unlikely event of an emergency.\n\nIf an owner hasn’t sought permission to personalise their entry door, the Strata Committee should contact the owner and ask them to remove the offending items. If the owner refuses to comply then the situation can proceed to arbitration with the tribunal.\n\nUltimately common areas are just that – they are areas that are used by all residents. It’s important to be respectful of the other owners in the building by showing a sense of conformity where it’s appropriate and to ensure the safety of owners and their guests.\n\nAs an owner, if you feel that another owner is abusing their position, you’re entitled to make a formal complaint to the Strata Manager who will offer guidance to resolve the situation amicably.\n\nFor more information on common areas, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}