{
  "url": "https://netstrata.com.au/what-you-need-to-know-about-renting-your-garage/",
  "timestamp": "2025-11-03T18:05:03.369445",
  "success": true,
  "content": {
    "title": "What You Need to Know about Renting Your Garage",
    "date": "2019-08-27T03:33:44+00:00",
    "category": null,
    "author": "S J",
    "main_content": "While renting out your spare bedroom through websites such as Airbnb has dominated the news in recent years, another area that has the potential to provide a little extra money each week is the garage or parking space.\n\nEspecially in commercial districts and properties near train stations where street parking is limited and parking stations are expensive, there is a demand for workers and commuters to have a secure and reliable place to leave their car.\n\nThere may also be other people in your complex that would appreciate a little extra storage space beyond their own garage.\n\nBut what the implications of renting out your garage?\n\nUnless your strata scheme has a specific by-law restricting the ability to rent a parking space or garage to a third-party then there’s nothing to prevent you from doing so. This space is considered part of your lot allocation.\n\nIf you’re interested in purchasing a property in a strata scheme with the intention of renting out the garage, always check the by-laws prior to buying the apartment.\n\nA part of the process, we’d recommend having the renter sign a Parking Space Lease. This way you’ll have a legally binding document that outlines the terms of the agreement. If you want to limit access, you could use the lease to specify that the space can only be used during certain times such as business hours or on the weekend. You can also set the time period so that in six months for example, depending on market conditions, you could increase the rent.\n\nIt’s important to be mindful that while the renter is on the scheme’s property, you are liable for any damage they may cause to your lot – in the same way that you’re liable for any guests that visits your apartment. You may consider taking out landlord insurance for peace of mind.\n\nSimilar to the apartment itself, if you’re using the garage for storage, you’re welcome to construct free-standing shelving without permission from the Strata Committee. But any structural changes would require prior approval.\n\nWhile using the garage for storage or a vehicle is legal, this space can’t be used as a bedroom because it’s not deemed to be a “habitable” area. There are serious safety issues with living in a garage and there are most likely Council regulations also. Furthermore, standard insurance policies held by the Owners Corporation wouldn’t include human occupation of the garage.\n\nIf you believe that a garage in your scheme is being inhabited, call your Strata Manager who will then contact the owner for further investigation. If needed, the NSW Civil and Administrative Tribunal (NCAT) has the power to intervene and issue an order to the owner.\n\nIf you have any questions about renting your car space, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}