{
  "url": "https://netstrata.com.au/solar-battery-incentive/",
  "timestamp": "2025-11-03T17:55:26.075761",
  "success": true,
  "content": {
    "title": "Solar Battery Incentive",
    "date": "2025-01-31T05:37:55+00:00",
    "category": null,
    "author": "S J",
    "main_content": "To assist with helping to make the electricity grid more reliable during periods of peak demand, the NSW Government is offering incentives towards the installation cost of a new battery for households and strata communities.\n\nThis initiative is designed to support NSW’s climate goals of reducing emissions by 70% by 2035 and achieving net zero by 2050. The government hopes to promote solar energy use and reduce the reliance on electricity.\n\nIn general, batteries can:\n\n- store and use solar energy to reduce electricity costs\n- keep power on during outages\n- reduce the environmental footprint by using more renewable energy\n\nUnder the Peak Demand Reduction Scheme (PDRS) that’s tasked with incentivising the reduction of peak demand during summer afternoons and evenings when demand for electricity is highest, this incentive is available to homes with existing rooftop solar systems and can be included as part of new solar and battery system installation for strata schemes that don’t have the panels. The batteries must be installed by an accredited supplier.\n\nIf you already have a battery installed, then you are ineligible for the incentive. Similarly, you’re not eligible if you replace the battery or add additional batteries.\n\nThe NSW Climate and Energy Action website explains how the scheme works, “Unlike a rebate, the discount on the installation cost of your battery is only offered by installers working with an accredited supplier, not directly through the NSW Government.”\n\n“The discount amount is related to the usable capacity of the battery in kilowatt-hours (kWh). This means larger batteries will receive larger discounts.”\n\nBatteries that have storage capacity between 2 and 28 kWh are eligible. Interestingly, the national average energy use for a 5-person household is 25 kWh per day.\n\nThe first step towards taking advantage of the incentive is to obtain quotes from several accredited suppliers for eligible batteries that meet the prescribed performance and warranty requirements.\n\nOnce you’ve selected the supplier and the eligible battery that suits your needs, the installer will give you the nomination form and a contract to sign. The form must be signed and returned to the installer before you can receive the discount on your installation.\n\nAs part of the installation process, the installer will submit all appropriate documentation to your distribution network and electricity retailer to connect the battery to the grid.\n\nIf you have any further questions about installing solar panels and batteries at your scheme, please contact your Strata Manager at Netstrata.",
    "images": []
  }
}