{
  "url": "https://netstrata.com.au/what-to-do-with-uncollected-goods/",
  "timestamp": "2025-11-03T18:04:50.330591",
  "success": true,
  "content": {
    "title": "What To Do With Uncollected Goods",
    "date": "2022-09-12T07:33:36+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Previously loved treasures may start gathering dust if your strata scheme has a communal storage area. Known as uncollected goods, they may have been deliberately or inadvertently abandoned over the years as tenants come and go, or as owners move on.\n\nAs we head into warmer months of Spring, you may wish to do a Spring clean of your communal areas or a general tidy up. However there are rules around the process that need to be followed for abandoned items.\n\nIn principle, the strata committee must make reasonable efforts to find the owner and give them the option of reclaiming the items. If it’s difficult to track down the original owner, the items can be moved if they’re in the way but a notice needs to be displayed prominently of the intention to dispose of the goods.\n\nIf you know who the owner is and how to contact them, a disposal notice can be emailed or mailed.\n\nThe written notice must include:\n\n- the name of a representative on the owners corporation\n- a description of the goods\n- an address where the owner can collect the goods\n- the cost of removal, storage, maintenance and if money will be taken out of the sale of the goods to cover this\n- a statement that unless the goods are collected and charges paid, they will be sold, kept or disposed of after a given date\n\nOnce you’ve issued the notice, how long you wait depends on the value of the goods – as a reasonable estimate of market value.\n\nFor items valued at less than $1000, the strata committee must wait 14 days before the items can be disposed of and for items valued between $1,000 and $20,000 it’s a 28 day wait.\n\nIf the value is over $20,000 an order must be issued by the NSW Civil and Administrative Tribunal. Each case will be different, so the Tribunal will decide how long to wait for a reply and the method of disposal that’s appropriate.\n\nRubbish, perishables or plants can be disposed of without any prior notice.\n\nA record should be kept of any items that are disposed of for 12 months for low value items and 6 years for high value goods.\n\nThe record should include:\n\n- a description of the goods\n- the date of disposal\n- the manner of disposal\n- if the goods were sold; the name and address of the buyer, proceeds amount and the amount kept to cover any costs\n- if the goods were sold by auction; the name and address of the principal place of business of the auctioneer.\n\nThe strata committee may elect to sell valuable items rather than disposing of them. Any costs associated with the sale can be taken from the sale, and any money left over should be treated as “unclaimed money” and transferred to Revenue NSW. If they original owner becomes aware of the sale, they can claim the money from Revenue NSW.\n\nIf you notice items that you suspect have been abandoned, it’s best to contact your strata manager or your strata committee.\n\nIf you have any questions relating to abandoned goods, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}