{
  "url": "https://netstrata.com.au/what-will-strata-administration-look-like-post-covid-19/",
  "timestamp": "2025-11-03T18:04:56.842769",
  "success": true,
  "content": {
    "title": "What Will Strata Administration Look Like Post COVID-19?",
    "date": "2020-07-14T06:30:07+00:00",
    "category": null,
    "author": "S J",
    "main_content": "### 1. Meeting Procedures\n\nUnquestionably the greatest impact to Strata Administration will be the evolution in the conduct of Meetings, both general meetings and committee meetings.\n\nAlthough conducting strata meetings via video and tele-conferencing was permitted in the changes to the 2015 Strata Legislation, many Owners Corporations and Strata Management companies were slow to adopt the technology.\n\nThe forced uptake of ‘virtual’ meetings has accelerated this avenue of meeting procedure and it is proving to be extremely popular amongst owners and committees, particularly those that may have had limited opportunity to attend meetings previously, for example, those that were time poor and unable to attend meetings due to work and family commitments or those living interstate and overseas.\n\nOwners are now able to attend a meeting from the comfort of their own home regardless of their location throughout the world. We’ve already seen several owners attend meetings from interstate, the U.S., Canada, China and the U.K.\n\nGreater participation in the meeting process allows for better understanding of issues facing the Owners Corporation, for committee members, owner occupiers and owner investors.\n\nOther advantages of virtual meetings include;\n\n(a) Elimination of Travel Times\n\nBecause meetings can be conducted from the comfort of the home or office, travel times to and from meetings are eliminated. Many owners have taken advantage of this convenience and are conducting smaller meetings, particularly committee meetings during the day or prior to the commencement of the traditional workday.\n\n(b) Recording Meetings\n\nWith the consent of the attendee’s present, most video conferencing software provides the host with the ability to record the meeting in its entirety. The recording may then be uploaded to a secure online portal for viewing by other owners later.\n\nThis has been extremely beneficial particularly where experts attend the meeting to discuss technical issues such as defects claims or where the Owners Corporation is planning major works.\n\nListening to the discussions surrounding the motions determined assists owners that were unable to attend the meeting to understand how resolutions were reached by those present.\n\n(c) Meeting Room Hire\n\nOwners avoid the costs of meeting room and facilities hire, which depending on the size of the scheme can be hundreds and sometimes thousands of dollars.\n\n#### So, does this mean the end of In Person Meetings?\n\nThe simple answer is no. For all the advantages of virtual meetings there is still one procedural element of an Annual General Meeting that is problematic in the virtual world and that is where there is a ballot for the Strata Committee. NSW Strata Legislation requires that a ballot for the committee be conducted ‘in writing’. A ballot occurs where there are more nominees for the committee than positions available (maximum 9). A virtual meeting does not lend itself for a strata committee ballot to be conducted in writing, however with the popularity of virtual meetings on the increase, hopefully the legislators will address this procedural anomaly.\n\n#### What will be the future of Strata Meetings?\n\nThe ‘new normal’ will likely see many Owners Corporations and committees adopting a hybrid model to conduct meetings. This will mean owners will be able to attend and vote at meetings using various forms including;\n\n(i) In Person\n\n(ii) Via Video-conference\n\n(iii) Via Telephone\n\n(iv) Via Pre-Meeting Electronic Voting, and\n\n(v) Traditional Proxy Voting\n\nWe have already started preparing for your Strata life in the post COVID-19 world and have invested heavily in the necessary technologies and infrastructure to allow your Owners Corporation and Strata Committee to conduct their Strata Meetings as efficiently as possible.\n\n### 2. Cashflow and Levy Arrears\n\nAs we have outlined previously, the economic impact of COVID-19 is already being felt by many owners and residents of strata properties. The direct result for Owners Corporations is a significant spike in levy arrears, which in turn impacts cashflow and the ability to pay for essential expenditure such as insurance, maintenance and utilities.\n\nGiven we have only been in lockdown since March 2020, we are yet to see the impact of a full levy arrears cycle. This comes at a time when services to buildings have increased, I.E. with hygiene being paramount many strata committees have elected to increase cleaning services beyond their allocated budget amounts and with residents working from home building loads have also increased. I.E. additional garbage services, plumbing loads and utility loads.\n\nFor many schemes this will mean a double impact of increasing arrears and increasing expenses, a combination that is not sustainable in the long term. Whilst we can expect the financial positions of many Owners Corporations to get worse before they get better, we are working closely with committees of affected schemes, as well as suppliers and owners facing financial difficulty to ensure that services to your Owners Corporation continue with as little disruption as possible.\n\n### 3. Community & Co-operation\n\nCrises often bring out the best and worst in people and pleasingly for residents of strata properties living in lockdown it would appear to be the former. NSW Fair Trading reports that overall applications for mediation for By-law breaches such as noise complaints and other nuisances have decreased over the last 3 months, which comes at a time when more residents are living and working from home.  This might be an indication that residents are either being more considerate, more tolerant or perhaps a combination of both. Here’s hoping that this will also become a new norm of life post lockdown.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}