{
  "url": "https://netstrata.com.au/governing-the-compact-city-unsw-city-futures-survey/",
  "timestamp": "2025-11-03T17:36:49.162950",
  "success": true,
  "content": {
    "title": "Governing the compact city – UNSW City Futures survey",
    "date": "2010-02-26T12:32:03+00:00",
    "category": null,
    "author": "S J",
    "main_content": "A new two-year research project, being undertaken with the assistance of the NSW strata industry, the NSW State Government and the Federal Government, will chart the key issues facing the governance and management of strata buildings. The research will be undertaken by the City Futures Research Centre at the University of NSW.\n\n[IMAGE_0]\n\nThe project is the first major study of the strata sector undertaken in Australia. Win 1 of 4 $250 Coles Myer Gift Cards (Authorised under NSW permit number LTPS/10/00291).\n\nThe research has three main aims:\n\nTo explore the role, capacity & effectiveness of owners’ corporations as agencies of property governance and management.\nTo explore the capacity & effectiveness of strata managers as mediators of outcomes for owners and residents in strata & their role within the overall structure of management & governance.\nTo assess how well residential strata works from strata owners’ points of view.\n\nThe project, which focuses on NSW, will deliver systematic information about the operation of the strata system. The findings will assist residents, owners and those involved in strata management and policy development to better understand the nature and scale of issues facing the strata sector and its capacity to self-manage these issues. It will provide an informed evidence base to support improved best practice and policy development across the sector. While it focuses on NSW, the results will inform policy and practice in the strata sector across Australia.\n\nThis survey is intended to gauge individual committee members’ opinions and experiences, rather than a collective Strata Committee view. We therefore encourage all individual Strata Committee members to participate. We would be pleased if multiple committee members in the one strata scheme complete the survey.\n\nGo to the their website to see the report.",
    "images": []
  }
}