{
  "url": "https://netstrata.com.au/strata-office-bearers-liability-insurance-the-strata-choice/",
  "timestamp": "2025-11-03T17:58:41.254629",
  "success": true,
  "content": {
    "title": "Strata Office Bearers Liability Insurance the Strata Choice",
    "date": "2013-08-27T12:37:27+00:00",
    "category": null,
    "author": "S J",
    "main_content": "### Office Bearer’s Insurance\n\nStrata members who hold an strata position may like to consider taking out Office Bearer’s insurance. This policy would provide financial protection in the event that as a committee member, you become personally liable for actual or alleged wrongful acts while undertaking the functions of the position you hold within the strata scheme.\n\nAlthough the committee may be covered under the Public Liability Section of a strata policy, there is generally a gap in what one could perceive to be an act of negligence against one individual officer or the committee collectively.\n\nThe NSW Government have enacted legislation regarding Office Bearer’s Insurance. Section 88 of the Strata Schemes Management Act 1996 contains the relevant clause.\n\n### What other insurance may an owners corporation take out?\n\n(1) An owners corporation may insure any property that it is not required to insure by this Part and in which it has an insurable interest.\n\n(2) An owners corporation may take out insurance, at its own expense, in respect of either or both of the following:\n\n(a) damage to property, death or bodily injury for which a person holding the office of chairperson, secretary, treasurer or member of the stata committee of the owners corporation could become liable in damages because of an act or omission, committed or omitted in good faith, in performing the functions of that office,\n\n(b) misappropriation of money or other property of the owners corporation.\n\nOffice Bearer’s insurance is not mandatory. However, at Netstrata we recommend that committee members take out an insurance policy for their own protection in the event that legal action is taken against them collectively or individually. Such actions could be instigated by other scheme members alleging mismanagement and any third party whether they’re residing on the premises or not.\n\nWhen selecting an appropriate policy for your situation it’s important to know what’s included and what’s excluded. Common exclusions include claims arising from circumstances which were known prior to taking out the policy, any dishonest or fraudulent acts, criminal or malicious acts and claims resulting from an intentional decision not to maintain insurance policies as required by the strata act.\n\nFor more information on Office Bearer’s insurance, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}