{
  "url": "https://netstrata.com.au/have-your-say-on-strata-laws/",
  "timestamp": "2025-11-03T17:37:14.555411",
  "success": true,
  "content": {
    "title": "Have Your Say on Strata Laws",
    "date": "2021-01-28T06:41:05+00:00",
    "category": null,
    "author": "S J",
    "main_content": "To kick off 2021, the NSW Government has invited the one million people living and working in strata communities to have their say on how strata laws can be changed for the better.\n\nAs part of a statutory review of both the Strata Schemes Development Act 2015 and the Strata Schemes Management Act 2015, community consultation is now open until March 7 2021. You can submit your views through the NSW Government website.\n\nAccording to the Minister for Better Regulation, Kevin Anderson, half the population of Greater Sydney is expected to be living in strata titled properties by 2040 given that there’s over 81,000 schemes currently registered in NSW and each year more than 1,000 new schemes are established.\n\n“It is important that the laws covering strata living stay relevant and address some of the fundamental issues that might be stopping people from fulfilling the great Australian dream of home ownership,” said Kevin Anderson.\n\n“The Government’s landmark 2015 reforms modernised strata living, but we know there is more to do. In particular, we know more needs to be done to ensure that apartment buildings are well maintained and remain free of building defects over their lifetime so that owners aren’t left out of pocket by tens of thousands of dollars.”\n\nTo accompany the survey, there’s an 84-page discussion paper that provides the background into the opportunities that ensure that strata laws remain relevant to the community.\n\n[IMAGE_0]\n\nThe feedback portal gives you the option of completing a quick poll focused on the question: should strata schemes be allowed to ban pets and there’s a more in-depth survey. If you’re completing the survey, it’s best to register so that your responses are saved as you progress through the five sections.\n\nIn the first section, the questions are focused on strata renewal and whether the balance is appropriate when at least 75% of owners would like to sell or redevelop. The second section deals with mixed-use and layered schemes, where a strata scheme only occupies part of a building, and the third section has various questions around how unit entitlements are valued. The fourth section deals with the objectives of the Strata Schemes Development Act 2015 and the final section gives you the option of including your details, which can remain anonymous if you’d prefer.\n\nIf a section isn’t relevant to you, you can skip those sections so that you’re only providing feedback that’s appropriate. And many questions within each section, don’t require a mandatory response.\n\nThe findings of the review will be shared at the end of 2021.\n\nIf you have any questions about the future of strata, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}