{
  "url": "https://netstrata.com.au/peace-of-mind-before-you-sign-buying-off-the-plan/",
  "timestamp": "2025-11-03T17:50:35.457289",
  "success": true,
  "content": {
    "title": "Peace of mind before you sign – buying off the plan",
    "date": "2011-10-24T22:30:31+00:00",
    "category": null,
    "author": "S J",
    "main_content": "##### Follow these tips to safeguard against problems with new or off-the-plan purchases.\n\nOut with the old and in with the new. It’s the spring-time clarion call of the NSW government – to encourage apartment buyers, via specially tailored new-year concessions, to choose new or off-the-plan property in order to stimulate the construction industry and get the economy moving.\n\n“The fact that housing construction is at record lows is not only a problem for the economy, it also means higher home prices for individuals and families across the state,” says the Treasurer, Mike Baird. “We want to make sure our incentives actually encourage activity, not push up home prices.”\n\nAs a result, Premier Barry O’Farrell’s budget ruled that from January 1 eligibility for stamp duty concessions will be limited to those buying newly constructed and off-the-plan apartments.\n\n“We believe this is necessary to make buying a new home or apartment relatively more attractive than buying an existing dwelling,” Baird says.\n\nBut sometimes buying new or off the plan can be riskier than buying an older, established apartment, so here are Domain’s top-10 spring tips on how to ensure your new buy is blooming wonderful.\n\n#### 1. Check up on the developer and builder\n\nMake sure the developer has a good record in building well-designed apartments, as well as in rectifying any problems afterwards.”Purchasers, particularly of off-the-plan sales, need to undertake due diligence on the vendor,” says strata lawyer Stephen Goddard, the chairman of apartment owners group the Owners Corporation Network. “They can look at other projects done in the past, how they’ve fared over time and what their track record is in fixing any defects.”\n\n#### 2. Make sure the price is right\n\nIt’s too easy to be dazzled by a shiny new apartment, a display unit or glossy brochure and forget the simple common sense of checking it’s reasonably priced.”You’ve got to pare it back to the price per square metre,” says the principal of buyer’s agents Sydney Property Finders, Dennis Kalofonos. “You compare that to the price per square metre of similar-standard apartments in the same area which have already been built or established.”In addition, these days you can’t expect an immediate profit if you sell. “Off the plan, generally developers build a premium into their product because it’s two to three years down the track that it’s being finished and bought,” Kalofonos says. “And usually buyers aren’t aware they’re paying 10 to 15 per cent extra just because it’s new.”\n\n#### 3. The devil’s in the details\n\nAs well as the square metreage, check all the other proposed measurements, such as ceiling heights, storage spaces and the size of car spaces, as well as the quality of the fittings to be put in.Also, take a photo of everything in the display apartment in case problems arise later. Developers can stint on size and quality – and you don’t want to move in and discover the ceilings are oppressively low, the car space is too narrow to open doors when your neighbour’s car is also parked and nothing is quite what has been promised.\n\n#### 4. Calculate your levies\n\nMake sure the quarterly levies quoted are likely to be the true cost of maintaining the building and its facilities, particularly if the complex has expenses such as lifts, a heated pool, sauna and concierge service.It’s not unknown for developers to underestimate levies in order to make a purchase more attractive, or for levies to rise sharply after the first year or two, when warranties run out.”You need to make sure you know what you are paying for, what you’re getting for that money and whether that’s going to be enough money for what you need to cover,” says Darren Klein of property valuers Value 8. “Builders don’t, as a rule, underestimate levies but it certainly occurs.”\n\n#### 5. View the view – and the potential for losing it\n\nIf a building has a fabulous view – factored into the price of the apartment – look carefully at any land in front that could possibly be used for another building that could block you out.”In Sydney at the moment, there are at least four developments where people’s views are under threat by other buildings being erected later by the same developer,” says Flatchat columnist Jimmy Thomson. “They’ve applied for variations on original development applications that now mean they’re building higher or in a place previously earmarked for a park.”So while you can be sold a view, you can never actually own it and that same view can be sold again and again. The only other industry where the same product can be sold again and again is the oldest profession in the world.”\n\n#### 6. Ask to see any contracts in place\n\nApartment buyers need to be aware of any long-term developer-imposed contracts, says Michael Teys of TEYS Lawyers.”These will hardly ever be in the interests of the owners and the developer will have benefited either by cash or in some other way from putting them in place,” he says.”There’s no justification for locking owners into 10-year or 20-year contracts with, say, a caretaker or gardener. Owners should decide for themselves who they want their contracts to be with – and for how long.”\n\n#### 7. Browse the bylaws\n\nA building’s bylaws either stop residents doing things or oblige them to do other things, says the president of Strata Community Australia, NSW, David Ferguson. It’s imperative purchasers read them before they buy. “They might ban pets, or apportion costs to a particular apartment, for instance, to pay for the exclusive use of a common cupboard,” Ferguson says. “Your lawyer should run you through them first but you should be aware of them and make sure they suit you before you make the decision to buy.”\n\n#### 8. Run through the security\n\nGood security is usually a high priority for apartment buyers. “Make sure there are good access control systems either in place or planned for the building,” says the director of Francis Management Building Services, Eric Francis.\n\n“You need a secure front entrance to a building – with electronic swipe keys audited regularly – and access only to the floor on which you live, and common property areas like gyms and pools.”\n\n#### 9. Listen to the noise\n\nApartments can prove havens from the din of lawn-mowers and barking dogs around suburban houses but if they have poor sound insulation and noisy neighbours, they can be hell on Earth.\n\n“Double check that the apartments are going to comply with the acoustic requirements of the Building Code of Australia,” says the principal consultant of Pollution Control Consultancy and Design, Alex Jochelson. “And that’s an absolute minimum – most engineers are of the opinion those standards aren’t stringent enough.”\n\n#### 10. Ask whether it’s future-proofed\n\nThat means not only that it’s cabled for pay TV and broadband but that it’s been thoughtfully designed to be environmentally smart in the years to come. “The biggest cost in the future is going to be the rise in utility costs,” says Christine Byrne of Green Strata.\n\n“So it’s very important to make sure new apartments have good insulation, great glazing, cross-ventilation, eco-friendly alternatives to halogen lighting and maybe solar boosting to take away the need for so much energy.”\n\nWhere are the savings?\n\n- Until December 31, first-home buyers will continue to pay no stamp duty on any property, old or new, up to $500,000 and receive a discount for properties valued up to $600,000.\n- From January 1, stamp duty will be waived only for first-home buyers purchasing newly built and off-the-plan property for less than $500,000, with partial exemptions on new properties priced from $500,000-$600,000.\n- The $7000 first-home buyer grant will be available to all eligible newcomers.\n- From now until July 1 next year, empty-nesters aged 55 and over won’t have to pay stamp duty on new homes. This replaces the previous exemption for only those aged over 65.\n\nThank you to TEYS lawyers for this article",
    "images": []
  }
}