{
  "url": "https://netstrata.com.au/strata-financial-reporting/",
  "timestamp": "2025-11-03T17:57:21.511207",
  "success": true,
  "content": {
    "title": "Strata Financial Reporting",
    "date": "2018-02-12T05:09:01+00:00",
    "category": null,
    "author": "S J",
    "main_content": "It’s imperative that the financial records of a strata scheme are accurate and provide clear, concise information for owners and their strata management team. The financial reports are one of the key decision making tools for an Owners Corporation to use when considering future budgeting, the setting of next year’s levies at the Annual General Meeting, the strategic direction of the building and any capital works programmes being considered.\n\nThe important financial reports for a strata scheme include the balance sheet, the income and expenditure statement, the detailed expenditure report and the levy position statement for each owner within the strata plan.\n\nIt’s not just common sense to ensure that the accounts are kept up-to-date; the relevant legislation defines what an owners corporation can and cannot do. The Strata Schemes Management Act 2015 and the Property, Stock and Business Agents Act 2002 set specific requirements relating to the keeping of financial records as well as the holding of trust fund monies.\n\nSection 93 of the Strata Schemes Management Act 2015 states the key requirements for financial reports. This includes:\n\n- a statement of income and expenditure for the administrative and sinking funds\n- the balance carried forward from the previous period\n- the particulars and amount of each item from the fund during the period\n- the cash in the fund at the end of the current period\n\nWhile the legislation requires that records be accurately maintained, at Netstrata, we go that extra mile to make what can be an overwhelming task simple for schemes that we manage. Our team ensures that interim financial statements are prepared and provided to our treasurers at regular intervals.\n\nIn addition, we’ve developed a new functionality that allows Strata Committee members to view the latest financial reports online at any time through a secure portal.\n\nWe have invested heavily in our own internal IT systems and utilise software specifically designed for strata management companies to enable the easy generation of over 30 different financial reports. This allows the effective financial management of the properties entrusted to our care, and enables our team to respond promptly to an owner’s corporations request for a particular report. Our software facilitates the “touch-of-a-finger” generation of standard reports whilst making provision for customised reporting as needed.\n\nIf you have any further questions regarding the maintenance of the financial records of your strata scheme, please contact your strata manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}