{
  "url": "https://netstrata.com.au/changing-my-floor-in-my-apartment/",
  "timestamp": "2025-11-03T17:32:27.546899",
  "success": true,
  "content": {
    "title": "Changing my floor in my apartment",
    "date": "2013-08-07T23:03:45+00:00",
    "category": null,
    "author": "S J",
    "main_content": "### Hard Surface Flooring\n\nWhen redesigning the interior of a strata-titled apartment, it’s important to keep in mind that your preferred flooring may not be allowed under the by-laws of your property. In general, all areas within the apartment excluding the kitchen, laundry and bathroom must have sufficient floor covering or treatment that adequately prevents noise from drifting from one apartment to another.\n\nIn the same way that music at a significant volume has the potential to affect neighbours enjoying their property, so too does footsteps, furniture being moved and items being dropped – affect owners living in the property directly below the offending unit. The floor covering or treatment serves to minimise such disturbances.\n\nNoise transmission between two vertically adjacent apartments is affected by three factors:\n\nThe quality of the underlay used in the floor above\nThe thickness of the concrete slab\nThe thickness of the drop ceiling in the apartment below (if installed)\n\nAnd while preventing noise from carrying through the building is a common courtesy, there is legislation on this very issue. Schedule 2 of the Strata Schemes Management Regulation (2010) has the relevant clause.\n\n### 15 Floor coverings\n\n(1) An owner of a lot must ensure that all floor space within the lot is covered or otherwise treated to an extent sufficient to prevent the transmission from the floor space of noise likely to disturb the peaceful enjoyment of the owner or occupier of another lot.\n\n(2) This by-law does not apply to floor space comprising a kitchen, laundry, lavatory or bathroom.\n\nSome strata schemes may have ratified a different by-law on this issue, so it’s important to always clarify with the Owners Corporation of your scheme the requirements of the property.\n\nHowever if as an owner, you’re determined to install timber flooring, for example, in your strata property, in some instances it may still be possible to both meet the conditions of the by-law and enjoy your desired hard surface floor. But how you can prove to the Owners Corporation in advance of installation that your preferred type of flooring will not affect your neighbours?\n\nThe Association of Australian Acoustical Consultants (AAAC), a not-for-profit peak body representing professionals involved in delivering acoustic solutions, has published guidelines that provide information on appropriate standards for buildings of different quality.\n\nThe Building Code of Australia (BCA) also sets a standard for impact noise transmission that is not greater than (Ln,w + CI = 62dB). This is a measure of the noise produced by the hard floor surface.\n\nThe BCA standard is recognised as a minimum national standard however the by-laws of your property may require a different condition. In this case, it’s important to know what the minimum requirements of your building are and give this information to the supplier.\n\nDepending upon the construction of the building, the use of floating timber floors with an acoustic underlay may provide the necessary insulation to meet all requirements.\n\nAt Netstrata, we recommend that you obtain written confirmation from the supplier – confirming that the desired hard floor surface will meet the AAAC guidelines and the BCA standard. Once you have the documentation from the supplier, submit an application to the Owners Corporation for consideration.\n\nIf you have any further questions about installing hard surface flooring into your apartment, talk to your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}