{
  "url": "https://netstrata.com.au/public-liability-insurance/",
  "timestamp": "2025-11-03T17:51:45.231875",
  "success": true,
  "content": {
    "title": "Public Liability Insurance",
    "date": "2014-10-28T23:11:29+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Public liability insurance provides cover for claims of compensation as a result of personal injury or property damage. If an incident occurs on common property, then the Owners Corporation may be potentially liable for damages.\n\nWhile insurance offers peace of mind in case a claim is lodged, under Section 164 of the Strata Schemes Management Act 2015, Owners Corporations are legally required to ensure their scheme is adequately covered against death or injury and to property damage for which they could be held responsible.\n\nThe section states that the Owners Corporation must take out insurance:\n\n(a) in respect of any occurrence against which it is required by law to insure, including any insurance required by the Workers Compensation Act 1987 and the Workplace Injury Management and Workers Compensation Act 1998 to be taken out,\n\n(b) in respect of damage to property, death or bodily injury for which the owners corporation could become liable in damages,\n\n(c) against the possibility of the owners becoming jointly liable because of a claim arising in respect of any other occurrence against which the owners corporation, in accordance with a special resolution, decides to insure,\n\n(d) against any damages for which the owners corporation could become liable because, without fee or reward or any expectation of fee or reward, a person acting on behalf of the owners corporation does work in a building or on the common property in the strata scheme,\n\n(e) of any other class prescribed by the regulations for the purposes of this subsection.\n\nThe clause also states that there must be cover of not less than $10,000,000 .\n\nWhile the legislation requires a cover of $10 million, the minimum limit of liability that should be considered could be even greater. The legal costs associated with defending a public liability court action can mount up very quickly and the courts are known to be generous when awarding compensation.\n\nIndividual lot owners may also consider taking their own public liability policy to protect themselves for incidents that may occur on their own lot that wouldn’t necessarily be covered under the Owners Corporation policy.\n\nEach insurer offers a slightly different policy, so it’s important to receive quotes from several different companies to determine which is most suitable for your needs.\n\nA typical policy to protect the Owners Corporation against a claim for compensation or expenses might include:\n\nPersonal Injury\n\n- Bodily injury, death, sickness, shock, fright, mental anguish, psychiatric or psychological disorder, mental injury.\n- False arrest, false or wrongful detention or imprisonment, malicious prosecution or humiliation.\n- Publication of libellous or slanderous comments\n- Wrongful eviction or entry or other invasion of privacy.\n\nProperty Damage\n\n- Physical damage to or loss or destruction of tangible property including any subsequent loss of use from the damage or destruction.\n- Loss of use of tangible property, which has not been physically damaged or destroyed.\n\nAt Netstrata, we encourage the Owners Corporations of the schemes that we manage to take out public liability not just because it’s the law but because it offers peace of mind in the unlikely event that an incident leads to a lawsuit.\n\nIf you have any further questions regarding public liability insurance, please contact your strata agent at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}