{
  "url": "https://netstrata.com.au/national-report-on-strata-living/",
  "timestamp": "2025-11-03T17:44:31.602050",
  "success": true,
  "content": {
    "title": "National Report on Strata Living",
    "date": "2018-07-23T06:35:26+00:00",
    "category": null,
    "author": "S J",
    "main_content": "In an Australian first, the Strata Community Association in conjunction with the City Futures Research Centre at UNSW have produced a comprehensive report into strata living. Entitled the Australian National Strata Data 2018, the document not only outlines key statistics for the strata industry but also, “provides additional background data that demonstrates the continued growth of the strata sector in Australia.”\n\nAcross the country there are 316,227 schemes that comprise of over 2.5 million lots.\n\nThe report also found that about 9% of Australians live in an apartment totalling 2,200,793 residents. 48% of apartments around the country are rented and 26% of apartments are owner occupied. Interestingly half of all apartment residents are aged between 20 and 39. Individuals living alone in an apartment make up 35% of strata households, followed by couples without children at 24%.\n\nIn New South Wales around 15% of the state’s population live in an apartment – the highest of any state or territory. Tasmania has the lowest apartment density at 3%. The rental rate is identical to the national average at 48%, and owner occupied apartments are slightly higher at 29%. Individuals living alone in an apartment in NSW make up 31% of strata households and couples without children are at 25%.\n\nThere are 1,851 full time strata managers in NSW and the industry directly employs 1,675 other people. It’s estimated that the total value of callout jobs for plumbers, handymen and electricians in 2017 was $2,496,590,418 and professional services such as lawyers and engineers totalled $410,984,085.\n\nIn identifying trends for the future, the report noted that 2015 was the first year in Australia’s history that more attached dwellings began construction than houses.\n\nAs the report stated, “Much of this growth is accounted for by a rapid rise in the numbers of approvals for apartments buildings with 4 or more storeys over the past 10 years and is concentrated in the eastern states of New South Wales, Victoria and Queensland.”\n\nSydney, Melbourne and Brisbane have the highest numbers of development approvals, which mirrors the population growth in these cities.\n\nAcross the country, 42% of all schemes were registered after 2000. In Victoria, 47% of schemes were registered this millennium and in Queensland the figure is 43%.\n\nThe insights outlined in the report could potentially be used by town planners and governments to ensure legislation matches the growth of the industry.\n\nThe full report can be downloaded from the City Futures Research Centre website.\n\nFor more information on this report or the evolution of strata living, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}