{
  "url": "https://netstrata.com.au/owners-beware-of-noisy-tenants/",
  "timestamp": "2025-11-03T17:49:56.681216",
  "success": true,
  "content": {
    "title": "Owners beware of noisy tenants",
    "date": "2011-06-08T11:00:11+00:00",
    "category": null,
    "author": "S J",
    "main_content": "A recent decision of the Local Court in Jean Whittlam v Sara Hannah & John Hannah [2011] Downing Centre Local Court 63913/11 has received significant press attention suggesting the case represents a panacea for lot owners affected by offensive noise from short term tenants.\n\nFACTS\n\nMrs Whittlam lived in a unit in Double Bay.   Mr and Mrs Hannah owned the unit directly above Mrs Whittlam’s unit. They did not live in the unit but let it out as furnished rental property. There were numerous different tenants changing regularly. There was a consistent problem with the noise created by those tenants.   Mrs Whittlam took proceedings against the owners of the unit for orders pursuant to section 268(4) of the Protection of the Environment Operations Act 1997. That Act permits the Local Court to make an order in favour of an occupier of premises affected by offensive noise against the person alleged to be making or contributing to that noise or the occupier of the premises from which the noise is emanating.   The Court may make an order directing the offender to abate the offensive noise within a time specified in the order or an order directing the offender to prevent a recurrence of the offensive noise.\n\nThe Magistrate found in the circumstances of this case that the landlord was a person contributing to the noise of the occupier.   She did so because they were able to control who they leased to and for how long and because they could terminate the lease if breaches occurred.\n\nHaving found that the application was properly brought against the owners and having found that offensive noise did exist, Her Honour considered the remedies which were sought by Mrs Whittlam.   Those remedies orders that the owners must:\n\n- Install new floor coverings with an appropriate acoustic rating.\n- Install hydraulic door closers on all doors in or to the lot.\n- Install rubber feet on all of the legs of the furniture within the lot.\n- Not cause or permit any musical instruments or electrically amplified sound equipment to be used in such a manner that emits noise that can be heard within a habitable room in Mrs Whittlam’s lot whether or not a door or window was open and during specified hours.\n\nThe Magistrate made the second and fourth orders.\n\nIt is worth noting that the claim was made by Mrs Whittlam that the short term tenancies were illegal, presumably as they breached an instrument issued pursuant to the Environmental Planning and Assessment Act 1979.   Where that is the case powerful prohibitive orders preventing, for example, short term leasing in breach of the Act, can be obtained from the Land & Environment Court pursuant to section 123 of that Act. Appropriate by-laws may also render a breach of the Act a breach of the by-laws thereby permitting the matter to be dealt by the Consumer Trader and Tenancy Tribunal.\n\nWhittlam’s case now extends the range of options that may be considered by aggrieved owners corporations or lot owners.\n\nMany thanks to J.S Mueller and Co Solicitors for providing this article.",
    "images": []
  }
}