{
  "url": "https://netstrata.com.au/selling-strata-property/",
  "timestamp": "2025-11-03T17:54:31.156342",
  "success": true,
  "content": {
    "title": "Selling a strata or community property",
    "date": "2010-11-26T10:12:49+00:00",
    "category": null,
    "author": "S J",
    "main_content": "[IMAGE_0]\n\nSydney the Place to Be\n\n## Selling?  10 Tips you’ve never heard of to improve your Sale!\n\nAt one point or another, most owners of a Strata or Community Title Property will consider selling their home or investment. Your sales agent will generally run you through the DO’s and DON’Ts of preparing the property for the market, however there are many other small, but significant steps you can take through the effective use of your scheme’s records that can be extremely beneficial in achieving a quick and efficient sale, as well as achieving the best possible price for your property, particularly in a tough and competitive market.\n\n### 1.    Contract Information\n\nYou can obtain much of the pertinent information that your solicitor or conveyancer will need to prepare your sales contract by utilizing the WEBlink services at our website www.netstrata.com.au. Here you will be able to obtain;\n\n- A copy of the Insurance Certificate for your scheme\n- A copy of the Insurance Valuation for your scheme\n- A copy of the Strata/Community Plan for your scheme\n- A copy of the current By-laws for your scheme\n\nThese documents will provide useful and important information your solicitor can include in your contract that will assist the inquiries of prospective purchasers.  They should also save you a few $$$ in the costs of preparing your sales contract!\n\n### 2.    Size Matters!\n\nYour Strata or Community Plan will provide the accurate sizes of your lot. And for strata owners this will include the internal areas, balconies, courtyards, and garage/parking areas for inclusion in sales brochures to prospective purchases.\n\n### 3.    Features\n\nBe sure to share all the useful features of your scheme to your sales agent, particularly items that will boost the saleability of your lot. Useful ‘strata’ and ‘community’ questions to answer include;\n\n- Is the scheme Pay TV/Digital TV ready?\n- Is high speed broadband internet available?\n- Is there a Gym, Pool, Spa, Sauna at the scheme?\n- What are the common security features?\n- What are the local conveniences, e.g. bus/rail stops, shops, schools, child minding facilities, etc\n\n### 4.    The By-laws\n\nThe By-laws that are in place for a scheme can have a significant impact on the lifestyle choices for residents and a purchaser’s willingness to buy.  Important questions to inform your sales agent include;\n\n- Are pets allowed at the scheme? And if so what type?\n- Can air-conditioning units be installed?\n- Are there exclusive use By-laws in place for your lot?\n- What is the scheme’s attitude to alterations, additions and improvements?\n\n### 5.    Maintenance Costs\n\nAll prudent purchases will want to know not only the current the running costs of the property, such as your current levies, council rates and water rates, however what the expected future running costs of the property will be. If your scheme has undertaken improvements to the common property such as a major renovation or implementing an energy audit, installation of solar panels or rainwater tanks, be sure to inform your agent of the proposed benefits to the scheme.\n\n### 6.    The Schemes Records\n\nThe information you provide during the marketing process will attract purchasers to your property, however those that are serious will want to undertake a complete inspection of the records of the scheme.  These reports are usually prepared by professional searchers who know where to look for the detailed information relating to your lot, so unfortunately there’s no place to hide.\n\nThese searches can often make or break a sale, particularly if your scheme has had a history of defects or disputes. If your scheme has a few skeletons in the closet, don’t worry. By forewarning your sales agent or solicitor of any potential problems you can provide them with the significant information that is necessary to address any concerns.\n\n### 7.    RP Data Reports\n\nSetting the correct price is imperative during the marketing process.  Too high and you’ll scare off many prospects, too low could cost you thousands. The RP Data reports provided via WEBlink will provide the recent sales results for strata and community title properties in your area and often your scheme.  These are the best indicators of the current state of the market and provide you with further independent advice of the appropriate price to list your property for sale or auction.\n\n### 8.    Sales / Auction Signs\n\nNo doubt your sales agent will want to erect a sign on the common property advertising your lot for sale. Here it’s important to ascertain your scheme’s attitude towards the erection of signs on common property because permission will be required. If your agent unwittingly erects a sign without permission, you may be up for the costs of not only installing the sign, but having it removed and repairing the damage to common property.\n\n### 9.    Knowledge is Power!\n\nNSW Fair Trading produces a range of useful and informative guides to assist prospective purchases. These include; ‘Buying into a Strata or Community Scheme’ and ‘Strata and Community Title Living’. These guides are offered free from Fair Trading, so have your sales agent obtain a few copies for distribution to prospective purchasers. See our useful links page.\n\n### 10.  The Netstrata Difference\n\nWhilst we are experts in Strata Management in Sydney, we’ll never pretend to be sales agents, however if you ever need any assistance with obtaining the important information to assist you during your sales and marketing process or if you have any questions, please do not hesitate to contact our office.",
    "images": []
  }
}