{
  "url": "https://netstrata.com.au/common-law-and-common-sense-about-trees/",
  "timestamp": "2025-11-03T17:33:15.700663",
  "success": true,
  "content": {
    "title": "Common law and common sense about trees",
    "date": "2011-08-02T12:37:22+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Overhanging or invasive trees are a common cause of dispute in strata communities and otherwise. There are steps and measure you can take to avoid these disputes escalating out of control.\n\nRead this week’s training note and Many thanks to TEYS lawyers for this article here are some tips on how not to go too far!\nEach state and territory by now has its own legislation about tree disputes and if a dispute goes far enough, then these laws should be referenced. This note looks at the common law and some common sense on the topic.\n\n[IMAGE_0]\n\nThere are trees to avoid planting and places to avoid planting them. A rubber plant\n\nwill find pipes and drains on the other side of the city if that’s how far it has to go\n\nfor a drink. A by-law about what can be planted and where, is a good use of the\n\nby-law making powers of an owners corporation.\nYou don’t need council approval to plant a tree but you might need approval to\n\nbring one down. Check for tree preservation orders in your local council before\n\nhaving a working bee with chainsaws at the ready. (Also check your insurance\n\nbefore letting the secretary rip with anything sharper than a pen).\nLocal councils are responsible for trees on pavements, grass verges and nature\n\nstrips, so don’t waste owners corporation money on these matters, exercise your\n\nright to complain to the authorities to get this work done.\nBranches and roots from a neighbour’s tree can be pruned and the material\n\nreturned to the tree owner’s property, but again be careful of preservation orders\n\nbefore taking to the intruder. Also, it might be an idea to talk to the neighbour first\n\nbefore cutting down half the magnolia and hurling the cuttings into their pool.\nThe common law of nuisance applies to physical land or buildings but does not\n\ninclude the right to sunlight or an unobstructed view. In some places, including\n\nSydney, there is legislation about hedges blocking views so look for this if the Opera House is fading to green.\n\nThank you TEYS Lawyers.",
    "images": []
  }
}