{
  "url": "https://netstrata.com.au/summary-of-strata-law-reforms-2017/",
  "timestamp": "2025-11-03T17:59:54.769070",
  "success": true,
  "content": {
    "title": "New Strata Laws 2017",
    "date": "2017-08-03T06:56:45+00:00",
    "category": null,
    "author": "S J",
    "main_content": "### Owners Corporations and Strata committee\n\n• Section 13 sets out functions of an owners corporation, strata committee or officer of an owners corporation\nthat may be delegated to a member of the strata committee or strata managing agent (if any). These\nfunctions include the levying of contributions, managing the owners corporation’s money, taking out\ninsurance and maintaining records. The 2016 Management Regulation lists additional functions that may only\nbe delegated to a strata committee or a strata managing agent, including giving certificates under section\n184 and arranging for the inspections of records and other documents under section 183 (clause 4). These\nfunctions have not changed and reflect those in the Strata Scheme Management Regulation 2010 (NSW).\n• A strata committee is appointed by an owners corporation and the members of the strata committee must\nbe elected at each annual general meeting of the owners corporation (sections 29 and 30(4)). Clauses 9 and\n10 set out the procedures for electing strata committee members.\n• The building manager for the strata scheme, leasing agents and persons connected with the original owner\nof the strata scheme or the building manager for the scheme (unless they disclose the connection) are not\neligible to be appointed or elected on a strata committee (unless they also own lots in the strata scheme)\n(section 32).\n• A member of the strata committee must disclose any direct or indirect pecuniary interest the member has\nin a matter to be considered by the strata committee where that interest appears to raise a conflict with the\nproper exercise of the member’s duties in relation to the consideration of the matter (clause 18(1) of Schedule\n2 to the 2015 Management Act). The member must not be present during the deliberation of the matter or\ntake part in a decision with respect to the matter, unless the strata committee otherwise determines (clause\n18(4) of Schedule 2 to the 2015 Management Act).\n• Any matters or things done or omitted to be done by an officer of an owners corporation or by a member of\nthe strata committee in good faith for the purpose of executing functions under the legislation does not incur\npersonal liability for these persons – the liability attaches to the owners corporation (section 260).\n\n### Meetings\n\n• There is greater flexibility for the strata committee to determine when the annual general meeting is to be\nheld, with the only requirements being that an annual general meeting must be held no later than 2 months\nafter the end of the initial period (section 14(1)) and then once in each financial year (section 18).\n• There are a number of matters prescribed in section 15 for inclusion in the agenda for the first annual general\nmeeting. There are also additional agenda items for the first annual general meeting prescribed by clause 5,\nwhich include the recognition of the nomination of a tenant representative for the strata committee (if any) and\nthe appointment of a building inspector for the purposes of Part 11 of the 2015 Management Act (regarding\nbuilding defects). There are also a number of documents which the original owner or lessor must provide\nto the owners corporation before the first annual general meeting, including records and approvals relating\nto the construction of the building, the certificate of title for the common property, the initial maintenance\nschedule and any building reports (section 16). The 2016 Management Regulation prescribes a list of\nadditional documents and records that the original owner or lessor must provide before the first AGM. These\ninclude any building valuation obtained for insurance purposes and any maintenance and service manuals\n(clause 6).\n• Other general meetings may be convened at any time by the secretary or strata committee of an owners\ncorporation or following a qualified request made by one or more lot owners with a total unit entitlement of at\nleast one quarter of the aggregate unit entitlements in the strata scheme (section 19).\n\n• The notice of annual general meeting must include a number of prescribed matters (clauses 8 and 9 of\nSchedule 1 to the 2015 Management Act), including statements of key financial information and a form of\nmotion to decide how to deal with overdue contributions payable to the owners corporation (clause 9(h) of\nSchedule 1 to the 2015 Management Act). There is no requirement to provide the full financial statements\nwith the notice of annual general meeting. However, the owners corporation must provide the financial\nstatements on request to an owner, mortgagee or covenant chargee (clause 10(1) of Schedule 1 to the 2015\nManagement Act). In addition, the owners corporation may determine that the financial statements are to be\nincluded in or to accompany the notice of annual general meeting (clause 10(2) of Schedule 1 to the 2015\nManagement Act). The agenda for each annual general meeting must include an item to consider building\ndefects and rectification until the end of the warranty periods for the applicable statutory warranties under the\nHome Building Act 1989 (NSW) (clause 6(d) of Schedule 1 to the 2015 Management Act).\n• The concept of a quorum has been significantly watered down under the 2015 Management Act. If no\nquorum is present within half an hour after the relevant motion or business arises for consideration at the\nmeeting, the chairperson must either adjourn the meeting for at least 7 days, or declare the persons who are\npresent (by person or by proxy) who are entitled to vote on the motion to constitute a quorum for considering\nthat motion and any subsequent motion or business at the meeting (clause 17(4) of Schedule 1 to the 2015\nManagement Act). This change enables quorum to be decided after waiting only half an hour if no quorum\nwas initially present.\n• Voting must be in person (whether by proxy or not) unless the owners corporation, by resolution passed in\ngeneral meeting, determines that a vote may be cast by another means (clause 28(1) of Schedule 1 to the\n2015 Management Act). This provision permits the owners corporation to determine the means for voting\nother than by being present in person, including voting by e-mail or other electronic means except where\nthe voting relates to an election (clause 14(1)(b)). It seems that, where elections are concerned, a vote may\nbe cast either in person or in “real time” from a remote location by agreed electronic means but voting in an\nelection cannot seem to occur prior to the meeting. REINSW is yet to receive clarification from NSW Fair\nTrading on that issue. Clause 14 of the 2016 Management Regulation provides for modern electronic means\nof voting including voting via teleconference, video-conferencing, email or other electronic means. Having\nregard to the exception in clause 14(1)(b) to voting in an election, this electronic means of voting inadvertently\ncreates the situation where a person entitled to vote may, without properly understanding the legislation, vote\nelectronically in relation to an election only to have their vote discarded because of the prohibition in clause\n14 on pre-meeting electronic voting for elections. A consequence of this may be that a person entitled to\nvote may be the only person present at a general meeting, elects themselves to the strata committee and\nis successful only because the electronic votes received before the meeting have no effect and must be\ndiscarded.\n• Clause 15 sets out procedures for pre-meeting electronic voting and clause 16 deals with informal electronic\nvotes. Voting may also be carried out by secret ballot if at least one quarter of persons entitled to vote on the\nmatter determine so (clause 29(1) of Schedule 1 to the 2015 Management Act).\n• There is a limit on the number of proxy votes that may be held by a person – for a scheme with 20 lots or\nless, the limit is one; and for a scheme with more than 20 lots, the threshold is not more than 5% of the total\nnumber of lots (clause 26(7) of Schedule 1 to the 2015 Management Act). The new laws are silent on what\nhappens if the total number of proxies held by a person exceeds the thresholds and, in particular, which\nproxies should be used if the thresholds are exceeded and what to do with the proxies that are not used.\nThere is no guidance on whether the first or last proxy received should be used or whether the proxy from\nthe owner with the greatest unit entitlement should be used. This uncertainty opens up the potential for\ndisputes or abuse, particularly if proxies are chosen because they support the way in which the proxyholder\nwants to vote (contrary to the intention of the 2015 Management Act with respect to the prevention of proxy\nfarming). It may also be disadvantageous to owners who are vulnerable, the minority or investors who give\nthe chairperson their proxies out of trust (for example, where 60% of owners are elderly and give their proxies\n\nThe new laws do not include provision for a notification process whereby if the number of proxies received\nbefore a meeting exceeds the relevant threshold then the proxy should have to notify the people appointing\nthem that the threshold has been reached so that they can give their proxy to someone else. That would\navoid proxies going to waste or being discarded if they cannot be used because of the threshold limits. One\nway forward might be for strata managing agents to encourage owners to:\n(a) ask the person they are appointing as a proxy to notify them if they receive other proxies and do not\nintend to use that owner’s proxy;\n(b) ask the person they intend to appoint whether they have already received the maximum number of\nproxies permitted; and\n(c) electronically vote to minimise the number of proxies (unless the vote relates to an election).\n• If a proxy is required to attend a meeting, Form 1 of Schedule 1 to the 2016 Management Regulation must\nbe used to appoint that proxy. The form is similar to the proxy form prescribed by Form 2 of Schedule 8 to\nthe Strata Schemes Management Regulation 2010 (NSW), however, the new form includes more explanatory\n“Notes” and an additional paragraph which makes it clear that the proxy will not be permitted to vote if they\nalready hold more than the permitted number of proxies. To assist strata managing agents, REINSW has\nmade the new prescribed proxy form available on its website and on REI Forms Live.\n• The original owner cannot cast a proxy vote if the proxy was given to them by a lot owner pursuant to the\nterms of a contract for sale of the lot (clause 25(5) of Schedule 1 to the 2015 Management Act).\n• Tenants are entitled to receive notices of, and to attend, general meetings (section 14(3)(b) and clause 11\nof Schedule 1 to the 2015 Management Act), but not to speak at general meetings unless authorised by a\nresolution of the owners corporation (clause 21(2) of Schedule 1 to the 2015 Management Act). Tenants may\nbe excluded from a general meeting when financial matters are being discussed or determined (clause 21(3)\nof Schedule 1 to the 2015 Management Act).\n• In strata schemes where at least half of the number of lots are tenanted, a person entitled to convene an\nannual general meeting (being the strata managing agent or secretary on behalf of the owners corporation)\nmust convene a meeting of eligible tenants where they may nominate a tenant representative to the strata\ncommittee (sections 33(1) and 33(2) and clause 7). The tenant representative can attend and speak at\ncommittee meetings, but cannot vote (section 33(3)). The strata committee may determine that a tenant\nrepresentative is not entitled to be present in a meeting of the strata committee when financial matters are\nbeing discussed (section 33(4)). However, the strata committee must give the tenant representative (amongst\nother people) copies of the minutes of the meeting or of a resolution passed by the strata committee within\n7 days after the meeting or the passing of the resolution (clause 17 of Schedule 2 to the 2015 Management\nAct). The nomination of a tenant representative will occur during a meeting of eligible tenants, who have\nbeen notified at least 14 days before the annual general meeting, and the tenants meeting may be held\nat any time before the annual general meeting but not earlier than 7 days after notice of the meeting was\ngiven. The tenant representative is determined by majority vote of the tenants present at the meeting and the\nquorum for that meeting is one tenant. The tenant representative’s term commences at the end of the annual\ngeneral meeting at which the nomination is received (clause 7). Clause 8 sets out the circumstances, and\nthe procedures that must be followed, when a tenant representative ceases to be a tenant representative.\nThis includes when a tenant ceases to be an eligible tenant, if they resign from the position, if they die or if\nthey cease to be a tenant representative at the end of the next meeting at which a new strata committee is\nelected by the owners corporation.\n\n### Levies and Financial Management\n\n• Where lot owners do not pay contributions, the owners corporation may experience financial difficulty. The\nowners corporation may decide, by resolution at a general meeting, to enter into payment plans with lot\nowners who have outstanding contributions. Payment plans are limited to a 12-month period but a further\nplan may be agreed by the owners corporation by resolution (section 85(5)). The legislation is silent on who\npays for the additional administration costs associated with implementing a payment plan but the REINSW\nExclusive Management Agency Agreement (Owners Corporation) (FM00500), which has been updated\nto reflect the new strata legislation, permits the strata managing agent to charge for undertaking the\nnecessary steps to recover money owing in relation to strata levies.\n• The 2016 Management Regulation sets out the requirements of what must be included in a payment plan\nfor outstanding contributions. A payment plan must be in writing and must include (amongst other things)\ninformation such as the name and address for service of the lot owner, title details, the amount of any\noverdue contribution and any interest payable and how it is calculated, the manner in which the payments are\nto be made, the contact details of a strata committee member or strata managing agent who is responsible\nfor dealing with any matters arising from the payment plan and a statement that the existence of the payment\nplan does not limit the right of the owners corporation to take action to recover the amount of the unpaid\ncontributions (clause 18).\n• The owners corporation can apply to the Tribunal for an order for compensation from the original owner if the\nTribunal determines that the estimates and levies determined by the original owner were inadequate to meet\nthe actual or expected expenditure of the owners corporation (section 89).\n• Section 96(3) requires separate accounting records to be kept for the administrative fund, the capital\nworks fund and any other fund kept by the owners corporation. For the purposes of section 96, the 2016\nManagement Regulation prescribes additional accounting records that an owners corporation must keep,\nincluding consecutively numbered receipts, a statement of deposits and withdrawals for the owners\ncorporation accounts, a cash record and a levy register (clause 22).\n• The owners corporation must cause their records to be retained for 7 years, including (amongst others)\nminutes of meetings, financial statements and accounting records, proxies and copies of signed strata\nmanaging agent agreements or building manager agreements entered into by the owners corporation.\nHowever, this does not include voting papers under s180(1)(g) and records relating to electronic voting for\nmotions for resolutions by an owners corporation, which must be kept for 13 months if the voting papers or\nrecords relate to secret ballots (unless the papers relate to the appointment of a strata renewal committee or\nother decisions in connection with Part 10 of the 2015 Development Act, in which case they must be kept for\n7 years) (section 180 and clause 41).\n• The owners corporation must make certain items available for inspection to certain people. The list of\nitems available for inspection is quite broad and includes records or documents required to be kept under\nPart 10 of the 2015 Management Act or in the custody or under the control of the owners corporation\n(sections 182(3)(b) and (j)). These requirements would mean that secret ballots need to be made available for\ninspection despite their confidential nature. Since there is no guidance on how to practically approach this\nissue, it may be that secret ballots are made available for inspection with any secret or sensitive information\nredacted.\n• A strata information certificate issued under section 184 provides financial and management information\nof the strata scheme. It includes information about its administrative fund and capital works fund, whether\nany special levies have been raised and whether a strata renewal committee has been established. Form\n4 of Schedule 1 to the 2016 Management Regulation prescribes the requirements of the strata information\ncertificate, which replaces the form under section 109 of the Strata Schemes Management Act 1996 (NSW).\n• A new provision allows the amount outstanding under any judgment debt in respect of unpaid contributions\nto be attached to the rent for the property by way of garnishee order (clause 122C in the Civil Procedure Act\n2005 (NSW) pursuant to part 4.3 of Schedule 4 to the 2015 Management Act).\n\n### Strata managing agents\n\n• The owners corporation can only appoint a strata managing agent by a general resolution.\n• The new legislation imposes restrictions on the term of the appointment of strata managing agents.\n• If the agent is appointed by the developer before the first annual general meeting, then that appointment\nends at that meeting. If the agent is appointed at that meeting, then the appointment must be for no more\nthan 12 months. After those 12 months, any future term of appointment of that agent or another strata\nmanaging agent is limited to 3 years, following which a new contract may be negotiated and potentially\nentered into (that is, contracts do not automatically roll over after 3 years). The owners corporation may, by\nresolution at a general meeting, reappoint the strata managing agent at the expiry of their term. However,\npending a decision as to the reappointment of the strata managing agent, the strata committee is able to\nextend the term of a strata managing agent’s appointment by successive 3-month blocks after their term\nwould have otherwise expired, but not beyond the next annual general meeting. If the strata committee\nextends the term and then decides not to reappoint the strata managing agent or further extend their term,\nthey must give the strata managing agent at least 1 months’ notice of their decision before terminating their\nservices. (section 50).\n• The term of a strata managing agent who is appointed before 30 November 2016 (including any\nreappointment) will terminate on the later of 3 years after the day on which their term commenced and 6\nmonths after 30 November 2016 (clause 14(1) of Schedule 3 to the 2015 Management Act). For example, an\nagreement with a term of 5 years that is signed on 30 June 2015 will end on 30 June 2018, being the later\nof 3 years after the term of agreement commenced and 30 May 2017 (which is 6 months after 30 November\n2016). The provisions for extension by a strata committee in section 50(4) and the statutory option in section\n50(7) (refer below) seem to be applicable for any legacy/transitioned agreements.\n• A strata managing agent must give the owners corporation written notice of the end of the term of\nappointment at least 3 months before the end of the term of appointment and at least 1 month before the\nend of each extension (section 50(6)(b)).\n• If a strata managing agent is appointed for 3 years, their agency agreement is taken to include an option for\nthem to extend their appointment for a further 3 months if the owners corporation decides not to reappoint\nthem and does not extend the term. The strata managing agent must notify the owners corporation in writing\nif they want to exercise this option, however, they cannot do so if the owners corporation gives them written\nnotice that they will not be reappointed at least 3 months before the expiry of the term (sections 50(7) and\n50(8)).\n• The strata managing agent must make a record of the functions exercised by them and the manner in which\nthey were exercised and must give a copy of the records kept for the preceding 12 months to the owners\ncorporation at least once each year (section 55).\n• If a strata managing agent has been delegated a function by an owners corporation and a breach of the duty\nby the owners corporation would be an offence under the legislation, then the agent is guilty of an offence\nunder that provision instead of the owners corporation (section 57(1)). This provision is similar to section 30 of\nthe Strata Scheme Management Act 1996 (NSW).\n• There is a prohibition on the request or acceptance of gifts by strata managing agents, except for gifts less\nthan a value prescribed under the 2016 Management Regulation, currently set at $60 (sections 57(2) and\n57(3)(d) and clause 63).\n\n• Agents are required to disclose at the annual general meeting all commissions received by, and training\nservices provided to, the agent in connection with the exercise of the agent’s functions of the strata scheme\nduring the preceding 12 months and the commissions or training services and their estimated value which\nthe agent believes are likely to be provided or paid to the agent in the following 12 months (section 60(1)).\nAgents must give an explanation of any variations between the commissions or training fee estimates\ndisclosed and commissions or fee estimates actually received as soon as practicable after becoming aware\nof the variations (section 60(2)). The Tribunal may order an agent to pay to the owners corporation the whole\nor any part of the value of commissions or training services provided or paid to the agent and not disclosed\nas required under the legislation (section 60(3)).\n• Strata managing agents must disclose to the owners corporation, before their appointment, that they are\nconnected with the original owner and if they have any pecuniary interest in the strata scheme (section 71).\nSection 7 sets out the circumstances where a person is connected with another person, for instance, where\na strata managing agent is employed or engaged by the original owner or is their business partner, relative or\nemployer.\n\n### Maintenance and common property\n\n• The owners corporation may also defer carrying out repairs and maintenance in relation to any damage to\nproperty until the completion of any action against an owner or other person in respect of the damage, so\nlong as deferring the repairs does not affect the safety of any building, structure or common property in the\nstrata scheme (section 106(4)).\n• The by-laws of a strata scheme may adopt a common property memorandum (as prescribed by clause 27)\nwhich would specify whether an owner of a lot or the owners corporation is responsible for the maintenance,\nrepair or replacement of any part of the common property (section 107). If a common property memorandum\nis adopted, the by-laws may modify it only to exclude specified items that are not common property for the\npurposes of the strata scheme or that are the subject of a common property rights by-law or a by-law made\nunder section 108 (section 107(3)). The common property memorandum cannot be modified in any other\nway.\n• The original owner must cause an initial maintenance schedule to be prepared for the strata scheme (section\n115). The initial maintenance schedule must include items of common property prescribed by clause 29\nsuch as exterior walls, guttering, downpipes and roof, pools and surrounds, air conditioning systems, fire\nprotection equipment, security access systems and embedded networks and micro-grids.\n• An owners corporation may, subject to approval by special resolution, grant a licence to an owner or\noccupier of a lot or another person to use common property in a particular manner or for particular purposes.\nThe licence may be granted under an agreement with the local council for a strata parking area under section\n650A of the Local Government Act 1993 (NSW) (refer to the bullet point immediately below) (section 112).\n• The changes allow owners corporations to enter into agreements with the local council for the use of part\nof the common property as a strata parking area where council erects signs and exercises enforcement\nfunctions (section 650A in the Local Government Act 1993 (NSW) pursuant to part 4.16 of Schedule 4 to the\n2015 Management Act).\n• Section 125 states that the regulations may make provision for the storage and disposal of abandoned\ngoods left on the common property, for the passing of title to those goods on disposal by the owners\ncorporation and other related matters. In fact, clause 32 makes provision for the disposal of goods left on\ncommon property, the sale of those goods, the passing of title to any goods on disposal by the owners\ncorporation and other related matters.\n\n• Clause 34 deals with the situation where a motor vehicle is left on common property, blocking an exit or\nentrance or otherwise obstructs the use of common property. In that circumstance, if a removal notice has\nbeen placed on or near the vehicle and the requirements in the notice have not been complied with within\nthe period specified in the notice, an owners corporation can cause the vehicle to be moved to another\nlocation on the common property, to the nearest place it may be lawfully moved or moved so that it does not\nblock an exit, entrance or otherwise obstruct the use of the common property. For that purpose, the owners\ncorporation is taken to be the owner of the motor vehicle.\n\n### Renovations\n\n• Owners may carry out “cosmetic work” as defined in section 109(2) without the approval of the owners\ncorporation. Cosmetic work is defined to include installing or replacing picture hooks, painting, laying carpet\nand installing or replacing built-in wardrobes, blinds or curtains. However, the owners corporation can make\nby-laws which specify work comprising cosmetic work that is additional to the prescribed works (section\n109(4)).\n• Owners may carry out “minor renovations” with the approval of the owners corporation by ordinary resolution\nat a general meeting. Minor renovations are defined in section 110(3) to include renovating a kitchen, installing\nor replacing wood or other hard floors, installing or replacing wiring or cabling or power access points and\nwork involving reconfiguring walls. Clause 28 prescribes additional works that constitute minor renovations, in\nparticular, removing carpet or other soft floor coverings to expose underlying wooden or other hard floors as\nthis could have a similar impact to installing hard floors. Minor renovations also include installing a clothesline,\nceiling insulation, heat pump and rainwater tank (clause 28). In addition, the owners corporation can make\nby-laws which specify work comprising minor renovations that is additional to the prescribed works (section\n109(4)).\n• Work that does not fall within the definitions of “cosmetic work” or “minor renovations”, such as work\ninvolving structural changes, work that changes the external appearance of a lot or work involving\nwaterproofing requires the approval of the owners corporation by special resolution or as authorised by, and\npermitted under, a by-law (section 111).\n\n### By-laws\n\n• There are new model by-laws set out in Schedule 3 to the 2016 Management Regulation which may be\nadopted by strata schemes. Owners corporations of existing strata schemes must review their by-laws\nwithin 12 months of the commencement of the new law (clause 4(1) in Schedule 3 to the 2015 Management\nAct) and may, by special resolution in general meeting, change their by-laws, including by adopting the new\nmodel by-laws (section 141(1)). The new model by-laws apply to strata schemes that come into existence\nafter the new laws commence (section 134(1)). The by-laws in force for strata schemes that exist between\n1 July 1997 and the date on which the 2015 Management Act commences continue to operate as before,\nunless they choose to adopt the new model by-laws (section 134(2)). For strata schemes in existence before\n1 July 1997, the by-laws set out in Schedule 2 to the 2016 Management Regulation apply with any changes\nmade in accordance with a previous law or the 2015 Management Act (section 134(3) and clause 35).\n• There is provision allowing for by-laws to limit the number of adults who may reside in a lot, however, the\nlimit cannot be fewer than 2 adults per bedroom (section 137). The by-law may not be inconsistent with any\nplanning approval or other law applicable to the lot (section 137(3)). Clause 36 provides that a by-law limiting\nthe number of adults who reside in a lot has no effect if all those adults are related to each other, including\nif the relationship is one of a parent, guardian, grandparent, son, daughter, grandchild, brother, sister, uncle,\naunt, niece, nephew or cousin. De-facto and carer relationships are also recognised in the clause. For the\npurpose of clause 36 and hence the exception, a person who is an Aboriginal or Torres Strait Islander is\nrelated to another person if the person is, or has been, part of the extended family or kin according to the\nindigenous kinship system of the person’s culture. These exceptions ensure that the occupancy by-laws\ndo not disadvantage families or people from cultural backgrounds where extended families generally live\ntogether.\n• There is no automatic prohibition on the keeping of pets. A by-law cannot prevent the keeping of an\nassistance animal (section 139(5)), however, can require a person to produce evidence that the animal is an\nassistance animal (section 139(6)). The new model by-law makes it easier to keep pets in a scheme either by:\n(a) notifying the owners corporation, in writing, provided it keeps the animal within the lot, supervises it on\ncommon property and cleans up after the animal on all areas of the lot or common property (Option A in\nclause 5 of Schedule 3 to the 2016 Management Regulation); or\n(b) obtaining the written approval of the owners corporation, not to be unreasonably withheld and, if\nnot approved, written reasons must be given to the owner or occupier for such refusal. If approved, the\nowner or occupier needs to comply with the requirements for keeping animals set out in paragraph (a)\nabove (Option B in clause 5 of Schedule 3 to the 2016 Management Regulation). Option B also includes\na requirement for the owner or occupier to give the owners corporation evidence demonstrating that the\nanimal is an assistance animal (if any) and if required to do so by the owners corporation.\nOption A is the default option, prevailing if the owners corporation does not choose an option when\nregistering the model by-laws.\n• In relation to smoking, the penetration of smoke into a lot or common property is recognised as a possible\nnuisance or hazard which may unreasonably interfere with the use or enjoyment of the common property or\nanother lot (see the Note to section 153). There is a new model by-law concerning smoke penetration which,\nwhile not prohibiting the smoking of tobacco or any other substance inside a person’s lot, it prohibits smoke\ndrift that may impact others living in the scheme. The model by-law 9 provides three options, A, B and C.\nOption A prevails if the owners corporation does not choose an option when registering the model by-laws.\n• The new by-law 17 requires an occupier give written notification to the owners corporation of any change\nof use, including any lease (however short), 21 days before any such change occurs. This by-law targets\nparticularly short-term leases, such as AirBnB leases, in order to assist owners corporations to check\ncompliance with development approvals and be aware of people entering and leaving the scheme to\nmaintain the security of the premises as much as possible.\n• The Tribunal may impose monetary penalties of up to $1,100 in respect of a breach of a by- law where the\nperson has committed a breach after being given notice by the owners corporation requiring the person to\ncomply with the by-law (section 147(1)). In the case of a breach of the same by-law within 12 months of the\npenalty, the Tribunal may impose a further penalty of up to $2,200. Monetary penalties are payable to the\nowners corporation, unless the Tribunal otherwise orders (section 147(6)).\n• The lessor of a lot must give a copy of the by-laws to a tenant within 14 days of the tenant becoming entitled\nto possession of a lot and within 14 days of a change to the by-laws taking effect (section 186).\n\n### Alternative dispute resolution\n\n• The 2015 Management Act favours mediation as the preferred way to resolve disputes between parties. A\nperson may apply to the Secretary of the Department for mediation of any matter for which an order may be\nsought from the Tribunal under the 2015 Management Act, but the Secretary may dismiss an application for\nmediation if they believe the application is frivolous, vexatious, misconceived or lacking in substance (section\n218). A mediation session must be attended by each party to the dispute or a representative of the party (if\nall other parties consent to the representation), and other persons may attend with the leave of the mediator\n(clause 59). Each party must pay their own costs associated with the mediation (clause 60). A mediator or a\nparty may terminate a mediation at any time, the latter by giving notice of the termination to the mediator and\neach other party (clause 61).\nPart B: Strata Renewal – Strata Schemes Development Act 2015 (NSW)\nA reference in this Part B to:\n(a) a section refers to a section in the 2015 Development Act; and\n(b) a clause refers to a clause in the 2016 Development Regulation.\n• Part 10 of the 2015 Development Act prescribes a process for strata renewal. The process includes the\nfollowing steps:\n• Submission and consideration of a strata renewal proposal;\n• The establishment of a strata renewal committee;\n• The process for decision-making in respect of a strata renewal plan;\n• Application for orders to give effect to the strata renewal plan; and\n• The making of Court orders to give effect to strata renewal plans.\n• Any person may give a written proposal for the collective sale or redevelopment of a strata scheme (section\n156). There is no requirement that the building be in disrepair or nearing the end of its useful life.\n• Within 30 days of receiving the proposal, the strata committee must consider it in a meeting of the strata\ncommittee (section 157).\n• If the strata committee decides that the proposal warrants further consideration of the owners corporation,\nthe strata committee must convene a general meeting of the owners corporation within 30 days of making\nthat decision (section 158).\n• The proposal will lapse if the strata committee decides that it does not warrant further consideration by the\nowners corporation and a qualified request to consider the proposal at a general meeting has not been\nmade within 44 days after the strata committee made the decision, or if the owners corporation decides the\nproposal does not warrant investigation by a strata renewal committee (section 159). As mentioned in the\nthird bullet point under the heading “Meetings” above, a qualified request is a request made by one or more\nlot owners in the strata scheme having a total unit entitlement of at least one-quarter of the aggregate unit\nentitlements (section 154).\n• If the owners corporation resolves that the proposal warrants further investigation by a strata renewal\ncommittee, the owners corporation must establish the strata renewal committee (section 160). The\ncommittee must have a chairperson and no more than 8 other members as determined by the owners\ncorporation, and there are provisions prescribing which persons may not be elected on the committee\n(sections 160 and 161), as well as provisions for declaring conflicts of interest (section 165).\n• The strata renewal committee may exercise its functions for up to 1 year, unless extended by special\nresolution of the owners corporation (section 166).\n• There are prescribed matters which must be included in strata renewal plans, including the name of the\npurchaser or proposed developer (as applicable), any planning approvals if a redevelopment, the sale price or\nminimum reserve price if a collective sale, details of any estates, interests, caveats or priority notices affecting\na lot or common property in the scheme, all current unit entitlements, and a market valuation of the building\nand its site and the compensation value of each lot (section 170 and clauses 32 and 33). If a strata renewal\nplan is for a collective sale of a scheme, the plan must provide for the purchase of each lot at not less than\nthe compensation value for the lot. If the plan is for a redevelopment of a strata scheme, the plan must\nprovide for each dissenting owner’s lot to be purchased at not less than the compensation value for the lot\n(sections 170(3) and (4)).\n• A market valuation of a building and its site is required at the time the strata renewal plan is issued and at the\ntime an application to the Court is made and, in each case, the market valuation cannot be more than 45\ndays old (clause 28).\n• If the strata renewal plan is for a collective sale of a strata scheme, the amount paid for the sale of the\nlots and common property must be apportioned amongst the owners of the lots according to the unit\nentitlements of the owners’ lots (section 171(1)).\n• If the strata renewal plan is for a redevelopment of a strata scheme, dissenting owners are treated differently\nto those who support the plan. The amount paid for the sale of a dissenting owner’s lot must not be less\nthan the compensation value of the lot and this must be provided for in the strata renewal plan (sections\n170(4) and 171(2)). However, the amount to be paid to a dissenting owner must not be less than the higher\nof the compensation value of their lot and the total consideration that would accrue to the dissenting\nowner under the plan and the owner’s lot if that owner had supported the plan (section 182(1)(e)). The\ncompensation value of the lot is the compensation determined under section 55 of the Land Acquisition\n(Just Terms Compensation) Act 1991 (NSW) as modified by clause 27 (section 154). Further, any terms of\nsettlement under the strata renewal plan, as they apply to a dissenting owner, must be just and equitable in\nall circumstances (section 182(1)(f)) and if a dissenting owner objects to an application for an order to give\neffect to a strata renewal plan then their reasonable costs of objecting are covered by the owners corporation\n(section 188).\n• The strata renewal plan is to be considered by the owners corporation in general meeting and the owners\ncorporation may, by special resolution, decide to give the strata renewal plan to the owners for their\nconsideration. The owners corporation may, by resolution, amend the plan or decide to return it to the\ncommittee for amendment (section 172).\n• If an owner has received a copy of the strata renewal plan and agrees to participate in the proposed\ncollective sale or redevelopment under the plan, they may provide a notice supporting the plan to the\nreturning officer provided that the notice is given after at least 60 days of being given the plan and before\nthe plan lapses(section 174). Basically, support notices cannot be collected for 60 days after they are\nissued, giving owners time to consider the contents of the plan. Since a strata renewal plan lapses 3 months\nafter the owners corporation decides to give the plan to owners for their consideration, there is likely to be\napproximately 3 weeks for active collection of notices (sections 174(1) and 177). A support notice must be\nsigned by the owner and each registered mortgagee or covenant chargee of the owner’s lot (clause 174(1)(b))\nand this may take time so should be considered in advance to avoid running into any timing issues.\n• Owners must opt-in to show their support (by way of support notices) so an abstention is essentially a show\nof no support.\n• The returning officer must be an independent collection officer, appointed by resolution of the owners\ncorporation. This independent collection officer must not be a lot owner or a relative or associate of a lot\nowner, a member of the strata committee, a strata managing agent for the strata scheme or an employee\nof that agent, or a person with a pecuniary interest in the outcome of the collective sale or redevelopment\nor a relative or associate of that person unless the interest is the reasonable fee for performing the returning\nofficer’s function and the strata committee has approved payment (clause 29). These requirements for the\nreturning officer may be an opportunity for strata managing agents to cross-refer work to each other as\n“collection officers” for strata schemes in which they have no connection and are, therefore, independent as\nper clause 29.\n• An owner may withdraw their support notice at any time before the secretary of the owners corporation has\ngiven notice in accordance with section 176(2) to the owners and the Registrar-General that the required level\nof support for the strata renewal plan has been obtained (section 175).\n• The required level of support is the support of owners of at least 75% of lots (not unit entitlements or utility\nlots) in the strata scheme (section 154).\n• The strata renewal plan will lapse in a number of circumstances, including where the required level of support\nis not received within 3 months after the owners corporation decided to give the plan to owners for their\nconsideration, as abovementioned (section 177).\n• Once the required level of support for the strata renewal plan is obtained, the owners corporation may\nresolve, in general meeting, to apply to the Land and Environment Court for an order to give effect to the plan\n(section 178). A dissenting owner may file an objection to the application for an order to give effect to the\nstrata renewal plan (section 180) and, as abovementioned, the owners corporation must pay the dissenting\nowner’s reasonable costs of proceedings (section 188).\n• When the Court makes an order giving effect to a strata renewal plan, matters that it will take into\nconsideration include whether the plan was prepared in good faith, whether the appropriate disclosures were\nmade and whether there was compliance with statutory requirements. Therefore, it is important that the entire\nprocess is rigorously followed (section 182).\n• There are a number of other provisions dealing with the hearing of the application, the making and contents\nof the order by the Court and the effect of the order (sections 181 to 187).\n\nThank you REINSW for this article – https://www.reinsw.com.au/",
    "images": []
  }
}