{
  "url": "https://netstrata.com.au/netstrata-celebrates-jersey-day-with-a-bbq/",
  "timestamp": "2025-11-03T17:45:39.242753",
  "success": true,
  "content": {
    "title": "Netstrata Celebrates Jersey Day with a BBQ to Support Organ Donation Awareness",
    "date": "2024-08-30T06:38:15+00:00",
    "category": null,
    "author": "S J",
    "main_content": "At Netstrata, we’re passionate about making a difference in our community, which is why we were excited to take part in Jersey Day, hosting a BBQ where our team proudly wore their favourite sporting jerseys to raise awareness about the importance of organ and tissue donation.\n\nJersey Day is an Australia-wide initiative, inspired by the remarkable story of Nathan Gremmo. At just 13 years old, Nathan made the decision to become an organ donor, a choice that ultimately saved six lives. His legacy continues to remind us all of the profound impact that one person’s generosity can have on others in need.\n\nEvery year, Jersey Day encourages schools, workplaces, and communities across the country to spark a conversation about the importance of organ and tissue donation. It’s not about raising money; it’s about raising awareness and encouraging people to think about registering as an organ and tissue donor. Wearing our jerseys was a fun and effective way for the Netstrata team to show support for this vital cause and to start meaningful conversations with colleagues, friends, and family.\nThe BBQ was a fantastic opportunity for our team to come together, share stories, and support a cause that’s close to our hearts. By wearing our jerseys, we showed that each of us has the power to help save lives by becoming an organ and tissue donor.\n\nThe decision to register as an organ and tissue donor is simple but incredibly impactful. One donor can transform the lives of up to seven people, and many more can benefit from tissue donation. It’s a powerful way to give back to the community and offer hope to those waiting for a life-saving transplant.\n\nWe encourage everyone to consider becoming an organ and tissue donor. It’s a small decision that could make a world of difference.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}