{
  "url": "https://netstrata.com.au/strata-swimming-pool-safety-2016/",
  "timestamp": "2025-11-03T17:59:26.114320",
  "success": true,
  "content": {
    "title": "Strata Swimming Pool Safety 2016",
    "date": "2016-05-10T02:19:45+00:00",
    "category": null,
    "author": "S J",
    "main_content": "As an enhancement to legislation passed in 2013, the NSW State Government has recently announced additional safety measures designed to protect children from harm around swimming pools.\n\nFrom April 29 2016 residential tenancy agreements must feature a valid certificate of compliance or a relevant occupation certificate if the owner wants to lease their property.\n\nFor owners selling their property, a copy of a valid certificate of compliance, relevant occupation certificate or a valid certificate of non-compliance must be attached to the sales contract. If a certificate of non-compliance is attached, the vendor is in essence transferring the obligation of compliance to the purchaser; who will then have 90 days after settlement to rectify the defects listed.\n\nTo obtain a certificate of compliance, the owner must organise an inspection through their local council or an accredited certifier. The certificate of compliance is valid for three years.\n\n[IMAGE_0]\n\nWhile strata-titled properties with more than two lots are exempt from these new requirements around selling and leasing properties with pools, Owners Corporations are still required to register their swimming pool or spa on the NSW Swimming Pool Register.\n\nThe online registration process is relatively straightforward – you’ll need to inspect your pool using a checklist that’s provided. There are various checklists depending on the type of pool. As an example, pools built before September 1 2008 that are not on the waterfront have such requirements as:\n\n- The pool fence must be at least 1200mm high all the way around measured from the outside of the pool\n- The gap between the bottom of the fence and the ground is no more than 100mm\n- The gate must be self closing and latch by itself from any position\n- The gate must open outwards, away from the pool\n\nThe statistics relating to children fatalities around swimming pools provide an important justification for the Government’s action on this issue. According to the Sydney Morning Herald, “In the past 13 years, 83 children under five years of age have drowned in backyard pools in NSW and a further 80 children have suffered neurological damage as a result of being immersed in a pool.”\n\nAt Netstrata, we support any legislation that makes a strata scheme’s common property safer for all. Given that many strata schemes in Sydney have a swimming pool; it is only logical that we’d all want to make, what is a potentially hazardous addition to a strata property, as safe as possible.\n\nWhile strata owners don’t need an official pool inspection when they want to sell or lease their property, Owners Corporations can request an inspection from a council or a private pool certifier at any time as a precautionary measure to ensure that the pool is maintained to all required safety standards. This will ensure that the chance of harm to children who play on the strata common areas is minimised.\n\nIf you have any questions regarding swimming pool safety, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}