{
  "url": "https://netstrata.com.au/the-keeping-of-animals-in-a-strata-scheme/",
  "timestamp": "2025-11-03T18:01:29.197318",
  "success": true,
  "content": {
    "title": "The keeping of animals in a strata scheme",
    "date": "2011-09-16T10:47:42+00:00",
    "category": null,
    "author": "S J",
    "main_content": "#### Introduction\n\nThe keeping of animals in a strata scheme will almost always lead to healthy debate on the pros and cons of any request made.\nIn  this recent decision of the Consumer, Trader and Tenancy Tribunal,  Grace  Lawyers successfully represented the Owners Corporation in obtaining Orders prohibiting the lot owner from keeping a dog. The case illustrates that the refusal to allow an animal in a strata scheme may be upheld if the Tribunal can be shown that this refusal was not unreasonable by the Owners Corporation.\n\n#### Facts\n\nThe strata consisted of twenty lots and the dispute started when the lot owner made an application for the keeping of the dog via emails to the strata managing agent in 2010. The application provided reasons for the keeping of the dog and that it had been trained.\n\nThe application was considered in an Annual General Meeting shortly after the request was made. Interestingly at the same meeting the standard by-law for the keeping of animals applicable to the scheme was repealed, and a special by-law passed which prohibited the keeping of all animals except companion animals. Consequently, the owner’s motion was considered and refused.\nThe lot owner appealed against the decision and the matter went before the Adjudicator. The Adjudicator made Orders that the lot owner comply with the new by-law and required removal of the dog. The owner appealed to the Tribunal.\n\n#### Decision\n\nThe Tribunal held that it was not satisfied from the evidence provided by the appellant that the Owners Corporation unreasonably withheld its approval. Further, it found that the Owners Corporation had dealt with the applicant’s request for consent on its merits.\nThe Tribunal held that the history combined with the lack of any detail in the application made by the lot owner as to how the dog would be managed and controlled when on the lot and common property were sufficient reasons to refuse the application.\n\n#### What does this mean?\n\nThe issue of keeping of animals in strata schemes is a common area of dispute, usually involving an Owners Corporation’s refusal to allow animals even though allowing pets is not specifically prohibited in the by-laws of the strata scheme in question. The decision shows that in dealing with these matters, the Tribunal considers the ‘reasonableness’ of the refusal based on the evidence provided.\nUnreasonable refusal by the Owners Corporation can be construed if the Owners Corporation has a blanket prohibition on the keeping of animals in the scheme (without a by-law entrenching that position). The prohibition may be noted in the minutes of an Owners Corporation meeting, notice to this effect at the entrance to the building etc. Although at first glance this may seem a reasonable approach for the Owners Corporation to take, the Tribunal characterise it as an unreasonable refusal.This is because a blanket prohibition takes away any opportunity for owners or occupiers to present requests to keep animals to the Owners Corporation so that the Owners Corporation can consider such requests on their merits.\nIf   an Owners Corporations does not want animals it needs to make that position very clear by passing a by-law that prohibits all animals except the keeping of Companion Animals (as they are generally allowed by law, e.g. guide dogs).\nThe Owners – Strata Plan 34151 v Bergseng (CTTT – 2011)\n\nThank you Grace Lawyers for this Article\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}