{
  "url": "https://netstrata.com.au/e-waste-in-strata-communities-a-call-to-action/",
  "timestamp": "2025-11-03T17:35:22.806078",
  "success": true,
  "content": {
    "title": "E-Waste in Strata Communities: A Call to Action",
    "date": "2023-11-01T05:26:41+00:00",
    "category": null,
    "author": "S J",
    "main_content": "As an important resident of your strata community, you understand the importance of managing your resources efficiently. However, there’s a growing issue that demands our attention – electronic waste or e-waste.\n\nMillions of electronic devices like televisions, computers, and mobile phones are discarded in Australia every year. In fact, e-waste is the fastest-growing component of the municipal solid waste stream. The Global E-Waste Monitor 2020 reported that e-waste increased by 21% in the five years leading to 2019 and predicted that by 2030, it will nearly double the 2014 figure. This surge is fuelled by higher consumption rates, shorter lifecycles, and limited repair options.\n\nThe impact on strata communities is significant. A staggering 88% of the 4 million computers and 3 million TVs purchased in Australia every year will ultimately end up in landfills, contributing to the 140,000+ tonnes of electronic waste generated annually. Sadly, fewer than 1% of TVs and around 10% of PCs and laptops are recycled nationwide. E-waste is also responsible for 70% of the toxic chemicals like lead, cadmium, and mercury found in landfills. By recycling just half of the televisions discarded annually, we could save 23,000 tonnes of CO2 emissions.\n\nStrata communities are not immune to this crisis. E-waste is growing at three times the rate of any other waste stream, with discarded devices piling up around the world at a rate of 40 million per year. However, here’s a ray of hope: 98% of the components in your computer or television can be fully recycled.\n\nE-waste isn’t just an environmental problem; it’s a health issue too. The toxic chemicals found in e-waste, such as lead, mercury, and arsenic, can pollute our soil and water, disrupting ecosystems and harming our health.\n\n### What Can Strata Communities Do?\n\n#### Reduce\n\nThe best way to combat e-waste is by reducing the technology you purchase. Strata communities can lead by example, making thoughtful decisions about common area electronics. Does the common room really need the latest TV model, or can the existing one serve its purpose effectively?\n\n#### Recycle\n\nComputers and computer accessories should never be put in household recycling bins. Instead, strata communities can designate collection points for residents to drop off e-waste for recycling.\n\n#### Mobile Phones\n\nEncourage residents to recycle their old mobile phones through programs like MobileMuster, which transforms mobile phone waste into valuable materials for reuse.\n\n#### TV & Computer Recycling Scheme\n\nInform residents about the national recycling scheme introduced by the Australian Government in 2011. This scheme prevents old TVs and computers from ending up in landfills.\n\n#### Learn How To Repair\n\nStrata communities can consider promoting DIY repair solutions. Many YouTube videos teach how to fix common hardware problems, extending the lifespan of electronic devices.\n\n#### Buy Energy Star Rated Electronics\n\nWhen updating common area electronics, consider investing in energy-efficient devices. These devices consume less energy, reducing electricity bills and environmental impact.\n\nAs strata communities, we play a crucial role in conserving resources and reducing our environmental footprint. Let’s join the cause, support Clean Up Australia, and take action to tackle the growing issue of e-waste.\n\nOur commitment to responsible e-waste management will make a real difference, ensuring a healthier and more sustainable future for all.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}