{
  "url": "https://netstrata.com.au/proxy-voting/",
  "timestamp": "2025-11-03T17:51:32.698139",
  "success": true,
  "content": {
    "title": "Proxy Voting",
    "date": "2023-05-30T06:43:06+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The ABC recently reported on allegations in Melbourne of strata owners allegedly approaching other apartment owners and asking to hand over their vote. The article stated that people were unaware of the implications of signing a proxy vote form.\n\n“Australian Apartment Advocacy director Samantha Reece said proxy farming by either lot owners or strata managers was a “common” issue her organisation dealt with.”\n\n“Of the 527 requests for mediation that her organisation received last year, Ms Reece said a quarter of them were cases involving overseas buyers.”\n\nProxy farming occurs when an individual encourages owners to give them voting rights on all motions and issues.\n\nVoting at strata meetings is an integral aspect of being part of a strata community. It allows everyone to vote for or against the proposals, with a strong democratic focus on the outcome.\n\nIn New South Wales if you’re unable to attend an owners corporation meeting you can nominate another owner to vote on your behalf.\n\nAccording to the Department of Fair Trading website,  “Appointment of a proxy is only valid if it has been made in writing on the form approved by NSW Fair Trading. Proxies must be dated and be given to the secretary before or at the meeting.”\n\nThere are conditions relating to proxy voting including that the proxy can’t vote if the original owner votes. There are also limits on the number of proxies that can held by an individual owner.\n\nFor schemes with less than 20 lots, owners can only hold one proxy vote. If the strata scheme has more than 20 lots, then owners can’t hold more than five per cent of the total number of lots.\n\nIn a proxy farming situation, the votes could be shared across a unified voting block of owners.\n\nThe proxy form is listed on the Fair Trading website.\n\nIt’s always best to give your proxy to a trusted neighbour who will vote following your intentions. You don’t necessarily need to give your proxy on all motions – you can stipulate the limitations of the proxy of the form.\n\nAt Netstrata, we’d also encourage neighbours to share information about owners’ voting rights and to point them to the Fair Trading website. You could also put notices on communal boards so that everyone is familiar with the rules and benefits of actively engaging in meetings.\n\nIf you have any other questions about proxy voting, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}