{
  "url": "https://netstrata.com.au/hidden-electricity-costs-in-apartments/",
  "timestamp": "2025-11-03T17:37:43.144111",
  "success": true,
  "content": {
    "title": "Hidden electricity costs in apartments",
    "date": "2010-11-25T22:40:38+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Keeping a lid on energy costs inside your apartment is as simple as following a few simple steps – but what about electricity use in your building’s hallway, laundry or car park? You may not realise it but you could be wasting hundreds of dollars each year in electricity costs for common areas that are built into your strata fees. These sorts of costs can vary significantly, ranging from less than $100 per year for small apartment blocks and villas, to more than $1500 per year for a large high rise complex.\n\nHere are a few tips to save energy and cut these hidden costs:\n\nFor common area lighting (both indoor and outdoor), choose energy efficient lights wherever possible and install timers and motion sensors so they’re not running 24 hours a day.\nPool pumps and heating are big energy users and it’s important to ensure that they are not running longer than necessary. If possible swap your electric heating to a gas or heat pump system. Savings can also be made by having car park ventilation controlled by carbon monoxide sensors and using variable speed drive fans.\nAir conditioning systems can account for up to 60% of energy bills in common areas. Try using a programmable time clock to minimise operation time, and appropriate thermostat settings to avoid overheating or overcooling.\n\nFor larger apartment blocks an audit report by an energy consultant can be money well spent.\n\nPAUL MYORS is an energy efficiency expert from Energy Australia.\n\nTo talk to Paul Myors about these or other energy efficiency tips call (02) 9966 7985 or go to www.ausgrid.com.au/efficiency\n\nFor all of your strata management questions please do not hesitate to talk your strata manager.",
    "images": []
  }
}