{
  "url": "https://netstrata.com.au/stephen-brell-appointed-president-of-the-sca-nsw/",
  "timestamp": "2025-11-03T17:56:07.980892",
  "success": true,
  "content": {
    "title": "Stephen Brell Appointed President of the SCA (NSW)",
    "date": "2022-05-30T01:28:56+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Having served as a board member since 2017, Stephen Brell was recently appointed President of the Strata Community Association (NSW).\n\nSCA (NSW) is the peak industry body for Strata and Community Title Management in New South Wales. Membership includes strata managers, support staff, committee members and suppliers of products and services to the industry.\n\nSCA (NSW) has more than 3,000 members who help oversee, advise or manage over 750,000 lots in NSW, and fulfils the dual roles of a professional institute and consumer advocate. SCA (NSW) champions consumer rights and advocates for the highest industry standards, empowering its members to be the very best they can be.\n\nStephen has more than 20 years of strata management experience and is the Managing Director and Licensee–in-Charge of the Netstrata group of companies. He’s a licensed strata managing agent and real estate agent, and a registered property valuer. Stephen has served on a number of industry working groups and SCA (NSW) committees.\n\nHe has lectured at TAFE NSW and for the Institute of Strata Title Management (now Strata Community Australia) on Strata and Community Title Management.\n\nIn taking on the position as President, Stephen acknowledges the fantastic contribution and achievements that his predecessor, Chris Duggan made. Chris remains as an SCA (NSW) Board Director and steps into the role as SCA (National) President.\n\nStephen also congratulates Emily Doherty, Peter Brisbane and David Bannerman for their re-appointment to the board, and to the newly appointed board member Geoffrey Linders.\n\n[IMAGE_0]\n\n“I’m humbled to take on the role as SCA (NSW) President. The strata community is experiencing significant change at the moment and I look forward to working with the other board members to support SCA members,” said Stephen.\n\n“It’s my aim to raise our industry to the highest levels of professionalism and standards, and promote consumer confidence and protection.”\n\nStephen is passionate about finding ways to provide innovative services to clients. He believes that good innovation, done properly creates a win win win scenario – a win for owners, a win for the management team and a win ultimately for the business through enhanced reputation and goodwill.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}