{
  "url": "https://netstrata.com.au/keeping-our-children-safe/",
  "timestamp": "2025-11-03T17:41:45.536367",
  "success": true,
  "content": {
    "title": "Keeping our children safe",
    "date": "2011-11-14T22:04:42+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The NSW Government has launched an education campaign to protect the state’s children from avoidable death and injury. Each year around 8000 children are admitted to hospital because of falls, 50 of which are from windows and balconies. Senior NSW Government Ministers are working collaboratively on the new campaign, which will see 40,000 brochures and posters distributed across the state. Planning and Infrastructure Minister Brad Hazzard says too many young lives are lost in circumstances that can be avoided.\n\n“It’s clear something needs to be done and that is why the NSW Government is making childhood safety a number one priority.”\n\nHealth Minister Jillian Skinner says a working party lead by The Children’s Hospital at Westmead has recommended the launch of an education campaign to reduce the incidence of childhood falls.\n\n“The campaign is backed by the recommendations of a report on childhood health and safety.”\n\nFair Trading Minister Anthony Roberts said posters will be sent directly to all licensed property and strata managers in NSW so they can provide this important information to landlords, rental tenants, strata owners corporations and strata residents.\n\n“The campaign material includes simple tips to avoid injury and save lives:\n\n- Ensure windows are locked and cannot be opened by a child\n- Install metal window guards with bars less than 10cm apart\n- Keep furniture away from windows and balustrades\n- Remember flyscreens do not provide protection\n- Always supervise children on balconies and in other people’s homes.”\n\nMinister for Citizenship and Communities, Victor Dominello is encouraging all families and local service providers to get behind the campaign by ensuring safety in their homes and public places.\n\n“The safety of our children is too important not to be taken seriously. I encourage all communities to get behind this initiative and take the time to alert others about the dangers of windows and balconies,” Mr Dominello said.\n\nThank you to Fair Trading for this article",
    "images": []
  }
}