{
  "url": "https://netstrata.com.au/securing-your-strata-property/",
  "timestamp": "2025-11-03T17:54:18.547748",
  "success": true,
  "content": {
    "title": "Securing Your Strata Property",
    "date": "2022-12-06T06:05:06+00:00",
    "category": null,
    "author": "S J",
    "main_content": "#### Our Helpful Guide to Ensure Your Strata and Community Title Properties Are Secure\n\nOne of the attractions of living or working in a strata or community scheme is the additional security that can be provided to a building such as security intercoms, secured garage areas and the sense of ‘community watch’ within a development.\n\nRegrettably however, residents often don’t become security conscious until after they have had a major security breach, and no matter how many security devices may be fitted to the common areas of your building, the harsh reality is that a security building is only secure as the people that reside in it.\n\nSurveys have shown that over 90% of occupants living in a multi-dwelling property have ‘buzzed’ strangers into their building.\n\nA main entry security door or shutter at the entry to a garage area provides both a visual and physical deterrent; however these areas are often secluded and are a common target for many would be thieves. Aside from this very few residents ever stop to check that a security garage door has closed after they’ve entered or exited the building and it’s fairly easy for a thief to simply wander into the building whilst the door is opening or closing.\n\nThankfully legislators recognise the importance for owners of strata and community properties to be able to further secure their own premises. Pursuant to the by-laws, all owners of residential, commercial, retail and industrial strata and community schemes are at liberty to undertake the installation of additional locking devices, security screens or other security devices to their windows, front doors, balcony doors and garage doors to further secure their individual premises. If such devices are not already in place at your property, we highly recommend they be installed. However, it should be understood that any additional locking devices must adhere to current fire safety regulations – a licensed locksmith will be able to offer advice on such regulations. Further, any additional security screens (not shutters) fitted to windows or doors must comply with any design and colour scheme that is already established at the property. If you are not certain of these protocols, simply contact your strata manager.\n\nThere are a variety of security strategies that you can initiate to further secure your property and it’s not always necessary to spend a lot of money on home security. There are things you can do that cost nothing. Care, vigilance and common sense are free.\n\nRemember, thieves aren’t brain surgeons on a day off; they are opportunists who will exploit easy targets. Making your building harder to break into than the one next door will go a long way to preventing a security breach at your property.\n\nThe following are 10 simple and cost-effective ways that you can further secure your property.\n\nMake sure your locks work\n\nEnsure that the locks you do have installed on windows, front doors, balcony doors and garage doors are functioning properly and ensure all your doors and windows, including common property entries and exits are closed and locked whenever you enter or leave the property.\n\nGet to know your neighbours\n\nTry to get to know the other residents within your scheme. Conduct brainstorming sessions or make suggestions for security improvements for your building so they can be considered by all owners.\n\nDon’t leave notes\n\nOn doors for couriers or friends advising that you’re out or that you’ll be back in ten minutes.\n\nDispose of rubbish properly\n\nCut up boxes that contained expensive electrical equipment and dispose of them properly. Leaving large boxes on the nature strips for a council pick-up simply advertises the new appliances in your property. And ensure you tear up old bank statements or financial documents before placing them in the rubbish; Bank statements that are stolen from rubbish or recycling bins is a leading cause of identity theft!\n\nNatural ladders are a risk\n\nDon’t leave ladders, wheelie bins or pot plants in areas that can be used by thieves to scale the building.\n\nMark your property\n\nMark or label all your electrical appliances by using an engraver or ultra-violet pen so they cannot be readily sold by thieves and keep a record of their serial numbers separately so they may be provided to police in the event the worst happens.\n\nLock your vehicle\n\nAlways lock your vehicle and don’t leave valuables like phones, GPS units, sunglasses or iPods visible.\n\nSecure items in your garage\n\nSecure items such as bikes, tools and other valuables by chaining or locking them within your garage.\n\nMake sure your valuables aren’t visible\n\nDon’t leave iPods, laptops, wallets and keys near doors and windows where they can be seen by thieves.\n\nProgram Emergency phone numbers\n\nProgram the local Police Station’s phone number in the speed dial of home and mobile phones so it’s readily available in the event of an emergency.\n\nThis advice has been prepared with the assistance of security experts and the NSW police.\n\nView this article as a PDF\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}