{
  "url": "https://netstrata.com.au/how-insurance-accesses-order-of-appeal/",
  "timestamp": "2025-11-03T17:38:50.321369",
  "success": true,
  "content": {
    "title": "(HOW) Insurance accesses order of appeal",
    "date": "2011-07-05T05:30:09+00:00",
    "category": null,
    "author": "S J",
    "main_content": "#### INTRODUCTION\n\nThe NSW Court of Appeal in Vero Insurance Limited v. Owners of Strata Plan No. 69352 & Ors [2011] NSWCA\n138 on 30 June 2011 has clarified the amount of the excess payable by an owners corporation when a claim is\nmade on the Home Owners Warranty (HOW) Insurance in relation to common property building defects.\nTHE FACTS\nThe Owners – Strata Plan No. 69352 (The Owners) is a residential development consisting of 201 residential\nunits. Vero Insurance Limited (Vero) issued identical certificates in respect of insurance for all units. The Owners\nmade a claim on the HOW Insurance in relation to defective work on the common property in the amount of\n$85,137.50. Vero rejected the claim. The Owners appealed the decision of Vero in the Consumer, Trader and\nTenancy Tribunal (Tribunal).\nThe Tribunal determined that the excess payable by The Owners was limited to the first $500 of the whole claim\nof $85,137.50. Vero appealed the decision in the District Court of NSW. The District Court dismissed the appeal.\nVero then appealed to the Court of Appeal.\nVero contended that the Home Building Act, 1989 required it to provide insurance cover in relation to each\ndwelling. Each lot in the strata scheme is a dwelling, which was insured separately. Vero submitted that the\ncommon property in a strata scheme is not a “dwelling” for the purpose of the HOW Insurance, and that each lot\nproprietor’s dwelling includes his or her beneficial interest in the common property as a tenant in common (that\nis, some part of the common property was attached to each dwelling in the strata scheme). It was further\nsubmitted that an owner corporation is not an insured under, or a beneficiary, of the HOW Insurance.\n\n#### THE DECISION\n\nThe Court of Appeal held that The Owners was entitled to make a claim in its own right under the HOW\nInsurance in respect of defective work on the common property.\nThe Court reached this conclusion by analysing the interplay between sections 18D and 99(1) of the Home\nBuilding Act, 1989 and the relevant provisions of the Strata Schemes Management Act, 1996 and the Strata\nSchemes (Freehold Development) Act, 1973. The Court concluded that the HOW Insurance had to insure The\nOwners as the successor in title to the common property, against the specified risks. It noted that The Owners\ncould make the claim by virtue of section 227(2) of the Strata Schemes Management Act, 1996, or more simply\nin its capacity as the registered proprietor of the common property and successor in title. As result, the Court\nheld that the Tribunal was correct. Only one excess of $500 was payable. The Court did not consider, however,\nwhether the cover provided by the HOW Insurance was limited to $200,000 only (being the minimum liability of\nan insurer under the HOW policy in relation to each dwelling).\n\n#### WHAT DOES THIS MEAN\n\nThe decision has two important ramifications for all owners corporations:\n· In respect of a claim made on the HOW Insurance, only one excess of $500 is payable; and\n· An insurer may be unable to rely upon the developer exclusion clause in the HOW Insurance policy to\nlimit or reduce its liability to an owners corporation in relation to defects in the common property. This\narises where a developer retains ownership of lots in the scheme at the time a claim is made, and the\ninsurer asserts that its liability is reduced because of this.\n\nThank you Grace Lawyers for Information Supplied",
    "images": []
  }
}