{
  "url": "https://netstrata.com.au/netstrata-appoints-andrew-tunks-as-chief-operating-officer/",
  "timestamp": "2025-11-03T17:45:26.501627",
  "success": true,
  "content": {
    "title": "Netstrata Appoints Andrew Tunks as Chief Operating Officer",
    "date": "2025-09-24T07:26:00+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Netstrata is pleased to announce the promotion of Andrew Tunks to the role of Chief Operating Officer (COO).\n\nAndrew has been part of Netstrata for more than 17 years, beginning his career as a trainee strata manager before progressing to senior roles managing some of Sydney’s most complex strata schemes. Throughout his career, he has demonstrated a deep understanding of the strata industry and a commitment to delivering outstanding outcomes for clients.\n\nIn recent years, Andrew has led Netstrata’s training and development function, designing and delivering industry-leading programs that have elevated the skills of strata professionals within the business and beyond. He has also provided consultancy to other strata companies and contributed his expertise to the Strata Community Association, reinforcing his reputation as a leader in professional development across the sector.\n\nAs COO, Andrew will work closely with Netstrata’s Managing Director and the executive leadership team to drive operational alignment, scalability, and client-focused service delivery across the Group. His leadership will be central to strengthening operational efficiency, embedding continuous improvement, and supporting innovation across all business units.\n\nNetstrata’s Managing Director, Stephen Brell, said:\n“Andrew’s journey is an example of how talent, commitment, and leadership can grow within Netstrata. His appointment as COO reflects both his exceptional contribution to our organisation over the years and his vision for the future. We are delighted to have him in this role as we continue to strengthen our operations and deliver outstanding service to our clients.”\n\nNetstrata congratulates Andrew on this well-deserved achievement and looks forward to the positive impact he will bring to the role of Chief Operating Officer.",
    "images": []
  }
}