{
  "url": "https://netstrata.com.au/whats-ahead-in-2021/",
  "timestamp": "2025-11-03T18:05:09.786201",
  "success": true,
  "content": {
    "title": "What’s Ahead in 2021?",
    "date": "2020-12-18T04:51:01+00:00",
    "category": null,
    "author": "S J",
    "main_content": "2020 was a particularly busy year for the strata sector. As with many industries, being forced into lockdown not only changed the way we work, but more importantly the manner in which services were provided to you, our valued clients. We intend on maintaining many of these innovations beyond COVID such as the adoption of hybrid meetings (see further details below).\n\nAside from this there have been numerous legislative and policy changes that have impacted the administration of your scheme this year, these include;\n\n- The Design and Building Practitioners Act 2020\n- The Residential Apartment Buildings (Compliance and Enforcement Powers) Act 2020\n- The commencement of the Competent Fire Safety Practitioners Regime\n- Project Remediate (for schemes affected by External Combustible Cladding)\n- The Strata Portal and Office of Building Commissioner Defect Survey\n\nThe Strata Portal and OBC Defect survey are bold initiatives by the NSW Fair Trading and Office of Building Commissioner, attempting to provide more transparency to owners in the sector, as well as gathering valuable data surrounding the impacts of defects on schemes as well as the effectiveness of the warranty process.\n\n2021 will also trigger the 5-year statutory review of the Strata Schemes Management Act 2015. This review is designed to gauge the effectiveness of the Act and the impact on the administration of strata schemes and it is likely the review will lead to even more changes to the manner in which your scheme is managed.\n\nExcitingly, the peak industry body representing owners and strata managers, Strata Community Association (NSW), will be pursuing an application to the Professional Standards Council for Strata Managers to be recognised under the Professional Standards Act 1984. Should this application be successful it will usher in a new era of management services and consumer protection that will benefit all stakeholders that live and work in strata schemes across NSW.\n\nIf there is a silver lining to COVID-19 it’s that like many businesses we’ve been forced to innovate like never before. We intend to build on these innovations in 2021 including;\n\n#### Hybrid Meetings\n\nConducting general meetings and strata committee meetings with the ability for owners and committee members to attend either in person or via videoconference.\n\n#### Your Meeting App\n\nThe ability for owners to submit their pre-meeting and proxy votes for General Meetings directly from their smart phones. Ultimately this will lead to live voting at your strata meeting directly from your mobile device!\n\n#### Calendar of Scheduled Maintenance\n\nProviding your owners with a guide to the scheduled maintenance services occurring at your scheme throughout the year.\n\n#### Annual Property Inspection Report\n\nA detailed condition report of the common areas of your scheme prepared by your manager.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}