{
  "url": "https://netstrata.com.au/setting-up-mixed-use-buildings-for-strata-success/",
  "timestamp": "2025-11-03T17:54:37.372599",
  "success": true,
  "content": {
    "title": "Setting up Mixed-Use Buildings for Strata Success",
    "date": "2020-07-01T00:02:36+00:00",
    "category": null,
    "author": "S J",
    "main_content": "I’m sure we’ve all seen them on the high streets of our commercial districts – retail shops at street level, offices on the first couple of floors and apartments on the top levels.\n\nMixed-use buildings are becoming more and more common with developers keen on constructing buildings with varying components. No longer is one building just apartments and another building just offices.\n\nThe challenge arises for the strata managing agent to effectively manage the competing interests of all owners and occupiers.\n\nAt Netstrata, we believe that if the appropriate foundations for the strata scheme are established by the developers during the construction period, then potential conflicts down the track could be avoided when the scheme is fully operational and all the lots are occupied.\n\nOn the flip side, if prospective buyers are given reassurances that their interests will be protected then they’re more likely to buy with confidence.\n\nThere are two common titling strategies for mixed-use buildings. You could either set up a mixed-use strata scheme or a stratum subdivision with a building management committee.\n\n### Mixed-use strata scheme\n\nA mixed-use strata scheme is essentially the same as a standard strata scheme with the difference being that it’s acknowledged that there are varying uses of each lot.\n\nUnder the scheme, the owners own everything within the airspace of their lot as stated on the strata plan and they must follow the by-laws including seeking approval from the strata committee or the owners corporation before commencing building works. Everything that’s not part of their lot is common property and all owners must contribute to the ongoing maintenance, repair and management via levies.\n\nA mixed-use strata scheme has the potential to cause disagreement with the owners.\n\nThe owners of the shops may not be interested in covering the maintenance costs of the pool and gym because they never use them.\n\nSimilarly, the apartment owners may not consider it appropriate for the shops to erect signage on the building or set up seating for their customers in what could be used as a common area for all lot owners.\n\nThere may also be disagreements around who should cover the cost of the additional wear and tear in the common areas created by additional foot traffic as clients visit the offices.\n\n### Stratum subdivision with a building management committee\n\nThrough appropriate planning, a stratum subdivision may make managing mixed-use buildings easier, fairer and more efficient. The subdivision sets out different uses within a building or piece of land.\n\nIn essence, the residential apartments could form one strata scheme, while the commercial offices and shops could be grouped together in another strata scheme – a residential strata scheme and a commercial strata scheme.\n\nEach strata scheme within the same building would have their own by-laws that are relevant and fair to the use of the purpose for each stratum lot. There should be, for example, a common property rights by-law for each division which clearly define areas on the strata plan which are exclusively for use of residents and exclusively for use of commercial shop owners.\n\nIn this scenario, because there isn’t one owners corporation that manages the whole scheme, a Building Management Committee is required as an umbrella committee. A BMC ensures that any operational decision which only affects one component is managed by that entity itself, whereas decisions affecting the shared facilities are made by the BMC. Each entity appoints a representative to attend BMC Meetings.\n\nIf you have any questions around how to set up the strata structure for your development, please contact a Strata Managing Agent at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}