{
  "url": "https://netstrata.com.au/park-illegally-lose-your-home/",
  "timestamp": "2025-11-03T17:50:16.117279",
  "success": true,
  "content": {
    "title": "Park illegally – lose your home",
    "date": "2012-04-12T05:29:55+00:00",
    "category": null,
    "author": "S J",
    "main_content": "You would think, of all the issues that plague strata dwellers, parking would be the easiest to resolve.\n\nAfter all, a spot is allocated to you (or not) and you are allowed to park in it (or not). If only…\n\n“We have new tenants in our complex who have two or three cars parked in visitors parking and a fourth outside their garage blocking another tenant from getting in and out of their parking area.\n\n“I placed the following notice on two cars parked illegally for over a week: This Car is Parked in a VISITORS PARKING SPACE. Visitor Parking spaces are for the use of VISITORS of all residents We understand that on occasion, residents use these spaces for short periods of time. Please be respectful to all units by abiding by this. Please note – Parking cars on the grass is Not Permitted.\n\n“The notice was removed from one of the cars, which driven out and returned to the same spot an hour later.” – Sarah C, via Flat Chat Forum.\n\nOh dear, Sarah. I think you blew it when you said it was OK to park in visitors parking ‘on occasion’ and Forum StrataGuru Struggler agrees.\n\n“The problem here is that the note you left actually gives them and anyone else permission to park there – at least in their eyes,” he writes. “‘On occasion’ and ‘short periods of time’ are all tolerated in [my] complex but just not in writing.”\n\nStruggler is right. You need to let them know that by parking in visitors parking or on grass verges they are:\n\na) in breach of by-laws and that could lead to fines of up to $550 and\n\nb) by breaching by-laws they have also broken their lease which could lead to eviction.\n\nYes, they may think they are above the law but they could lose their home.\n\nA copy of the same notice from your EC secretary should be delivered to the rental agent or owner of the property. And let’s hope your original note is already in the trash.\n\nThanks to SMH for the article",
    "images": []
  }
}