{
  "url": "https://netstrata.com.au/work-health-safety-act-owner-corporations/",
  "timestamp": "2025-11-03T18:06:04.667243",
  "success": true,
  "content": {
    "title": "Work Health & Safety Act & Owner Corporations",
    "date": "2012-05-01T06:30:43+00:00",
    "category": null,
    "author": "S J",
    "main_content": "#### WHAT IS THE WORK HEALTH & SAFETY ACT?\n\nIn an effort to create consistency in the occupational health and safety laws around Australia, the Commonwealth and each State and Territory have worked together to create the Model Work Health & Safety Legislation which is (or will soon be) adopted by each State and Territory to replace the State based occupational health and safety laws.\n\nOn 1 January 2012, the Work Health & Safety Act 2001 (NSW) (“WHS Act”) came into effect and introduced:\n\n- new obligations for all persons involved in a workplace (not just employers and workers);\n- added obligations on persons already regulated by health and safety laws; and\n- personal penalties for non-compliance.\n\n#### \n\n#### WHAT IS A “PERSON CONDUCTING A BUSINESS OR ENTERPRISE”?\n\nThe WHS Act focuses around the concept of a “Person Conducting a Business or Undertaking” (“PCBU”). What does this mean?\n\nSection 5 of the WHS Act provides:\n\n“(1) For the purposes of this Act, a person conducts a business or undertaking:\n\n(a) whether the person conducts the business or undertaking alone or with others, and\n\n(b) whether or not the business or undertaking is conducted for profit or gain.\n\n(2) A business or undertaking conducted by a person includes a business or undertaking conducted by a partnership or an unincorporated association.\n\n(4) A person does not conduct a business or undertaking to the extent that the person is engaged solely as a worker in, or as an officer of, that business or undertaking.”\n\nPractically, PCBU includes, amongst others, owners’ corporations, sole traders, unincorporated associations, incorporated entities, partnerships and community associations.\n\n#### \n\n#### WHO IN A PCBU IS RESPONSIBLE?\n\nThe WHS Act imposes obligations or “duties of care” on a number of different personnel at different levels of a PCBU.\n\nOFFICERS (which takes on a formal meaning as per the Corporations Act 2001 – ie, a director or person who has involvement in the decision making of the business etc) have an active duty to ensure the PCBU is compliant with its various safety obligations. They must proactively stay up to date on work, health and safety matters affecting the business and generate processes to be implemented for compliance with the obligations imposed.\n\nWORKERS AND VISITORS of a PCBU each have positive obligations to take reasonable care for their health and safety whilst at the workplace and to ensure that their actions do not endanger others at the workplace. This is a shift from the old occupational health and safety laws which placed the obligations on the employer.\n\n#### \n\n#### IS AN OWNERS CORPORATION REALLY A PBCU?\n\nAn owners corporation is exempt from the WHS Act to the extent that it is only responsible for common areas which are used for residential purposes only. This exemption however, may only apply to a very small number of owners corporations particularly where, for example:\n\n- it employs people and independent contractors to carry out work on the common property including repairs and maintenance works;\n- any of the lots or common property are used for non-residential purposes such as a commercial use (even home\n- offices or businesses), retail use (including shops and restaurants), exercise classes or gardening and other activities by owners; or\n- any easements are granted over the property for cable lines or drainage pipelines, etc.\n\nAs such, most owners corporations, the strata committee members, employees and consultants will be effected by the WHS Act.\n\n#### IS AN STRATA COMMITTEE MEMBER AFFECTED BY THE WHS ACT?\n\nOne of the effects of the WHS Act is the broadening of the list of people who are responsible for work health and safety issues. One extension of this list is to strata committee members of owners corporations and the imposition of an obligation on them to exercise “due diligence”.\n\nThis obligation of “due diligence” includes a requirement to proactively understand the requirements of the WHS Act and ensure that the owners corporation has appropriate measures, plans and policies to comply with those requirements. This means that the strata committee members are required to:\n\n- keep relevant information on work health and safety issues on the common property and site;\n- understand the nature of operations being conducted in the building;\n- ensure that there are measures in place to eliminate (or at least minimise if elimination is not possible) any potential risks; and ensure that the owners corporation has systems in place which address and comply with the WHS Act requirements.\n\nPleading ignorance is not a defence to non-compliance for strata committee members.\n\n#### \n\n#### ARE THERE EXEMPTIONS FOR VOLUNTEERS?\n\nThe WHS Act does however draw a distinction between paid officers and volunteers.\n\nFor paid officers, obligations to exercise due diligence must be exercised and significant penalties apply for a failure to comply. On the other hand, while volunteers are also required to comply with due diligence obligations, they cannot be penalised for failing to do so. They can however, be penalised for failing to make sure that their actions or omissions do not adversely impact the health and safety of others.\n\n#### WHAT ARE THE CONSULTATION DUTIES?\n\nThe importance of consultation has been recognised in the WHS Act and has been implemented as a specific obligation on duty holders, that is, any person that holds a specific duty under the WHS Act. Under the WHS Act duty holders (with similar or overlapping duties) must consult, coordinate and cooperate with each other and also with workers. The Act sets out flexible ways in which the consultation may occur. Significant penalties can be imposed for breaches of this requirement.\n\n#### WHAT IS THE REGULATORY BODY AND WHAT INVESTIGATION RIGHTS EXIST?\n\nUnion members holding a WHS entry permit may enter a workplace (or in the case of an owners corporation, a building or common property), to advise and assist with WHS Act compliance and/or when a contravention of the WHS Act is suspected. While 24 hours’ notice is required to be provided in the former case, the permit holders can enter without notice when a contravention is suspected. The PCBU must not refuse, delay or hinder the union permit holder. Owners corporations should implement a process to deal with permit holder entries.\n\n#### WHAT ARE THE OBLIGATIONS REGARDING NOTIFICATION OF INCIDENTS?\n\nWhere a serious or dangerous incident occurs, the PCBU must:\n\n- notify the regulatory body; and\n- preserve the incident scene until an inspector attends or the regulatory body directs otherwise. The WHS Act sets out details of what constitutes a notifiable incident.\n\n#### WHAT KIND OF FINES CAN BE IMPOSED?\n\nThe penalties imposed under the WHS Act are applied in accordance with a sliding scale which generally is as follows:\n\nCategory of Penalty\nOwners Corporation\nStrata Committee Member\nWorker or other\n\nRecklessness/risk of death or serious injury/illness\n$3 million\n$600,000 or 5 years jailor both\n$300,000 or 5 years jailor both\n\nBreach of Duty/risk of death or serious injury/illness\n$1.5 million\n$300,000\n$150,000\n\nBreach of duty\n$500,000\n$100,000\n$50,000\n\nThe weight of the penalties reflects the significance of the obligations which are being enforced by the WHS Act.\n\n#### WHAT CAN OWNERS CORPORATIONS DO TO ENSURE COMPLIANCE WITH OBLIGATIONS?\n\nSome examples of measures that owners corporations may take to address the implementation of the new work health and safety laws include (but are not limited to):\n\n- assume that the owners corporation is a PCBU and that the WHS Act applies to the owners corporation – most owners corporations engage workers either as employees or independent contractors to carry out maintenance and repair works and at some stage will therefore, be a PCBU;\n- identify reasonably foreseeable hazards on the common property and site;\n- eliminate any risks and hazards identified as far as reasonably practicable or minimise the risks and hazards where they cannot be eliminated;\n- implement compliance WHS Act plans and procedures;\n- review and amend (if necessary) policies for new and existing strata committee members to ensure compliance with WHS Act;\n- educate the owners about the new WHS Act regulations and obligations;\n- make sure the insurances cover any additional risks imposed by the WHS Act – usually, office bearer’s legal liability insurance does not cover fines, penalties, punitive, exemplary or aggravated damages (always remember that no insurance can cover jail sentences);\n- re-visit by-laws to ensure that they adequately deal with WHS Act obligations including the implementation of incident reporting systems and obligations to immediately notify the strata committee members of potential risks and safety issues identified;\n- the holding of regular additional meetings of owners to discuss health and safety issues or concerns;\n- consider whether you should provide height limits for workers (both employees and independent contractors) to minimise the risk of falls; and\n- ensure that ongoing rules are implemented about vegetation management, storage of substances, maintenance of plant and equipment, induction of tradespeople, etc.\n\nThanks to Gavel and Page Lawyers for this article.",
    "images": []
  }
}