{
  "url": "https://netstrata.com.au/dividing-fences/",
  "timestamp": "2025-11-03T17:35:10.092324",
  "success": true,
  "content": {
    "title": "Dividing Fences",
    "date": "2011-07-05T10:25:50+00:00",
    "category": null,
    "author": "S J",
    "main_content": "### Part 1 in Solving Neighbourhood Problems\n\nWith the exception of noise, dividing fences are the source of most neighbourhood disputes. State legislation covers the rules for working out who pays for the dividing fence and also what happens if there are disputes about where the boundary lies. These laws apply to owners corporations and bodies corporate.\n\n#### Basic Principle\n\nThe Dividing Fences Act 1991 (NSW) 1 provides that adjoining owners are required to share equally the cost of a “sufficient dividing fence”. If there is a dispute about the standard of fencing, one neighbour must give the other a fencing notice and disputes are heard in the local court. Mediation by a community justice centre is likely to be cheaper and less stressful.\n\n#### What is a “sufficient dividing fence”?\n\n[IMAGE_0]\n\nIn deciding what is a sufficient dividing fence, the court will take into account the following:\n\n- The standard of the existing fence;\n- The purpose of the fence;\n- The way the land on either side of the fence is used;\n- The privacy or other concerns of each neighbour; and\n- The kind of dividing fence that is usual in the area.\n\nThe basic principles of this act are reflected in other state based dividing fences legislation including the Dividing Fences Act 1953 (QLD), Fences Act 1968 (VIC), Common Boundaries Act 1981 (ACT) – the main difference is the issue of crown liability for dividing fences.\n\n#### Who Pays?\n\nThe general rule provides for neighbours to equally share the cost. However, if one neighbour wants a fence of a greater standard than a “sufficient dividing fence”, then that neighbour will have to pay for the additional cost involved.\n\n#### Boundary Disputes\n\nIf there is a dispute about the boundary line, then the act provides for this to be determined by a registered surveyor.\n\n#### Encroachments\n\nEncroachments (where buildings cross the boundary) are covered by the Encroachment of Buildings Act 1922. These are complicated cases, which can involve applications to the Supreme Court.\n\n#### Avoiding Disputes\n\nTo avoid disputes about fences and boundaries, an owners corporation or body corporate needs to act reasonably and should take care to keep notes and written correspondence about the essential elements of the fencing proposition. Certainly a\nneighbour who goes ahead and constructs a fence without first consulting and coming to an agreement with the other neighbour, might not be able to recover half of the costs. The community justice centres in New South Wales provide an excellent service in providing assistance to parties without the necessity of involving lawyers.\n\nThank you to Teys lawyers for this article",
    "images": []
  }
}