{
  "url": "https://netstrata.com.au/strata-repairs/",
  "timestamp": "2025-11-03T17:58:53.794125",
  "success": true,
  "content": {
    "title": "Strata Repairs – Who is Responsible?",
    "date": "2015-07-10T05:20:13+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Regardless of whether you live in a brand new complex or an older apartment block, repairs and maintenance are a necessary part of life. A strata situation can provide particular challenges around the upkeep of a property that single dwellings may not experience.\n\nFor strata-titled properties, there may be confusion over where the responsibility lies for the repairs – whether it’s up to the lot owner or the Owners Corporation.\n\nThe website of the NSW Department of Fair Trading states that, “The basic rule is that everything inside the airspace of the unit, including all internal walls, fixtures, carpet and paint on the walls is usually the lot and therefore the responsibility of the lot owner.”\n\n“Everything outside that airspace including walls, windows, doors, and tiles fixed to the floor and boundary walls is usually common property and therefore the responsibility of the owners corporation.”\n\nUnder these guidelines, for example, individual lot owners are obligated to maintain the carpets within their apartment but the Owners Corporation is responsible for the carpet in the common area.\n\nOn the other hand, the shower head must be replaced by the lot owner but the plumbing comes under the auspices of the Owners Corporation.\n\nAt Netstrata, we would always advise you to contact us immediately if you notice anything on common property that needs attention before the issue magnifies. It is far better and is usually less expensive to fix the problem before it becomes severe – not to mention the safety issues for residents and their guests.\n\nMinor repairs can generally be completed with existing funds. If the job is significant, then the Strata Committee of the Owners Corporation may prefer to discuss the issue at a meeting to decide on the best course of action.\n\nIf major repairs are required but the bank balance is depleted, then the Owners Corporation has the option of enforcing a special levy on lot owners or applying for a loan. It should always be the preference to raise the money immediately rather than leaving a volatile issue unchecked.\n\nAs an owner within the scheme, if you feel that the Owners Corporation are not attending to a job within an appropriate time frame, you are entitled to a mediation hearing with the Fair Trading Department.\n\nRegardless of who pays for the repairs, it is imperative that only licensed tradespeople are engaged to complete the work. It’s also a good idea to compare at least three quotes before using a contractor.\n\nFor more information on repairs and maintenance, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}