{
  "url": "https://netstrata.com.au/steps-to-handle-disruptive-neighbour/",
  "timestamp": "2025-11-03T17:56:33.551856",
  "success": true,
  "content": {
    "title": "Appropriate Steps to Handle a Disruptive Neighbour",
    "date": "2015-04-02T04:33:04+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Enjoying your strata-titled property surrounded by respectful neighbours is a core entitlement of communal living. However on rare occasions that serenity may be broken by a disruptive neighbour.\n\nMost strata plans have by-laws regarding acceptable behaviour. And when faced with excessive noise, verbal or physical abuse from a neighbour, there are appropriate steps to take to curb the behaviour.\n\nWhat would constitute disruptive behaviour?\n\nDisruptive behaviour can include anything that interferes with the enjoyment of your apartment. This could be but not limited to:\n\n- Threats, intimidation or offensive behaviour directed at you or your family\n- Disturbance from domestic arguments\n- Verbal abuse between neighbours\n\nIt’s important to note that disruptive behaviour does not constitute individuals who don’t share your tastes or standards and noise associated with normal living such as children playing on the common grounds.\n\nWhat should you do if you believe that a neighbour is behaving inappropriately?\n\nThe first step would always be to talk calmly and rationally to the individual. In most cases, the offender will realise that their behaviour is affecting the enjoyment of your property and will mend their ways.\n\nIf you don’t feel comfortable addressing the situation directly or if you’ve tried talking but the individual continues to behave inappropriately, then the next step would be to discuss the situation with your Owners Corporation or Strata Manager.\n\nIn making a formal complaint you will need to provide a detailed log of every incident. This includes the time and location, a description of what took place and how it affected you. If you obtained a recording of the incident through consensual means, then this can also be used as evidence.\n\nYour Strata Manager has the power to issue a Notice To Comply. This carries a formal warning that if the behaviour doesn’t change then you are entitled to proceed to arbitration through the NSW Civil and Administrative Tribunal (NCAT).\n\nIf the disruption is so severe that you feel that your personal safety is at risk – then you shouldn’t hesitate to contact the police.\n\nAt no time should you engage in an argument with the offender or threaten the neighbour as a counter-measure. It is imperative to remain calm and to walk away from the situation.\n\nIf you have any further questions about how to handle a disruptive neighbour, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}