{
  "url": "https://netstrata.com.au/north-wollongong-surf-club/",
  "timestamp": "2025-11-03T17:49:20.589053",
  "success": true,
  "content": {
    "title": "North Wollongong Surf Club",
    "date": "2017-04-28T01:48:07+00:00",
    "category": null,
    "author": "S J",
    "main_content": "When the team at Netstrata were considering which organisation to sponsor in the Illawarra there really was only one option.\n\n“North Wollongong Surf Club is an iconic part of the Wollongong landscape and represents the community spirit that the Illawarra is renowned for,” said Tanya Edwards, Netstrata’s Development Manager.\n\nIn many respects, it’s a perfect fit; as the surf club is the heart of the community and brings people together, so too does Netstrata provide the groundwork for harmonious communal living for many strata schemes in the area.\n\nAccording to Lance Tarrant, President of the Surf Club since 2004 and member since 1965, the club is central to the local community.\n\n“It is vital, surf clubs – their volunteers provide a service to the city council and community every Sunday and public holiday six months of the year. We educate schools, community groups and individuals on beach and water safety as well as performing rescues and supporting emergency services in search, rescue and retrieval,” he said.\n\nIn addition to education around beach safety, the club also plays host to fundraising events organised by not-for-profit organisations. Recently the club hosted in an event with an environmental group who are determined to keep the water clean and rubbish free.\n\nThe club relies on generous sponsors to continue to provide exceptional services, which in some circumstances can be the difference between saving and losing a life.\n\n“Our beach has never had a fatal drowning neither during patrol hours nor between the flags. Our Bronze members – 15 years and over are proficient in surf rescue, first aid and resuscitation. They are required to maintain the safest environment for the community to enjoy the beach and surf,” said Lance.\n\n“We rely heavily on community sponsorship to purchase and maintain the necessary lifesaving equipment to carry out our volunteer duties and so we thank Netstrata for their generous sponsorship. We are still in the process of obtaining some of the lifesaving equipment from this sponsorship. We hope the link between our two organisations can continue into the future.”\n\nAs Tanya said, “Netstrata is proud to sponsor such an imperative part of the Australian culture being surf lifesaving. The Illawarra boasts some of the best beaches and surf lifesaving clubs in Australia and North Wollongong is such a landmark of the Illawarra community.”\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}