{
  "url": "https://netstrata.com.au/paperwork/",
  "timestamp": "2025-11-03T17:50:09.732128",
  "success": true,
  "content": {
    "title": "Paperwork for Strata Schemes",
    "date": "2013-12-10T03:27:00+00:00",
    "category": null,
    "author": "S J",
    "main_content": "While preparing and archiving paperwork and documentation may seem like a never ending chore for strata schemes, there are legal requirements around retaining records.\n\nThe regulatory framework is covered in sections 100 to 105 of The Strata Schemes Management Act 1996. It’s important to remember that it’s an offence for an Owners Corporation not to comply with the record keeping requirements and a further offence not to retain the records for the prescribed period.\n\nIn general, paperwork must be kept mechanically, electronically or by other means for five years. This includes, amongst others, records, notices, orders, accounting records, financial statements, correspondence, meeting notices and voting papers.\n\nAccompanying all notices must be the date and manner of service, the part of the strata scheme it’s about, the date for obeying the order and the date the order was obeyed.\n\nThe minutes taken of all meetings must also be kept. These minutes provide a documented history of the scheme and decisions made by the scheme’s members. For this reason it’s definitely worth keeping these minutes beyond the five year statutory requirement and, if possible, potentially archiving the minute book indefinitely.\n\nRecords may be inspected by an owner, mortgagee or covenant chargee of a lot or a person authorised by the owner, mortgagee or covenant chargee. The request must be submitted in writing and a suitable time arranged to view the documents. Copies can be made but the originals cannot be removed from the custody of the Owners Corporation.\n\nTo assist with the recording keeping process, there is software on the market specifically designed for strata schemes. This software fulfils the legal requirement for maintaining records electronically and gives scheme members easy access to the documents.\n\nIf you have any questions about keeping books and records, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}