{
  "url": "https://netstrata.com.au/installing-nbn-for-strata-schemes/",
  "timestamp": "2025-11-03T17:40:19.439582",
  "success": true,
  "content": {
    "title": "Installing nbn™ for Strata Schemes",
    "date": "2018-03-28T05:52:10+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The rollout of nbn™ across the country continues to gather pace. To date 6.3 million premises have access to the national broadband network and on average 100,000 homes and businesses are being added every month.\n\nAt some point soon, if you’re not already, you’ll have the opportunity of connecting to the nbn™ network. You can check the expected date for your place by entering your address into the nbn website. Once nbn™ is available, you have 18 months to switch over from your current broadband connection to an nbn™ connection. As nbn co is a wholesaler, there are many providers who can connect you to the network.\n\nIf your apartment building hasn’t yet been connected, it’s best to register the property with nbn™. Representatives will need to engage with the Owners Corporation to gain access to the building because apartment blocks generally require more extensive internal cabling than single dwellings. When you complete the online form note any fire alarms, lift emergency phones, the number of tenants and any important information particular to your building.\n\nThere are different types of nbn™ technology including Fibre to the Premises, where a fibre optic line is run all the way to the premises and Fibre to the Node, where nbn™ fibre is run to a newly built cabinet that connects to the existing copper wiring.\n\nThe most popular technology for apartment buildings is Fibre to the Building – where a fibre optic line is run to a node that’s housed inside the apartment block. Existing wiring then connects the new technology to each of the apartments. The node will be secured in a cabinet.\n\nThe installation of each apartment and each building is going to be different depending on how the new network has been connected to the structure and how the existing wiring has been laid throughout the complex.\n\nSome providers may require approval from the Strata Committee prior to commencing work on the installation. Also if you’re renting, the provider may require permission from the landlord, property manager or owner prior to installing nbn™.\n\nIf you’re an owner, you may also be required to engage the building manager of your complex when your provider is ready to install the new network – as the installation process may require access to parts of the building that are usually off limits.\n\nAt Netstrata, we advise all owners and occupiers to notify your Strata Managing Agent once you’ve signed up to an nbn plan and want to connect to the network. They will then advise you of the particular circumstances for your property and help you to make the installation as smooth as possible.\n\nIf you have any questions about nbn™, contact your Strata Manager at Netstrata.\n\nPhoto thanks to Bidgee [CC BY-SA 3.0 au], from Wikimedia Commons\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}