{
  "url": "https://netstrata.com.au/nsw-strata-management-flooded-by-weather-2/",
  "timestamp": "2025-11-03T17:49:40.314155",
  "success": true,
  "content": {
    "title": "NSW strata management flooded by weather",
    "date": "2013-04-02T07:14:43+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Prime Minister Julia Gillard has recently announced that the Federal Government will invest $100 million over the next two years into flood mitigation projects. Given the recent floodings, this investment is aimed at reducing flood risk and the subsequent strata managers building insurance premium renewals.\n\nBy targeting the flood and natural disaster mitigation measures, The National Insurance Affordability Initiative will finance $50 million per annum for the next two years in hopes of establishing the National Insurance Affordability Council.\n\nThe Council will run the national coordination of flood risk management, assisting strata management services. The Council will also make suggestions to the government regarding floods mitigation projects, and will undertake other actions directed at reducing building management insurance premiums in the event of natural disasters.\n\nBeyond reducing private insurance premiums, the government will have the potential to save expenditure on building management across all levels of NSW strata management.\n\nSince 2009, more than $6 billion has been accounted for due to natural disaster recovery, a recent press release stated. “Rather than have taxpayers cross-subsidise insurance premiums for those in areas of high risk, this initiative will identify and supplement the funding of mitigation works that will have a real impact in terms of lowering risk and achieving sustainable reduction of insurance premiums in areas exposed to high risk,” the government adds.\n\nCEO of the Insurance Council of Australia (ICA), Rob Whelan, labeled the move as a noteworthy step towards financially covering the sustainability of the various flood-prone communities that NSW strata management have been working toward restoring.\n\nThe investment “will ensure that at-risk Australian communities will be better protected in the future from the devastating effects of floods,” said Whelan.\n\nThe floods experienced in NSW and Queensland due to a knock-on effect from ex-tropical cyclone Oswald has resulted in over $661 million in insurance losses. Whelan has noted that over the last ten years, floods have caused around $4.5 billion in insured losses across the country.\n\nThe ICA has encouraged the Australian Government Actuary to take on additional studies concerning strata management services pricing across Australia. The aim of this is to deliver a benchmark that will accurately inform policyholders how insurance premiums are directly related to risk.\n\nNetstrata provides high quality strata services to their client schemes across NSW. All classes of properties – from small home unit schemes to high-rise residential and commercial buildings – receive a tailored approach to ensure they’re receiving the best option possible.",
    "images": []
  }
}