{
  "url": "https://netstrata.com.au/saving-precious-water/",
  "timestamp": "2025-11-03T17:53:40.360832",
  "success": true,
  "content": {
    "title": "Saving Precious Water",
    "date": "2017-05-17T07:22:52+00:00",
    "category": null,
    "author": "S J",
    "main_content": "While the recent rain along the east coast has ensured that our dam levels are at virtual capacity, water consumption should always be a principle concern.\n\nIn a strata situation, many schemes don’t have individual water meters. This means that the Owners Corporation pays the water bill through an administrative fund, which is covered through strata levies. The end result is that the individual owners have little visibility over their water consumption. Owners wouldn’t know if they’re using too much water compared to the recommended amount or not.\n\nSydney Water has examined water consumption across the city to provide benchmarks on the appropriate litres of water for a building based on the amount of bedrooms.\n\nThe best practice benchmark is less than 200 litres per bedroom per day. Unfortunately the typical use lies between 200 and 300 litres. Anything above 300 litres a day per bedroom demonstrates that there are areas that need addressing.\n\nThe most common area for water consumption in apartments is showers at 51.5%. The next most common area at 7.7% is toilets, followed by leaks at 7% and washing machines at 6.8%.\n\n[IMAGE_0]\n\nTo help calculate water consumption for your building Green Strata has developed an online calculator. You’ll need the total number of bedrooms in your strata plan and the last four quarterly water consumption bills for the scheme. The bill will state the kilolitres used in each quarter. It’s best to use a full year’s worth of data to cater for seasonal variations.\n\nAt Netstrata, we believe that everyone can always do something more to conserve water- regardless of whether your water use is above 300 litres or hits the best practise target.\n\nThe first port of call would be to engage a plumber to check for leaking pipes, taps and toilets. Owners could organise a plumber to check their apartments and the Strata Committee could have a plumber check the common property – especially the garden taps.\n\nThe next step would be to install water efficient products. For example a flow regulating aerator will transform your water spurting taps into water efficient taps. When purchasing a washing machine, always choose a front loading option with at least 4.5-stars. Your new dishwasher should have a 5-star rating and a new showerhead should have a 3-star rating.\n\nYou could also change your behaviour with water because every drop makes a difference. You could turn off the tap while brushing your teeth or rinse a razor in the sink rather than running water. It’s always best to wait until the dishwasher or washing machine are full before turning them on – and always use the economy mode.\n\nIf your strata scheme has an outdoor pool, it’s best that the Strata Scheme organises for a cover to be installed to prevent unnecessary evaporation and the water level should sit halfway up the skimmer box. The common paths should be swept with a broom and not hosed down with precious water.\n\nSydney Water has other fantastic water saving techniques on their website.\n\nIf you have any questions around water consumption, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}