{
  "url": "https://netstrata.com.au/holding-strata-meetings-post-covid/",
  "timestamp": "2025-11-03T17:37:49.484684",
  "success": true,
  "content": {
    "title": "Holding Strata Meetings post-COVID",
    "date": "2020-06-18T06:36:21+00:00",
    "category": null,
    "author": "S J",
    "main_content": "There’s no doubt that COVID-19 and the subsequent global lockdown has the changed the world forever. What was previously accepted practice, will no longer be the norm as the world eases restrictions and re-opens economies. The lockdown has shown us that being socially-isolated doesn’t necessarily mean disconnecting entirely from others around us.\n\nIn a strata scheme there are times when as a community we’re required to come together for official business – including the annual general meeting, extraordinary general meetings and committee meetings.\n\nBefore COVID-19, the thought of holding these meetings as a virtual meeting using video-conferencing software or as a teleconference was relatively unheard of on a wide-spread scale. But the government restriction of prohibiting groups to congregate meant that the only way to hold a strata meeting was to use software such as zoom, skype or teams. Similarly, auctions had to be held online rather than on-site in person.\n\nApps that help owners to vote on motions suddenly became popular, rather than posting a comment in your conference software or asking everyone to voice their intentions during the meeting. Pre-meeting electronic voting is also a relatively new concept – traditionally if you couldn’t attend the meeting, you’d mail your selections to the Managing Agent or vote by proxy.\n\nIronically, the law already allowed for virtual meetings and they could have been held legally all long. Electronic voting has been permissible since November 2016. In a pre-COVID world, the transition to virtual meetings may have occurred more gradually and you would have had the chance to ensure that all strata owners were able to access the internet and were happy to participate virtually.\n\nVirtual meetings are certainly more convenient and they may even see an increase in attendees. Unless there’s a contentious motion, generally strata meetings don’t usually get a large turnout. But if everyone can simply dial in from their mobile phone while making dinner at home or cycling on their own exercise bike, then the incentive to join is higher.\n\nHowever, while we gain convenience, we lose the opportunity to nurture close relationships with our neighbours at these meetings. There’s usually some banter for those that arrive slightly early and those that hang around after. Now if you log in earlier to a meeting, you go on mute and wait for the chairperson to begin. And seeing everyone face to face can’t be underestimated – especially if you’d like to thrash out a motion that requires additional insights.\n\nOnce restrictions are fully eased, at Netstrata we’d recommend mixing it up for your strata meetings – to get the best of both worlds. You could offer both an in-person option and access to the meeting online. Alternatively, you could arrange one meeting fully in person, while the next is managed entirely on zoom.\n\nIf you have any questions around holding a meeting and using technology, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}