{
  "url": "https://netstrata.com.au/acceptable-noise-levels/",
  "timestamp": "2025-11-03T17:30:49.551431",
  "success": true,
  "content": {
    "title": "Acceptable Noise Levels",
    "date": "2017-02-23T05:52:39+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Alleged violations of acceptable noise levels are a common disagreement amongst residents living within a strata property. It’s important to be aware that there are regulations in place for acceptable levels of domestic noise – generally each Council will have a policy on noise levels. Let’s take Bayside Council as an example.\n\nBayside Council has time restrictions on various domestic noise sources. They are:\n\nItem / Activity\nTime Restrictions\n\n Power Tools & Equipment\n8pm to 8am Sundays and public holidays\n\n8pm to 7am any other day\n\nMusical Instruments & Sound Systems\n12 midnight to 8am Friday, Saturday and any day immediately before a public holiday\n\n10pm to 8am any other day\n\nAir-Conditioners\n10pm to 8am Saturday, Sunday or Public Holiday 10pm until 7am any other day\n\nMotor vehicles, except when entering or leaving premises\n8pm to 7am Monday to Friday\n\n8pm to 8am Saturdays, Sunday and public holidays\n\nRefrigeration units fitted to motor vehicles\n8pm to 7am, Monday to Friday\n\n8pm to 8am Saturday, Sunday and public holidays\n\nTable from http://www.botanybay.nsw.gov.au/Environment/Pollution-Management/Noise\n\nNote: The restrictions are generally quite similar to the above throughout metropolitan Sydney. To be sure check the website of your local council.\n\nSo what do you do if you believe your neighbour is in breach of noise restrictions? At Netstrata we advocate the following course of action.\n\nThe first step is always to try and resolve the issue yourself. We recommend casually and calmly discussing the issue with your neighbour in an attempt to find an acceptable solution for all. Your neighbour may be unaware at how sound can travel and will be only too happy to rectify the situation.\nIf the offense is occurring at night, possibly for a party with louder-than-acceptable music, you are entitled to call the police who have the power to issue a Noise Abatement Direction if they are satisfied the music is obtrusive and offensive. Once issued, the abatement direction must be obeyed immediately and the offender cannot breach the direction for the following 28 days.\nIf the friendly approach fails and your neighbour continues with the noise violations, the next step is to take your complaint to the Strata Committee for your building. We recommend writing a letter to the Strata Committee outlining the issue. The committee then, should they choose to, have the option of instructing Netstrata to act on the situation.Netstrata can take a number of steps to have the offending individual comply, however we must remain impartial for all proceedings. Upon instruction, the first step we would take is forwarding a copy of the complaint to the alleged offender, citing the breach of noise regulations. We would also send a copy to the owner or agent if it’s a rental property. The offender is entitled to either issue a right of reply if they wish to deny wrong-doing or formally apologise for the offense.\nIf the above steps fails to resolve the issue, as Strata Managers, we can issue a Section 45 Notice to Comply (providing that the necessary motions are passed by the Committee), which can then be enforced via a penalty fine application to the Consumers Traders and Tenancy Tribunal.\nIf these approaches fail, formal action can follow by seeking an order from the [NSW Civil and Administrative Tribunal](http://www.ncat.nsw.gov.au/)(NCAT), formerly the Consumer, Trader and Tenancy Tribunal (CTTT), a Tribunal established to resolve disputes between tenants, landlords, traders and consumers in a timely and effective manner.If you decide to take formal action, we advise that you should have fully documented evidence of the offense including specific times, date, a police event number, photographic evidence and statutory declarations from witnesses.\n\nIf you have any further questions about noise violations, please contact your Strata Manager but please be aware that Netstrata must remain neutral with all alleged legal violations.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}