{
  "url": "https://netstrata.com.au/strata-scheme-termination/",
  "timestamp": "2025-11-03T17:59:00.215815",
  "success": true,
  "content": {
    "title": "Strata Scheme Termination",
    "date": "2013-11-20T21:45:53+00:00",
    "category": null,
    "author": "S J",
    "main_content": "#### Plans to eliminate unanimous agreement to abolish strata schemes\n\nUnder proposed changes to the New South Wales strata laws, strata schemes will no longer require unanimous agreement amongst members to demolish the property and rebuild with a new construction.\n\nThe Government argues that complete consensus is a potential barrier to renewal; given the, “need for urban consolidation.” There is a desire to accommodate Sydney’s increasing population and transforming low density strata schemes has been identified as a method of meeting the Government’s housing targets.\n\nThe other key consideration is that modern building practices and environmentally-friendly innovations are either unable to be fitted into older building or it would be too costly to do so.\n\nFair Trading outlined their intentions in a discussion paper entitled Making NSW No. 1 Again: Shaping Future Communities.\n\n“There is a strong argument for the ongoing renewal of some existing housing stock. Where land is held in single ownership an owner can renovate and update a building to ensure it meets environmental and aesthetic standards. Once a building has been strata subdivided this becomes much more difficult to achieve,” wrote Fair Trading.\n\n“It is argued that one of the factors stifling urban renewal is the complex and difficult process associated with terminating a strata scheme. Owners who wish to benefit from a proposal to renew or redevelop their scheme can be blocked by one individual who does not want to participate. When this happens the general community also misses out on the benefits of replacing a tired, run down scheme with a modern building that can accommodate more people.”\n\nIf applying a majority rules approach to upgrading older strata-titled buildings, the question remains at what point should this majority be set?\n\nAccording to the same discussion paper, the most common level of support required in international legislation to terminate a strata scheme and rebuild is 80 per cent of members.\n\nHowever there is discussion around reducing that majority to 75 per cent.\n\nThe Sydney Morning Herald recently reported that, “if the proposed laws come in next July, the threshold will be reduced to 75 per cent of owners, say strata industry professionals who have helped formulate the legislation.”\n\nWhile 75 per cent of owners is a clear majority, that still leaves 25 per cent of owners who could be forced to sell their home as part of the process of winding up the strata scheme, demolishing the structure and rebuilding afresh.\n\nIt is anticipated that there will be safeguards in place such as independent valuations and potentially an ‘extinguishment commissioner’ who will hear appeals against unfair payments.\n\nDevelopers may also offer a first option to buy into the new scheme and offer assistance with temporary or permanent relocation.\n\nIf you have any questions regarding the proposed strata law changes, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}