{
  "url": "https://netstrata.com.au/strengthening-fire-safety-in-apartments/",
  "timestamp": "2025-11-03T17:59:48.449266",
  "success": true,
  "content": {
    "title": "Strengthening Fire Safety in Apartments",
    "date": "2018-06-14T07:33:56+00:00",
    "category": null,
    "author": "S J",
    "main_content": "After three years of research into fire safety in residential buildings up to 25 metres high, Fire & Rescue NSW (FRNSW) recently released two reports. The core of the findings demonstrate that sprinklers combined with smoke alarms are more effective at saving lives than using smoke alarms in isolation.\n\nPaul Baxter is the FRNSW Commissioner.\n\n“Smoke alarms have had a significant impact on reducing the number of fatalities over the past 10 years; however, a combination of fire sprinklers and smoke alarms can significantly further reduce the risk of fatalities in the event of a fire,” said Commissioner Baxter.\n\n“Modern-day furnishings and building materials often produce faster fires with higher levels of heat and toxic smoke. We are committed to keeping the people of NSW fire safe and will continue to carry out research that better informs building code legislation and product standards to improve fire safety.”\n\nFollowing the recommendations outlined in the reports, the FRNSW will work closely with relevant stakeholders over the coming months.\n\nTogether with the Fire Protection Association Australia and the Australasian Fire Authorities Council, the FRNSW has submitted a Proposal for Change to the 2019 National Construction Code to mandate sprinklers in all new apartments up to 25 metres high.\n\nWhile sprinklers will be a welcome addition to fire safety, interconnected smoke alarms positioned throughout apartments are also essential.\n\nAccording to the law that came into effect on May 1 2006, smoke alarms must meet the requirements of the Australian Standard AS 3786. The alarms must be placed in hallways near bedrooms and there must be an alarm on all levels of the home even if they aren’t any bedrooms.\n\nThe Commissioner recommends taking the minimum requirements even further with one alarm in each bedroom and in the living area.\n\n“On average, there are approximately 21 deaths reported each year as a direct result of residential fires across NSW,” he said.\n\n“Up to a half of those fatalities could have been prevented if these homes had working smoke alarms as well as a home fire escape plan. Additionally, the interconnection of multiple alarms ensures that if one alarm detects smoke, all other alarms will activate to sound a warning,” he said.\n\nHere at Netstrata, we recommend installing additional smoke alarms if you don’t currently meet this recommendation.\n\nWe also recommend regular servicing and testing of smoke alarms to ensure they’re fully operational should their use be required.\n\nIf you have any further questions about fire safety, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}