{
  "url": "https://netstrata.com.au/how-to-prevent-mould/",
  "timestamp": "2025-11-03T17:39:16.291795",
  "success": true,
  "content": {
    "title": "How to Prevent Mould",
    "date": "2022-05-19T00:08:38+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The recent above-average La Niña rainfall and high humidity are the perfect ingredients for mould to grow. Mould spores are airborne and seek out damp, wet areas to grow. Excess moisture in an apartment, potentially caused by leaking pipes, rising damp or water penetrating rooves can lead to mould taking hold. Left unchecked, mould can give off toxic spores and vapours which can be a health risk; possibly resulting in allergic reactions, asthma and potentially flu-like symptoms. In a strata environment, there are actions that both the owners corporation and individual lot owners can take to prevent the spread of mould throughout the building and apartments.\n\n### Install underfloor ventilation\n\nTraditionally basements are damp and can be a prime breeding ground for mould, which then has the potential to spread upwards. Owners corporation may consider investing in under floor ventilation that will keep air circulating and will help prevent mould and mildew. Essentially sub floor ventilation enables fresh air to enter resulting in a healthier sub floor area, rather than allowing humid air to stagnate which encourages mould.\n\n### Fix roofs and pipes\n\nWhile it might seem obvious from a general maintenance perspective, it’s essential that roof and pipe leaks are fixed the moment that they’re identified. It’s best that owners corporations keep on top of general maintenance and don’t wait to make those repairs.\n\n### Use air conditioning units and dehumidifiers\n\nInadequate ventilation is a core reason apartments become susceptible to mould growth because when the air stops moving, you can get a build-up of humidity and moisture in those areas. Inside apartments, air conditioning units can assist with airflow. It’s best to set the mode to a dry setting to counteract the humidity. Ceiling fans can help but they’re not as effective as air conditioners.\n\n### Keep up with general cleaning\n\nIt’s best to vacuum regularly because mould needs organic matter such as dust to survive. Wipe down kitchen benchtops and bathroom sinks. A clean house will not only be much more enjoyable to live in but it also prevents mould. A bathroom exhaust fan will also prevent moisture build-up and, if possible, use a squeegee to dry your tiles or bathroom floor after showering.\n\n### Clean with warm soapy water\n\nIf you’ve discovered mould growing in your apartment, it’s best to wipe it off with warm soapy water. Sugar soap can be used. Be sure that the affected area is left completely dry, otherwise the mould will just grow again. White vinegar also kills mould. It’s important that you never brush mould as this will release the spores into the air and spread the mould further.\n\nIf mould has been allowed to take hold across large sections of the property, it’s best to get in touch with qualified mould removalists – they will have the appropriate expertise and equipment to remove the mould safely and effectively.\n\nIf you have any questions about the upkeep and maintenance of your property, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}