{
  "url": "https://netstrata.com.au/proposed-changes-to-strata-legislation/",
  "timestamp": "2025-11-03T17:51:26.382199",
  "success": true,
  "content": {
    "title": "Proposed Changes to Strata Legislation",
    "date": "2015-08-14T05:23:58+00:00",
    "category": null,
    "author": "S J",
    "main_content": "After a comprehensive review that began in December 2011, the NSW state government has released the final draft of their proposed changes to strata legislation. The government is now embarking on the last stage of public consultation before the bills are passed into law.\n\nWhile there have been amendments to strata legislation in the past, this will be the first significant reform to the laws since the Strata Titles Act was passed in 1973.\n\nThe motivation behind these legislative changes is to ensure that the laws cater to the needs of contemporary strata living and to provide an appropriate framework for the future.\n\nOverall the Department of Fair Trading, as stated on its website, aim to:\n\n- Make it easier for Owners Corporations to manage issues like pets, parking and by-laws\n- Create a new democratic process for collective sale and renewal of strata schemes\n- Support the responsible management of schemes with new accountabilities for strata managing agents\n- Establish a new process to help ensure building defects are addressed early in the life of the building\n- Enable modern forms of communication (including new options for your strata scheme to keep and issue electronic records, issue email updates and attend meetings ‘virtually’) to allow greater participation in schemes.\n\nHere are the key changes.\n\n#### Threshold to sell lowered\n\nPerhaps the most controversial amendment is the new threshold requirement for the sale or renewal of a strata scheme. To move forward with the sale, now only 75 per cent of owners are required to support the proposal. Existing schemes will be unaffected but will have the option to include the change via a majority consensus.\n\nThe bill will also stipulate the procedure for the renewal process including the establishment of a dedicated committee.\n\n#### Limit on proxy votes\n\nThere will now be a limit on the amount of proxy votes that one owner can hold. In strata schemes that have less than 20 lots, each owner will only be allowed to have one proxy vote. In schemes with more than 20 lots, each owner can have no more than five per cent of the total number of lots.\n\n#### Tenants can now sit on the strata committee\n\nWhere the majority of lots are tenanted, tenants will now have the opportunity to sit on the strata committee and have a more active say in the running of the strata scheme.\n\n#### Reduce apartment overcrowding\n\nThe Owners Corporation will now be able to pass a by-law limiting on the number of adults occupying a lot. The limit will now be no more than two adults for each bedroom.\n\n#### Council inspectors\n\nThe Owners Corporation can now make arrangements with the local council to control inappropriate use of parking spaces. Council parking inspectors will potentially have the power to issue infringement notices on strata parking spots.\n\n#### Smoke drift is officially a nuisance\n\nCigarette smoke is now formally identified as a nuisance. Therefore if a resident is disturbed by smoke drift, they can take appropriate action through existing channels.\n\n#### New building defect procedure\n\nThere will now be new procedures for the rectification of building defects in newly completed strata schemes. If the initial defect period for the scheme has expired, the owner can now appoint an independent building consultant to undertake a defect inspection. An interim report must be completed between 12 and 18 months after the scheme began. The final report must be completed between 18 and 24 months after the scheme began.\n\n#### Rectification of defects\n\nThe builder has the option to return to the scheme at any time before the building inspector has finished their report. The Owners Corporation can now also consider the rectification of building defects at each annual general meeting prior to the end of the statutory warranty period for the scheme.\n\nThe builder or developer will be unable to vote (if still an owner) on any matter relating to a building defect.\n\n#### Building Bonds\n\nDevelopers must now put down a building bond prior to the completion of the building work. The bond amount must be two per cent of the contract price for the building work. This bond is to secure funding for the rectification of defective building work that is identified in the final inspection report. This bond can be claimed by the owner or the Owners Corporation two years after completion of within 60 days of the final report being issued.\n\n#### Owner renovations\n\nTo make it easier for owners to undertake minor renovations, there will now be a three-tiered approach for renovating a strata lot.\n\nCosmetic changes, such as inserting picture hooks, can be done without approval.\n\nMinor renovations, such as installing timber floors, require a general resolution or 50 per cent approval.\n\nRenovations that alter the external appearance need a special resolution or 75 per cent approval.\n\n#### Name change\n\nThe Executive Committee will now be known as the Strata Committee.\n\nIf you would like to offer your opinion to the NSW Department of Fair Trading, you can do so on their website. It’s anticipated that the bills will be presented before Parliament later this year.\n\nIf you have any questions regarding the proposed changes, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}