{
  "url": "https://netstrata.com.au/reforms-to-tenancy-laws-passed/",
  "timestamp": "2025-11-03T17:52:10.632849",
  "success": true,
  "content": {
    "title": "Reforms to Tenancy Laws Passed",
    "date": "2018-10-25T11:09:27+00:00",
    "category": null,
    "author": "S J",
    "main_content": "With changes that are sure to be welcomed as a step in the right direction by tenants, the NSW Government recently passed a series of amendments to the Residential Tenancies Act 2010.\n\nThe date when these changes will come into effect hasn’t been set yet, as the Government would now like to consult with affected stakeholders including landlords, tenants and agents.\n\nAccording to the Department of Fair Trading the reforms, “are designed to increase protection and certainty for renters, while ensuring that landlords can protect their investment and effectively manage their properties.”\n\n“The reforms further improve protections for victims of domestic violence, and improve tenants’ renting experience by making it easier for tenants to make a rental property a home and reducing disputes over repairs and maintenance.”\n\nAs part of the changes, rent increases are now limited to once every 12 months.\n\nThere’ll also be mandatory set break lease fees for fixed-term leases. This will prevent agents charging exorbitant amounts to break a lease but at the same time protecting the interests of the landlords. This change will apply to all new 3 year or less fixed-term leases.\n\nThe set break lease fees are:\n\n- 4 weeks’ rent if 75% or more of the lease remains\n- 3 weeks’ rent if between 50% and 75% of the lease remains\n- 2 weeks’ rent if between 25% and 50% of the lease remains\n- 1 week’s rent if 25% or less of the lease remains\n\nAnother reform will assist tenants who experience domestic violence. These renters who find themselves in a situation that they need to escape a violent partner will now be able to end the tenancy immediately without being penalised. These tenants will also not be held liable for any damage to the property incurred as a result of domestic violence.\n\nBetter Regulation Minister Matt Kean said, “This is about delivering better protections for victims, and gives them certainty they won’t be penalised in future rental applications.”\n\n“These stronger measures will enable tenants to escape domestic violence much faster, as a provisional AVO or declaration by a medical professional can be obtained without the added trauma of appearing in court.”\n\nThe government has also now created minimum standards that a property needs to pass before it can be tenanted. These seven standards are designed to determine whether the property is fit for habitation or not. If these standards slip during the tenancy, then the owner is required to make the necessary repairs. It is now easier for tenants to get repair orders from the NSW Civil and Administrative Tribunal.\n\nThese standards are:\n\nStructurally sound property\nAdequate natural or artificial lighting in each room, except storage rooms or garages\nAdequate ventilation\nSupplied with electricity or gas and have adequate electricity or gas outlets for lighting, heating and appliances\nAdequate plumbing and drainage\nConnected to a water supply service or infrastructure for the supply of hot and cold water for drinking, washing and cleaning\nContains bathroom facilities, including toilet and washing facilities, which allows user privacy.\n\nNSW Fair Trading will also be given new powers to resolve disputes between tenants and landlords over repairs, maintenance and property damage caused by tenants. This will include the ability to issue rectification orders.\n\nIf you have any questions about the changes, please call your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}