{
  "url": "https://netstrata.com.au/owners-covid-19-update-and-message/",
  "timestamp": "2025-11-03T17:50:03.196507",
  "success": true,
  "content": {
    "title": "Owners COVID-19 Update and Message",
    "date": "2020-03-23T00:34:39+00:00",
    "category": null,
    "author": "S J",
    "main_content": "To our valued clients,\n\nAs we reported to you via our Autumn Newsletter, as the coronavirus pandemic escalates, it is likely that Governments will implement further social restriction policies in an attempt to slow the spread of the virus.\n\nThere is understandable concern in the community, particularly the potential impacts, both practically and legally for owners and residents of strata and community title properties.\n\nAs your Strata Managers we understand the importance of our role in assisting owners and residents in these unprecedented times. The following is a guide to the initial steps that we have implemented for your scheme and an outline of ongoing management should a general lock-down be declared:\n\n– Cleaning & Maintenance\n– Conducting Meetings\n– Business as Usual?\n– Ongoing Communication\n– Helpful Links\n\nWe know that everyone is experiencing increased email alerts and business communications about what they are doing to mitigate business risk. To facilitate the effective delivery of information to all our clients we’ll be increasing the content of our News & Blog section of our website and also our Facebook page. This will include a list of Frequently Asked Questions surrounding COVID-19, particularly in the event a resident of your scheme contracts the virus as well as the potential impacts to the administration of your property.\n\nAs always we trust this information proves helpful.\n\nFor all strata related enquiries, please direct these to your Strata Manager or email admin@netstrata.com.au\n\n### Cleaning & Maintenance\n\nWhat the provisions of a general lockdown will look like in NSW are currently unknown, however if the examples overseas are any guide the basic services to your scheme such as cleaning, general maintenance and garbage collection will continue, however there will likely be some disruption.\n\nTo assist containing the spread, all cleaning contractors have been instructed to thoroughly disinfect the internal common areas of your scheme, particularly high touch points such as handrails, doorknobs, lifts etc.\n\nNotwithstanding these provisions, we encourage all residents to continue appropriate hygiene practices such as washing hands, covering coughs and sneezes, practice social distancing and self-isolation where appropriate.\n\nDisruptions may be experienced should staff of service providers fall ill or be forced into self-isolation. We are working closely with all service providers to your scheme to ensure they are prepared and have the necessary stock, equipment and take the necessary safety precautions when entering or servicing your scheme. Should your current service providers be unable to service your scheme, we shall arrange for temporary replacements until they can resume normal services.\n\nOther services should also continue such as the availability of plumbing, electrical and other after hours emergency services, however we are already seeing some delays with availability of parts for plant and equipment.\n\nWe understand that the safety of you and the residents of your scheme comes first.\n\n### Conducting Meetings\n\nMeetings play an essential role in the decision making and administrative direction for your scheme, both at the Owners Corporation and Strata Committee level. If meetings are unable to be held, how will your Owners Corporation function practically, for example, simply determining budgets and striking levies?The 2015 Strata Legislation provided various avenues for Owners Corporations and Strata Committees to conduct meetings other than in person via utilising technologies such as video and teleconferencing.\n\nMost Owners Corporations managed by Netstrata have already passed the necessary motions and By-laws that will enable them to conduct meetings for their scheme using the technologies available, eg.\n\n- Video Conferencing\n- Teleconferencing\n- Pre-Meeting Electronic Voting\n- Voting Online\n\nApart from this, owners are still able to use traditional proxy voting to register their vote.\n\nNetstrata has invested heavily in the necessary technologies that will enable your Strata Manager, Owners Corporation and Strata Committee to continue to hold and conduct meetings via these technologies even if a general lockdown is declared and meetings are unable to be held in person.\n\nIf you have received a notice of a forthcoming Strata Committee, Annual General Meeting or General Meeting, you will be receiving further communications from your Strata Manager how you can attend this meeting via the methods outlined above. These meetings can be readily accessed by your PC, mobile phone or even landline phone.\n\nFor the safety of all owners and our staff, from today, all meetings convened for your scheme by our office will include instructions on how you may vote and participate at these meetings via electronic means.\n\n### Business as Usual?\n\nNetstrata has invested heavily in the necessary technologies that will enable all our staff, including Strata Managers and administrative support staff to work remotely should a general lock-down be declared.\n\nLike all businesses we may face some disruption, so we won’t pretend that it will be business as usual, however it will be business as usual as best as it possibly can be.\n\nPlease continue to contact your assigned managing agent via their email and direct telephone lines or our main office line should you have any questions or concerns.\n\n### Ongoing Communication\n\nWe know that everyone is experiencing increased email alerts and business communications about what they are doing to mitigate business risk, however we urge you to continue reading our alerts and where appropriate, distribute to the residents within your scheme.\n\nWe will be distributing a list of Frequently Asked Questions over the next few days that will guide you through more of the practical implications of the COVID-19 pandemic, particularly if a resident in your scheme is infected by the virus.\n\nUntil then, please do not hesitate to direct questions or concerns surrounding what other impacts COVID-19 might have on your scheme, or any other questions surrounding the ongoing administration of your scheme over the next few months.\n\n### Helpful Links\n\n- Australian Department of Health\n- Covid-19 Testing Clinics\n- NSW Health\n- SafeWork NSW\n- Smart Traveller\n- World Health Organisation\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}