{
  "url": "https://netstrata.com.au/the-role-of-the-caretaker/",
  "timestamp": "2025-11-03T18:02:29.102808",
  "success": true,
  "content": {
    "title": "The Role of the Caretaker",
    "date": "2013-11-27T04:03:29+00:00",
    "category": null,
    "author": "S J",
    "main_content": "For certain schemes, the Owners Corporation may find it helpful to appoint a caretaker to assist with the management of the common areas. This is entirely up to the individual scheme because there are no legal requirements that force a strata committee to appoint a caretaker.\n\nThe role of a caretaker is bound by NSW legislation. Part 40A of the Strata Schemes Management Act 1996 features the relevant clause.\n\n40A Who is a caretaker?\n\n(1) A caretaker is a person who is entitled to exclusive possession (whether or not jointly with another person or other persons) of a lot or common property and assists in exercising any one or more of the following functions of the owners corporation for the strata scheme concerned:\n\n(a) managing common property,\n(b) controlling the use of common property by persons other than the owners and occupiers of lots,\n(c) maintaining and repairing common property.\n\nCaretakers are permitted to liaise with tradespeople and visitors. They are also responsible for the general maintenance, repair and upkeep of the common areas.  Caretakers do not have the authority to enforce the by-laws of the scheme.\n\nIt’s important to note that a caretaker is an official full-time appointment. Individuals are not considered a caretaker if they perform the duties of a caretaker on a casual basis or as part of the duties of being an strata committee member. The functions of the caretaker and the scheme’s Strata Agent are different.\n\nCaretakers must be appointed in writing. This contract is limited to 10 years, but may be renewed if both parties are in agreement.\n\nLike many strata issues, resolution of any disputes between the caretaker and the Owners Corporation can be heard at the Consumer, Trade and Tenancy Tribunal. The Committee can seek a resolution regarding the caretaker’s unsatisfactory performance, unwarranted charges and whether the agreement is too oppressive. The Tribunal has the power to terminate the agreement, order compensation, change the terms of the agreement or dismiss the application.\n\nIf you have any questions regarding caretakers, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}