{
  "url": "https://netstrata.com.au/strata-hold-outs-forced-to-sell-under-new-plan/",
  "timestamp": "2025-11-03T17:57:27.697125",
  "success": true,
  "content": {
    "title": "Strata hold-outs forced to sell under new plan",
    "date": "2010-01-22T11:13:50+00:00",
    "category": null,
    "author": "S J",
    "main_content": "INDIVIDUAL apartment owners could be forced to sell their units to a developer if three-quarters of the other owners in their building want to do so, under a proposal from the Australian Property Council. The council, which represents developers and large property owners, says strata title laws give too much power to individual owners, who can block the redevelopment even if every other title holder in the building wants to bring in the bulldozers.\n\nThe council says many of the state’s 65,000 strata buildings are dilapidated and need redevelopment to cope with population growth. However, it says the process is being held back by a handful of owners. It has released a policy paper recommending that strata title laws be changed so that if 75 per cent of owners in a strata title building vote to demolish and rebuild, they can override any opposition.\n\nThe proposal has drawn support from strata managers and the Owners Corporation Network. The Planning Minister, Tony Kelly, said he would give it careful consideration. ”The minister will be meeting with the Property Council of Australia next week and will discuss the details of their proposal,” a spokesman for Mr Kelly said. The Government promised in its 2005 Metropolitan Strategy to investigate reforming strata laws to encourage housing redevelopment. But it has made no changes, fearing that it will be accused of removing owners’ rights. The Property Council accused the Government of dragging its feet on the issue. ”A quarter of everyone in NSW owns, lives or works in a strata title building,” the acting executive director of the council’s NSW arm, Glenn Byres, said. ”But no serious review has taken place, no policy agenda has been promoted and no legislated solution is in place.”\n\nA strata lawyer, Stephen Goddard, said he had acted for the owners of a unit block in Cronulla who had been prevented from developing their dilapidated building because an elderly owner refused to sell. ”The building is 50 years old, well past its best and definitely not the best use of the property,” Mr Goddard said. ”But because just one of the 16 owners – an 80-year-old woman who is refusing to leave because she has convinced herself that she’ll die if she does – is refusing to sell, everyone is stuck there while the whole block gradually falls to the ground.”\n\nThe chief executive of the Institute of Strata Title Management, Richard Holloway, said changing the laws would inevitably leave some people feeling disenfranchised. ”People don’t want to leave – they will say ‘I want to live the rest of my life in the area that I know’,” he said. The Property Council has proposed a range of measures to safeguard the rights of owners, including independent valuations for owners not wanting to participate in the redevelopment and the establishment of a strata schemes commissioner to oversee the process.\n\nPAUL BIBBY URBAN AFFAIRS\n\nJanuary 16, 2010 Sydney Morning Herald",
    "images": []
  }
}