{
  "url": "https://netstrata.com.au/the-power-of-strata-by-laws-unveiled/",
  "timestamp": "2025-11-03T18:01:54.063003",
  "success": true,
  "content": {
    "title": "The Power of Strata By-Laws Unveiled",
    "date": "2023-09-11T07:16:15+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The by-laws for a strata community outline the behavioural responsibilities of each owner, tenant and even their visitors. It is important that each occupant understands that not adhering to the by-laws may result in action being taken by another owner or occupant, or by the owners corporation.\n\nBreaches of the by-laws may be minor and of no consequence, however at times they can cause serious discomfort to other occupants, affecting the peaceful enjoyment of their property. In order for strata communities to live together harmoniously, at times these behavioural matters may need to be addressed.\n\n#### Identification of a By-Law Breach & Issuance of Notices\n\nAny owner or their managing agent (in the case of premises which are tenanted) may report a breach of the by-laws however it is important that evidence is tendered before any action may be taken. Written evidence with supplementary photos (where applicable) must also include the time, date and location of the breach along with a description of what occurred and any other relevant information. Once evidence has been tendered an assessment may be made as to whether the incident is a breach of the by-laws that are in place for the scheme.\n\nWhere breaches occur, the owners corporation may issue formal notices to the offender(s) describing the situation that has occurred, including a copy of the relevant by-law(s) that have been breached. Offenders may respond and agree to comply with the by-laws however from time to time they may refute the claims being made or continue to behave in a way which causes infraction.\n\nIn NSW, the Strata Schemes Management Act 2015 regulates the process for by-law dispute processes within strata schemes.\n\nOwners corporations are required to record any written communication within the records for the strata scheme.\n\nShould incidents re-occur, further breach notices to the offender(s) may be issued and will be recorded in the by-law breach register for the scheme.\n\nIt is important to note that any written evidence will form part of the owners corporation’s records and may be required to be included in documentation submitted to the Office of Fair Trading (OFT) or NSW Civil and Administrative Tribunal (NCAT) should the matter require further escalation.\n\n#### Mediation & NCAT Proceedings\n\nMost by-law breaches are remedied in a timely manner once the offenders are communicated with, however, on occasions where occupants or their visitors continue to carry out actions which contravene the by-laws, it may be necessary for further disciplinary action to ensue.\n\nPursuant to Section 146 of the Strata Schemes Management Act 2015 (SSMA) an owners corporation may decide to issue a formal notice to comply (in addition to the previously mentioned breach notices) with a by-law. For a notice to comply to be issued, a formal meeting of the strata committee or owners corporation would be required. This notice is normally issued to the offenders via a process server or registered post.\n\nNon-compliance with a notice to comply may lead to a penalty being issued by the NSW Civil and Administrative Tribunal (NCAT) should it not be complied with. Penalties may be up to $1,100 for a first offence and up to $2,200 should the offence re-occur within 12-months.\n\nDepending on the offence, an owner, or the owners corporation may choose to apply to the Office of Fair Trading (OFT) and seek mediation between the parties, in fact this may be a requirement for certain types of disputes. Mediation involves engaging with the OFT to facilitate discussions between the parties involved, aiming to reach a mutually acceptable solution.\n\nWhere mediation is unsuccessful, an order may be sought from the NSW Civil and Administrative Tribunal (NCAT) which may result in penalties being issued to offenders where these orders are not complied with. Penalties range from up to $5,500 for a first offence and up to $11,000 for a second offence within 12months.\n\nThese processes may be time consuming and costly for an owners corporation to pursue. From time to time matters may be seen to be a dispute between two (2) owners and therefore owners corporations may decide not to continue with further action. If this is the case, dispute resolution avenues are equally available for owners and occupants to take up.\n\nCommon by-law breaches within strata communities include such items as noise disputes, incorrectly parking on common property, cigarette smoke drift, unauthorised changes to common property and damages caused to personal property.\n\n#### Action by Owners\n\nIndividual owners may decide to pursue a resolution to by-Law infringements where an owners\n\ncorporation wish not to. The avenues of mediation and the seeking of an order to comply with a by-law are open to owners. Applications can be made for mediation via the Office of Fair Trading’s website or by calling them on 13 32 20.\n\n#### Strata Managing Agent’s Role\n\nThe strata managing agent is appointed by the owners corporation and consequently acts on their behalf in recording incidents which occur and issuing the relevant notices to offenders. The agent will make every effort to resolve by-law disputes however at times their attempts may not be successful and instructions are then obtained from the strata committee, generally at a Strata Committee Meeting (SCM), for a notice to comply to be issued.\n\nThe agent and the owners corporation are unable to force any person(s) to comply with the by-laws, this cannot even be done by a court of law. Should offenders continue to ignore notices to comply with a bylaw, action via the OFT or NCAT may be the next viable step.\n\nFor a detailed discussion on the information above, please contact your strata manager directly.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}