{
  "url": "https://netstrata.com.au/cctv-in-strata-communities/",
  "timestamp": "2025-11-03T17:32:14.927689",
  "success": true,
  "content": {
    "title": "CCTV in Strata Communities",
    "date": "2024-07-02T06:26:46+00:00",
    "category": null,
    "author": "S J",
    "main_content": "For additional safety and security strata communities may consider installing CCTV cameras. They can be used as a deterrent to unwanted visitors and can help to more easily resolve disputes. However, a balance should be struck between monitoring people’s movements for safety and infringing on the privacy of residents and their guests.\n\nAs a rule of thumb, it is best to install the cameras so they point at entrances. This includes the front door (rather than down the corridor), the driveway or car pack entrance (rather than into car park itself), or the entrance to the pool or gym (rather than at the swimming pool or into the gym area).\n\nOnce installed, there must be clear and visible signage stating the use of CCTV cameras.\n\nPrior to the installation of the cameras, a by-law should be passed at general meeting so that the scope of the camera installation is documented and agreed by lot owners. This could include the requirements for maintenance, intended purpose of the cameras and any restrictions on their placement or use.\n\nThere should also be discussion on the storing of the footage and a process established for accessing the footage (should the need arise). The Owners Corporation may decide that the building manager is best placed to manage the footage. There should also be a period when the saved footage is deleted – that could be after 3 or 6 months.\n\nThere will be an on-going cost for the storage of the footage, so the Strata Committee will need to budget for this.\n\nA by-law should also be passed by the Owners Corporation if an individual owner would like cameras installed on common property at the entrance to their apartment. The owner would most likely need to cover the cost of the installation and any subsequent repairs required. There should also be assurances that the angle of the camera only includes the direct entrance and does not include the common area corridor.\n\nIn addition to cameras, strata schemes may consider other security options such as improved lighting or education on not letting anyone into the building that you do not know – don’t let strangers follow you into a secure building. Intercom systems that include a camera are also a good idea.\n\nFor more information on the installation of CCTV cameras, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}