{
  "url": "https://netstrata.com.au/balcony-maintenance/",
  "timestamp": "2025-11-03T17:31:37.048374",
  "success": true,
  "content": {
    "title": "Balcony Maintenance",
    "date": "2024-12-03T05:28:44+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Unless you’re on the ground floor, your apartment probably has a balcony. Balconies are a fantastic outdoor space that can be used for entertaining, relaxing at the end of the work day or just enjoying the view from your elevated position.\n\nHowever there are complexities around the maintenance of balconies in a strata situation. As a general rule of thumb, the owners corporation is responsible for the common property and the lot owners are responsible for their apartment or airspace – but the balcony may not be straightforward and each strata scheme may have different requirements.\n\nUnder the Strata Schemes Management Regulation 2016, there is a common property memorandum that covers balconies. Your strata scheme may follow this memorandum or the scheme may have passed specific by-laws that are unique to your building.\n\nIf your scheme has followed the memorandum, then the owners corporation is responsible for the maintenance and upkeep of the:\n\ncolumns and railings\ndoors, windows and walls (unless the plan was registered before 1 July 1974)\nbalcony ceilings\nsecurity doors\noriginal tiles and associated waterproofing\ncommon wall fencing\nawnings within common property outside the cubic space of a balcony\nwalls of planter boxes\n\nThe lot owner is therefore responsible for everything else relating to the balcony. This might include a fly-screen or awning that was installed by owner, balcony furniture and the air-conditioning unit.\n\nLike the rest of the building, it’s essential that balconies are regularly maintained. Cracked tiles should be flagged with owners corporation and replaced immediately. Rust on metal balustrades should be treated to stop the rust spreading. The concrete should be regularly painted to help prevent concrete cancer.\n\nAs the property owner, it is best to keep your balcony clean and tidy – sweep away leaves and clear away the spider webs. Drainage points should be cleaned so that rain water can flow easily. And most importantly, report any issues you identify on your balcony to the Strata Committee so that they can arrange for them to be resolved.\n\nThe owner should also be familiar with the weight restrictions of the balcony. Loading up your balcony with gym barbells for your al fresco weights workout may place unnecessary strain on the structure. Similarly, if you’re having a party, ensure that the balcony can hold your guests and they aren’t placing additional pressure on the balustrade.\n\nIn windy conditions, lightweight furniture should be tied down or brought inside to prevent injury to other owners or the structure. And barbeques should be regularly cleaned and the gas connection checked for leaks.\n\nBalconies that have been neglected may require a project to rectify a major issue. If that’s the case and your strata scheme doesn’t have sufficient funds available, then the scheme will need to raise special levies to cover the cost. A special levy will need to be approved at a general meeting of owners.\n\nIf you have any questions about your scheme’s balconies, contact your managing agent at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}