{
  "url": "https://netstrata.com.au/winter-is-here-that-means-its-mould-season/",
  "timestamp": "2025-11-03T18:05:41.452188",
  "success": true,
  "content": {
    "title": "Winter is Here, That Means it’s Mould Season",
    "date": "2020-06-25T06:49:30+00:00",
    "category": null,
    "author": "S J",
    "main_content": "With the onset of winter, it’s natural that most of us will be reaching for our thicker doonas, blankets and heaters, however as we warm the inside of our apartments, we inevitably increase the humidity (moisture) inside our premises as well. This can lead to the build-up of condensation on walls, windows, clothes and furniture, which in turn invites that old winter nemesis Mould into apartments as well.\n\nMould can be endemic this time of year in apartments and apart from causing damage to clothes, furniture and property, it can lead to serious health issues as such it is imperative that appropriate measures are taken by residents to contain the spread of mould spores within their premises.\n\nThe location and disposition of some apartments render them more susceptible to the problem, however there are several simple preventative measures that residents can take to assist;\n\n(i) Ventilation\nCross ventilating rooms by opening windows, bedroom doors and balcony doors can assist with reducing condensation and humidity. This is particularly important in bedrooms, bathrooms and laundries where condensation is more prevalent.\n\nWhere condensation is evident on walls, windows or windowsills, it should be removed with a towel and allowed to dry.\n\n(ii) Clean Exhaust Fans\nEnsure exhaust fan vents are free from dust and debris so they able to function at maximum capacity. This will assist in clearing steam from bathrooms, laundries and kitchens.\n\n(iii) Limit the Use of Clothes Dryers\nModern apartment living means many residents have little choice but to use clothes dryers after doing a load of laundry, however excessive use of dryers exacerbates the build up of condensation and humidity.\n\nWhere appropriate residents should try using clothes airers or where using a dryer is necessary, ensure there is adequate ventilation in the laundry to avoid the build-up of condensation.\n\n(iv) Moisture Absorbers\nPlacing moisture absorbers such as ‘damp rid’ or ‘closet camels’ in rooms and wardrobes also reduce the amount of moisture in the air and help protect clothes from potential damage.\n\n(v) Regular Cleaning\nWhere there is evidence of mould spores it is essential that they are cleaned with an appropriate agent such as bleach or Exit Mould.\n\nMould should never be cleaned with only soap and water. Soap and water WILL NOT kill the spores and will actually contribute to spreading the fungus further.\n\nFor more problematic properties, residents may wish to try;\n\n(vi) Mould Resistant Paint\nThere are a wide variety of mould resistant paint and painting products that can be applied to walls and ceilings that are susceptible to mould. These specialised paints will prevent mould growth and hence the spread of mould into other areas of the apartment.\n\n(vii) Dehumidifiers\nDehumidifiers are designed to extract excess moisture from the air, which in turn decreases the humidity in a room and the build-up of condensation on walls, ceilings and windows.\n\nPlacing a dehumidifier in rooms that are susceptible to exposure to high moisture, for example, bedrooms when sleeping, laundries when using driers and bathrooms when showering will reduce the humidity and build-up of moisture in these rooms.\n\nFor more information on dehumidifiers and their benefits of reducing mould see the following link;\n\nhttps://www.sleepsolutions.com.au/australian-dehumidifier-buying-guide\n\nRegrettably where the problem is wholly environmental, i.e. there is no flaw with the common property that is leading to the direct transmission of moisture to the apartment (e.g. a leaking roof, defective shower tray or breached waterproofing membrane) there is little the Owners Corporation is able to contribute to assist in reducing the effects of the malady.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}