{
  "url": "https://netstrata.com.au/law-changes/",
  "timestamp": "2025-11-03T17:42:33.375549",
  "success": true,
  "content": {
    "title": "Law Changes",
    "date": "2024-11-28T06:09:05+00:00",
    "category": null,
    "author": "S J",
    "main_content": "To help meet the needs of people who own or live in strata properties, from February 2025 strata managers will be required to disclose more information, more often to owners corporations.\n\nThese disclosure changes are based on recommendations made in a 2021 Report that reviewed strata laws, and follows several phases of reforms that began in 2023.\n\nAccording to the NSW government, “The new disclosure requirements are needed to improve oversight of strata managers and whether they are acting in the owners corporation’s interests.\n\nTogether, the expanded disclosure requirements will:\n\n- make insurance arrangements more transparent, and\n- equip owners corporations with clear and timely information to inform decision-making and enable scrutiny of their strata manager’s actions and interests.”\n\nStrata managers who breach these new disclosure obligations could face penalties of up to $110,000.\n\nStrata owners with the additional information, will make better, more informed decisions about how to run their scheme.\n\n“The Government remains committed to reforms that will protect owners’ corporations, improve the accountability of strata management services, ensure owners’ corporations maintain their buildings and make strata living easier for residents,” said Anoulack Chanthivong, Minister for Fair Trading, when introducing the bill into parliament.\n\nPrior to selecting a strata manager, the prospective manager will need to share:\n\n- information about connections with suppliers they routinely use, including details about the nature of the relationship\n- whether they have given advice about strata plans or a community land scheme plan to the building developer in the last 2 years.\n\nOnce appointed as the strata manager, they must:\n\n- seek approval in writing for a commission or training service. Owners should review the request and vote on it at a meeting of the owners corporation.\n\n- Notify the owners in writing if they become aware of any connections or interests they have in relation to their strata scheme.\n\n- Notify the owners in writing about certain matters before they enter into a contract on behalf of the owners corporation where they will, for example, use a related supplier.\n\n- Provide more information at the AGM, including any connections they have with suppliers or the building’s developer and connections from the previous 12 months.\n\n- Provide itemised quotes for insurance policies including commission and broker fee amounts\n\nThe government have flagged that more changes will be developed and delivered in line with the recommendations of the statutory strata law review and through ongoing engagement with the strata communities.\n\nOn November 20 2024, additional changes to strata laws were proposed including:\n\n- requirements to strengthen developers’ accountability for the initial maintenance schedule and levies estimates they prepare for new strata developments\n- improving oversight of strata management agreements and adding a new statutory duty on building managers\n- protection for owners corporations from unfair contract terms in standard form contracts\n- new duties for strata committee members to improve strata committees’ governance\n- strengthening owners corporations’ obligations to maintain and repair common property\n- new powers for NSW Fair Trading to order owners corporations to comply with their duty to maintain and repair common property\n- supporting the uptake of sustainability infrastructure by requiring owners corporations to consider sustainability at each annual general meeting and when estimating levies for the year ahead\n- enhancing protections for prospective owners and owners corporations around embedded networks (where a lot or strata scheme has a private distribution system which connects to the main electricity network)\n\nIf you have any questions about these changes, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}