{
  "url": "https://netstrata.com.au/window-lock-motion/",
  "timestamp": "2025-11-03T18:05:35.208748",
  "success": true,
  "content": {
    "title": "Window Lock Motion",
    "date": "2016-09-26T03:16:57+00:00",
    "category": null,
    "author": "S J",
    "main_content": "### Making strata properties safer for children\n\nIn 2009 a three year old boy died after falling 15 metres from a third-floor apartment window in Kogarah.\n\nAt the time a police spokesman said, “We think he may have been playing in the bedroom on a bed that was near the window. We think he may have fallen out through the flyscreen.”\n\nThis tragic example is one of an estimated 50 accidents each year where a child suffers serious injuries or dies after falling through a window – all accidents that could have been prevented if appropriate safety devices were installed.\n\n### Children Window Safety Devices Act 2013\n\nIn December 2013 the NSW Government passed the Strata Scheme Management Amendment (Child Window Safety Devices) Act. This Bill was written to prevent further children from being injured after falling from windows in strata-titled properties.\n\nFrom March 13 2018, openable windows above ground level that are accessible to children in an apartment and on common property may require a locking or restraint device.\n\nTo determine whether the window requires a safety device, there are two measurements to consider.\n\nIf the window is less than 1.7 metres above the internal floor and\nThe internal floor is 2 metres or more above the outside ground level.\n\nSuitable safety devices include approved window locks or safety screens, but not standard insect screens. These devices must limit the maximum window opening to 12.5cm and they must be childproof.\n\n### Next steps for strata schemes\n\nWhile the 2018 deadline might seem like a long way into the future, we urge strata schemes to implement the changes now.\n\nTo protect children from falling through windows, you should:\n\nConduct an audit of windows in your scheme that will need a safety device to comply with the legislation.\nObtain quotes from qualified tradespeople.\nSelect the quote for your purposes at an Strata Committee meeting.\nEngage the selected tradesperson to carry out the work.\n\nQuestions?\nContact your Strata Manager at Netstrata. Also see our 2013 article – New Window Lock Laws.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}