{
  "url": "https://netstrata.com.au/short-term-rental-properties/",
  "timestamp": "2025-11-03T17:55:00.222502",
  "success": true,
  "content": {
    "title": "Short Term Rental Properties",
    "date": "2023-03-02T06:09:43+00:00",
    "category": null,
    "author": "S J",
    "main_content": "With border closures and lock-downs hopefully a thing of the past, international visitors are now returning to Sydney and New South Wales. So what does this mean for the short-term rentals and strata schemes? And what appropriate steps can strata communities take that are significantly impacted by owners that advertise their properties on sites such as Airbnb and Stayz?\n\nShort-term rental accommodation, which is sometimes abbreviated to STRA, is regulated. From December 2020 a mandatory code was introduced that outlines minimum standards of behaviour and requirements for all participants including the booking platforms, hosts, guests and letting agents.\n\nThere certain obligations that all hosts must follow; including hosts must not breach the Code of Conduct, any criminal laws, planning laws and any applicable strata scheme by-laws. From November 1 2021, it’s a requirement that all STRAs are registered on the Department of Planning, Industry and Environment’s STRA premise register.\n\nAccording to the Fair Trading website, “The host must hold insurance that covers their liability for third-party injuries and death on the premises and it must be valid for the occupancy period. Hosts should very carefully review the terms of the insurance they take out to ensure it meets this requirement. This should include consideration of the nature and extent of any exclusions to that coverage.”\n\nThe host (or a representative) must be contactable between 8am and 5pm to manage any issues that arise by renting the premises and contactable 24/7 to handle any emergencies.\n\nFor neighbours of the property, the host must take reasonable steps to ensure that the guests comply with their obligations under the Code. If the host is alerted to breaches of the code by neighbours, then they must take reasonable to steps to address the issues in a timely manner. Therefore, if a guest is breaching Code by playing loud music, it would be the expectation of the host to contact the guest within an hour to turn the music off.\n\nThese are the regulations that guests must follow, as stated on the Fair Trading website:\n\n“The guest must not at any time:\n\n- make noise that is unreasonably disruptive or interferes with the peace and comfort of neighbours and other occupants\n- act in a violent or threatening manner\n- act in a manner that could reasonably cause alarm or distress to neighbours and other occupants\n- use or enjoy the premises in a manner that unreasonably interferes with the use or enjoyment of common or association property in a strata or community land scheme by neighbours or other occupants\n- intentionally, recklessly or negligently damage the personal property of neighbours or other occupants.”\n\nStrata schemes can pass their own specific by-laws in relation to short-term rental accommodation.\n\nStrata schemes can consider passing a by-law prohibiting an apartment being rented as an STRA if the lot isn’t the owner’s primary resident. The owner couldn’t rent the whole apartment out as a short-stay, but could rent a single room within the apartment because they’ll be in another bedroom. The only exception would be if the owner is on holidays themselves.\n\nSuch a by-law would mean that owners that purchased investment properties in the scheme wouldn’t be able to list the apartment on short-term websites and would only be able to rent the property on longer 6-month or yearly leases.\n\nIf you have any further questions about short-term rental accommodation, give your Strata Manager at Netstrata a call.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}