{
  "url": "https://netstrata.com.au/new-fire-safety-regulations/",
  "timestamp": "2025-11-03T17:47:54.983488",
  "success": true,
  "content": {
    "title": "New Fire Safety Regulations",
    "date": "2023-08-14T06:17:47+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The Department of Customer Service (NSW) has released a fact sheet explaining the various amendments to the Environmental, Planning and Assessment (Development Certification and Fire Safety) Regulation 2021.\n\nThe key development for Strata Owners is the introduction of mandatory maintenance procedures for fire safety systems within strata scheme that must adhere to the maintaining fire safety measures in accordance with Australian Standard AS1851-2012 (Routine service of fire protection systems and equipment) (AS1851).\n\nPresently, the fire safety equipment in your scheme is only required to be maintained to the standard specified in the fire safety schedule. The introduction of AS1851 will mean all fire safety apparatus will be subject to greater scrutiny during your Annual Fire Safety Inspection. Owners Corporations will also be required to keep detailed inspection records onsite and can be fined for non-compliance.\n\nThese new requirements are due to commence in February 2025. The Department of Customer Service and Fire Protection Association Australia (FPA), the peak industry body for Fire Safety Practitioners are urging Owners Corporations to prepare for these changes now by adequately budgeting for the additional maintenance standards, as well as any necessary maintenance works that may result of the introduction of the new regulations.\n\nHere is a summary of the key changes and impacts that this will have for building owners, particularly those in strata schemes:\n\n#### Introduction of AS1851-2012\n\nAll fire safety apparatus will now need to comply with AS1851-2012, a more stringent standard that will be assessed during the Annual Fire Safety Inspection.\n\n#### Record-keeping and Penalties\n\nOwners Corporations will be required to keep detailed inspection records onsite and could face fines for non-compliance with the new standards.\n\n#### Commencement Date\n\nThese new regulations are set to take effect from 13 February 2025.\n\n#### Routine Servicing Requirements\n\nThe Amending Regulation will standardize processes for the routine maintenance of specific essential fire safety measures, aligning them with AS1851.\n\n#### Scope of Applicability\n\nThe AS 1851 standard will apply to new and existing Class 1b to 9 buildings, but not to measures that are not covered by the standard or where the fire safety schedule specifies a different maintenance process.\n\n#### Inspections and Penalties\n\nLocal councils and Fire & Rescue NSW (FRNSW) will have the authority to inspect routine maintenance records and issue penalties for breaches.\n\n#### Accredited Assessors Requirement\n\nThe amendment will also require the use of accredited assessors to conduct assessments of fire safety measures before the issuance of a fire safety certificate for specific building classes. This contrasts with the previous requirement for a “properly qualified person,” adding an additional layer of rigor to the assessment process.\n\n#### Preparation and Planning\n\nBoth the Department of Customer Service and the Fire Protection Association Australia (FPA) are encouraging Owners Corporations to plan and budget for these changes, which may result in additional maintenance costs.\n\n#### Transition Period\n\nThe new requirement for accredited persons to assess fire safety measures will apply from the aforementioned date or 18 months after an accreditation authority is approved, with sufficient time allowed for the development of a new accreditation scheme.\n\nThe amendments reflect a comprehensive effort to enhance the fire safety standards in NSW, ensuring that buildings meet modern standards for fire protection. Building owners, especially those involved with strata schemes, will need to become familiar with these changes and make the necessary preparations to comply with the new regulations. It would be prudent for owners and relevant stakeholders to consult with fire safety practitioners and legal experts to fully understand the implications of these changes and to develop a plan for compliance.\n\nFor a copy of the Fact Sheet, click here.\n\nAt Netstrata, we recognise the profound implications these regulatory changes have for our clients. We are committed to not only ensuring compliance but facilitating a smooth and seamless transition into this new era of fire safety.\n\nOur team of experts will provide comprehensive education, tailored guidance, and continuous support to help our clients navigate the complexities of the new amendments. We are fully prepared to assist with the meticulous planning, budgeting, and execution of all necessary measures in line with the amended regulations. Trust in Netstrata to be your steadfast partner as we work together to enhance the safety and compliance of your strata scheme, reinforcing our shared commitment to excellence and well-being.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}