{
  "url": "https://netstrata.com.au/latest-strata-reform-proposals-2016/",
  "timestamp": "2025-11-03T17:42:17.064956",
  "success": true,
  "content": {
    "title": "The Latest Strata Reform Proposals (2016)",
    "date": "2016-06-01T07:16:08+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Last year the NSW state government passed the most significant reforms to strata living since the Strata Titles Act was passed in 1973. As part of this modernisation process, there were over 90 changes to the current laws.\n\nTo support the changes introduced through the Strata Schemes Development Act 2015, the NSW government has now released additional draft proposals that fall into the Strata Schemes Management Regulation 2016 and the Strata Schemes Development Regulation 2016.\n\nThe Development Regulations outlines the requirements for the preparation of strata plans. According to the Fair Trading Department, “The draft Regulation provides necessary detail to support the new collective sale and renewal process… The Regulation includes:\n\n- the information that must be addressed in a strata renewal proposal\n- how a returning officer is to be appointed\n- how the market value of a building and its site is to be determined\n- the supporting documents that must be sent to owners with a strata renewal plan.”\n\nOn the other hand, the Management Regulation proposals are aimed at preventing financial mismanagement and easy access to financial records for owners and prospective buyers.\n\nAlso included in the draft proposals is a process for mandatory Fair Trading mediation so that disputes can be settled sooner. Another proposal includes the allowance of different types of voting processes such as secret ballots, remote voting, pre-meeting voting and importantly electronic voting to encourage an inclusive strata environment.\n\nThere’s a recommendation to make it easier to get simple renovations completed with minimal approval from the Owners Corporation – essentially cosmetic renovations won’t require any approval, while minor renovations will require 50 per cent of owners agreeing. It’s important to note that structural renovations will still require approval from a special resolution.\n\nBuilding bonds, which were first introduced as part of the Act last year for new strata properties, are also discussed. Construction defects need to be identified, documented and fixed using a bond that’s set aside by the developer. The new proposal covers how these bonds will function and when the government could intervene to review the decisions taken.\n\nFor more information regarding the changes, the government has published impact statements. Here’s the Impact Statement for the Strata Schemes Management Regulation and here’s the Impact Statement for the Strata Schemes Development Regulation.\n\nThe government is inviting interested parties to have their say on these draft proposals. The Department of Fair Trading website details the methods by which you can lodge a written submission either via email or through the post.\n\nIf you have any questions regarding the latest proposals to strata living, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}