{
  "url": "https://netstrata.com.au/insurance-for-natural-disasters/",
  "timestamp": "2025-11-03T17:40:32.188586",
  "success": true,
  "content": {
    "title": "Insurance for Natural Disasters",
    "date": "2020-03-16T05:56:54+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The recent fires, floods and storms have demonstrated the importance of having adequate insurance for your strata property – regardless of whether you’re an owner-occupier or a landlord.\n\nAs a guiding rule, whoever is responsible for that part of the property is responsible for having suitable cover.\n\nBy law, all strata title properties must have insurance. While each policy is different, in general, the policy covers the common areas of the building such as corridors, driveways, pools, and gyms against water, fire, theft or accidental damage. The Strata Committee in consultation with the Managing Agent can arrange the insurance.\n\nWhile landlords have the option of taking our Landlord Insurance, at Netstrata, we strongly advise that all owners that rent their property have adequate coverage.\n\nLandlord Insurance generally covers items that are owned by the landlord including household goods and electrical appliances, curtains, blinds, carpets and furnishings against floods, storms, rainwater and fires. The cover could also include any floors, ceilings or temporary walls that are located within the lot that aren’t managed by the owners corporation.\n\nAs an owner-occupier or if you’re renting, we recommend that you explore contents insurance to cover what you own. If there’s storm or fire damage, you’ll have peace of mind that the items inside the apartment including furniture, electrical appliances and whitegoods will be covered. Most companies cover the cost of repairing or replacing the damaged items, and temporary accommodation if you can’t live in your place.\n\nIf you already have contents insurance, it’s always wise to check that you have appropriate cover, especially if you’ve recently purchased additional items for your home.\n\nWhile insurance is a necessity, there are also tangible steps owners and the Strata Committee can take to help minimise damage should a storm or fire threaten your property.\n\nIt’s important to ensure that fire alarms are regularly tested and maintained, gutters are cleaned and drainage pipes are cleared of obstruction. It’s also best to keep foliage and trees clear of buildings to prevent the fire spreading. If a storm is predicted, make sure that loose items on balconies, garbage bins and outdoor furniture is secure.\n\nIf you have any questions around insurance, please contact your Managing Agent at Netstrata.\n\nRead our related article – 5 Tips on Landlord Insurance.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}