{
  "url": "https://netstrata.com.au/understanding-latent-defects-insurance-and-strata-building-bond/",
  "timestamp": "2025-11-03T18:03:43.001925",
  "success": true,
  "content": {
    "title": "Understanding Latent Defects Insurance (LDI) and the Strata Building Bond in NSW",
    "date": "2025-09-17T07:12:07+00:00",
    "category": null,
    "author": "S J",
    "main_content": "### Introduction\n\nOver the past five years, the NSW Building Commission has introduced a range of reforms to improve building quality and protect apartment buyers. These changes mean that new buildings are subject to much stronger oversight and accountability than before.\n\nTwo of the key protections that owners should be aware of are Latent Defects Insurance (LDI) and the Strata Building Bond and Inspections Scheme (SBBIS). Both are designed to ensure that defects are identified and fixed early, and that owners are not left carrying the cost of major building problems.\n\n### Latent Defects Insurance (LDI)\n\nLatent Defects Insurance, or LDI, is a relatively new product in Australia that is gradually being adopted by developers, and the NSW Government plans to make it mandatory for new high-rise buildings by 2028.\n\n### What it means for owners\n\n- Timing: LDI must be arranged before construction begins. This gives buyers confidence that protection is in place from day one.\n- Coverage: It protects against major structural, waterproofing, services (mechanical, electrical, plumbing and fire) and design-related defects for up to 10 years after completion.\n- Transferable: The policy is tied to the building, not the developer, which means it automatically covers owners corporations and all future purchasers.\n- Easy claims: Owners do not need to prove negligence. If a defect is covered, a claim can be made directly with the insurer to have it fixed.\n- Peace of mind: Developers who take out LDI are offering buyers an additional layer of confidence and protection.\n\nLDI can sometimes be used instead of the strata building bond, depending on regulatory approval.\n\n### Strata Building Bond and Inspections Scheme (SBBIS)\n\nThe strata building bond scheme has been in place since 2018 and applies to new strata buildings that are four storeys or higher.\n\n### What it means for owners\n\n- Bond amount: Developers must lodge a bond equal to 2% of the building contract price with NSW Fair Trading before the occupation certificate is issued. From 1 July 2026, this amount will increase to 3%.\n- Inspections: An independent inspector is appointed to review the building for defects between 15 and 18 months after completion. A final inspection takes place between 21 and 24 months.\n- Bond release: If defects are fixed, the bond is returned to the developer. If not, part or all of the bond is used to cover the cost of repairs.\n- Accountability: This process ensures early issues are identified, and money is set aside to make sure they get fixed.\n\n### LDI vs Strata Bond – What Owners Should Know\n\n- Bond (currently 2% rising to 3% in 2026): Paid by the developer just before the occupation certificate is issued. It lasts for two years and is used to fix defects identified during that period. Owners benefit because money is held aside specifically for remediation if the developer does not complete the work.\n- LDI: Paid up front by the developer before construction starts. It provides 10 years of cover, which means owners have a much longer period of protection for major defects. Claims can be made directly with the insurer without having to prove fault.\n\nGovernment policy indicates that LDI will become the standard in the future. For now, most buildings will have a strata bond in place, but it is worth checking whether your building also has LDI coverage.\n\n### Practical Tips for Owners\n\n- Ask your strata manager if your building has an LDI policy in place and request a copy of the certificate.\n- Confirm the bond has been lodged with NSW Fair Trading and know the amount.\n- Stay informed about the defect inspection process at 15–18 months and again at 21–24 months after completion.\n- Review reports carefully and ensure any issues you notice are included.\n- Understand how claims work if your building has LDI, so you know who to contact if problems arise.\n\n### Conclusion\n\nBoth Latent Defects Insurance and the Strata Building Bond provide important safeguards for apartment owners in NSW. The bond ensures that money is available to fix defects in the first two years, while LDI offers long-term protection for up to 10 years.\n\nBy understanding these protections and staying engaged with your owners corporation or strata manager, you can be confident that your investment is backed by stronger safeguards than ever before.\n\n### Disclosure\n\nThis blog is provided for general information only. It is not legal, financial or insurance advice and should not be relied upon as such. Owners should seek independent advice for guidance on their specific circumstances.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}