{
  "url": "https://netstrata.com.au/emergency-services-levy/",
  "timestamp": "2025-11-03T17:35:41.880237",
  "success": true,
  "content": {
    "title": "Emergency Services Levy",
    "date": "2024-06-18T06:25:19+00:00",
    "category": null,
    "author": "S J",
    "main_content": "In a move that’s designed to assist with cost-of-living pressures and to encourage more home owners to take out insurance against natural disasters such as fire and flood, the NSW Government has abolished the Emergency Services Levy on home insurance premiums.\n\nCurrently emergency services are funded through an additional tax placed on home insurance. The ESL funds around 73.7% of NSW emergency services; local councils cover 11.7% and the state government contributes 14.6%.\n\nInsurance providers have raised their premiums to incorporate the levy which has contributed to an average increase of 18%. NSW has one of the highest average insurance costs for business and households in the country.\n\nThe Government will now search for state-wide alternate sources to cover the $1.6 billion cost – recognising that natural disasters impact everyone.\n\nIn December 2023, the NSW Treasurer, Daniel Mookhey began the consultation with property and retail stakeholders to discuss reforming the funding model for emergency services.\n\nIt’s anticipated that a public consultation paper seeking views from the broader community will be released this year.\n\nAround 17% of home owners are choosing to go uninsured for home or contents insurance in part attributed to the high cost of the premium. These households risk significant loss in the event of a natural disaster such as fire or flood.\n\n“Far too many homeowners run the risk of leaving their biggest asset uninsured because of soaring costs,” said state treasurer, Daniel Mookey as quoted in The Guardian.\n\n“The NSW government will begin consultation across industry and the wider community. It’s not a reform that can be rushed – it’s too important.”\n\nThe Federal Government supported the move by the NSW Government.\n\n“It is great to see this announcement from Premier Minns today. The removal of the ESL from insurance policies is an excellent decision and a long overdue reform. It will come as a huge relief for households and businesses in NSW feeling the crunch of cost of living pressures,” said Assistant Treasurer and Minister for Financial Services, Stephen Jones.\n\n“We want people to be able to protect their assets when the worst strikes, but high insurance costs mean more and more people simply can’t afford it.”\n\nIf you have any questions about insurance for your scheme, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}