{
  "url": "https://netstrata.com.au/netstrata-sca-awards-finalists-for-2023/",
  "timestamp": "2025-11-03T17:46:20.883698",
  "success": true,
  "content": {
    "title": "Netstrata SCA Awards Finalists for 2023!",
    "date": "2023-07-12T06:47:43+00:00",
    "category": null,
    "author": "S J",
    "main_content": "We’re over the moon to announce that Netstrata has been shortlisted as a finalist in the esteemed 2023 Strata Community Association (SCA) NSW Awards! What a remarkable honour to be recognised in this celebration of outstanding professionalism and service within the strata industry of NSW.\n\nThis year, we’re up for a dazzling 4 categories:\n\n- Strata Community Management Business Large – Woohoo!\n- Strata Community Management Leadership for the unstoppable Suzi Bellas\n- Support Team Member of the Year for the incredible Katelyn Boulton\n- Strata Community Management Rising Star for the ever-rising Emma Congdon\n\nGetting to the finals isn’t just some fluke. It’s a big shout-out to our never-quit, always-aim-high approach. It shows how we’ve let our love for the industry become infectious and, most importantly, it proves that when we roll up our sleeves and focus on delivering our best to our clients, great things happen. Here’s to reaping the rewards of dedication and hard work!\n\nA roaring round of applause to our nominated team members! And a massive, heartfelt thank you to all who’ve joined us on this journey.\n\nWe would also like to take this opportunity to extend our congratulations and best wishes to all the other finalists. Your recognition is well deserved, and we are proud to be sharing this honour with such dedicated professionals in the industry.\n\nWe eagerly look forward to the final announcement and will keep you updated with any further news. Stay tuned and wish us luck!\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}