{
  "url": "https://netstrata.com.au/how-to-handle-asbestos/",
  "timestamp": "2025-11-03T17:39:03.484434",
  "success": true,
  "content": {
    "title": "How to Handle Asbestos",
    "date": "2013-11-18T04:35:05+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Its strength combined with its ability to absorb sound and its resistance to heat, electrical and chemical damage, made asbestos attractive to the manufacturing and construction industries.\nToday, however we are all very much aware that prolonged exposure to the fibres can lead to serious illness.\n\n### But what does this mean for older strata-titled properties?\n\nIt’s imperative that the health and safety of owners, tenants and their guests is maintained.\n\nIn 2012, a new national code was implemented that puts in place a nation-wide standard for asbestos safety. All buildings constructed before 2004 should be professionally inspected for asbestos. At the risk of alarming tenants who potentially thought their building was safe, it’s important to note that while asbestos in the form of crocidolite was phased out from 1967, other forms such as amosite was used until 2003.\n\nThe inspector will examine the property’s common areas and provide an informative, easy-to-read report that will give owners peace of mind.\n\nThe report generally includes the:\n\n- Date of the assessment\n- Details of the person who performed the assessment\n- Findings and conclusions\n- Recommended control measures resulting from the assessment\n\nIf asbestos is identified on the property then it’s up to the Owners Corporation to arrange for its safe and swift removal or, if it’s stable to do so, to leave the asbestos untouched. If the decision is made to leave the offending material, then regular audits should be undertaken to ensure the continued safety of residents.\n\nOwners Corporations need to be mindful of the extraction process because, in New South Wales, the removal of asbestos is governed by the Occupational Health and Safety Regulation 2001. As the employer, the Owners Corporation may be legally responsible and could be open to prosecution if there are lax safety procedures during the removal process.\n\nSection 259 has the appropriate clause.\n\n(1) An employer must ensure that asbestos work is carried out, in a manner appropriate to that work, in accordance with the following documents published by the NOHS Commission, as in force from time to time:\n\n(a) Code of Practice for the Management and Control of Asbestos in the Workplace [NOHSC: 2018 (2005) ,\n\n(b) Code of Practice for the Safe Removal of Asbestos [NOHSC: 2002 (2005) .\n\n(2) An employer must ensure that:\n\n(a) employees and other persons contracted to carry out asbestos work are informed of the dangers involved and of any precautions that should be taken in connection with the work, and\n\n(b) employees, workplace owners and plant owners are informed when asbestos work is being carried out, and\n\n(c) persons are warned, by the use of signs, labels or other similar measures, of the presence of asbestos or asbestos-containing material in a place at which construction work is being carried out.\n\n(3) An employer must identify, and implement, measures to prevent the uncontrolled disturbance of asbestos-containing material while construction work is being carried out.\n\n(4) An employer must ensure that procedures are in place for:\n\n(a) the cleaning of premises at which asbestos work is carried out, and\n\n(b) the laundering and cleaning of personal protective equipment used for asbestos work, and\n\n(c) the containment of asbestos waste, and\n\n(d) the disposal of asbestos and asbestos-containing material.\n\n(5) An employer must ensure that no asbestos-containing material, including asbestos cement, is reused in connection with the carrying out of construction work.\n\n(6) An employer must ensure that no high-pressure processes are used to clean the surface of asbestos-containing material, including asbestos cement or any structures that consist of or contain asbestos, during the carrying out of construction work.\n\nWhen engaging contractors to remove the dangerous material; Owners Corporation should instruct the team to consult the onsite asbestos register for the property and to carry out a risk assessment before beginning any work.\n\nIf you have any more questions regarding asbestos, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}