{
  "url": "https://netstrata.com.au/section-184-certificates/",
  "timestamp": "2025-11-03T17:54:12.146931",
  "success": true,
  "content": {
    "title": "Section 184 Certificates",
    "date": "2014-02-17T23:02:04+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Buying a strata property is different to purchasing a place that doesn’t involve communal living. There are extra considerations to think about such as the payment of levies and the by-laws that govern each scheme.\n\nTo help guide your decision before you purchase a strata-titled lot, you can request what’s known as a Section 184 certificate from the Owners Corporation. The name of the form comes from the relevant section of the Strata Schemes Management Act 2015.\n\nThis useful document contains key information about the management of the building and the financial obligations of the members.\n\nA Section 184 certificate will include:\n\n- The names and addresses of the strata committee members and the managing agent\n- The levies to be paid by the owners\n- Any outstanding levies\n- The address of where the records and financial statements can be viewed\n- Details of recently enacted by-laws\n\nImportantly for prospective buyers, if there’s a levy outstanding on the property before the certificate is issued and this amount isn’t shown on the document, then the purchaser is not responsible for the payment.\n\nAn owner, a mortgagee or covenant chargee of a lot or a person who’s authorised by the owner, the mortgagee or the covenant charge may request a copy of the certificate. This application must be made in writing, together with the prescribed fee.\n\nAccording to the legislation, the treasurer must respond within 14 days of the request being made otherwise the Owners Corporation may face financial penalties.  The common seal should also be used to verify the certificate’s authenticity.\n\nIf you require any additional information regarding a Section 184 certificate, contact your Strata Manager at Netstrata or request a Section 184 Certificate using the Request Forms section of our website.\n\nNote: This was formerly known as a section 109 certificate.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}