{
  "url": "https://netstrata.com.au/complain-direct-to-airbnb/",
  "timestamp": "2025-11-03T17:33:41.053492",
  "success": true,
  "content": {
    "title": "Neighbours Can Now Complain Direct to Airbnb",
    "date": "2016-04-13T02:27:54+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Neighbours of rented apartments through Airbnb whose guests violate noise restrictions will soon have another outlet to voice their dissatisfaction. Yasuyuki Tanabe, the Japanese head of Airbnb, recently announced that by April, neighbours will be able to provide feedback on guests staying in Airbnb properties through an online form.\n\nBloomberg.com quoted Tanabe as saying, “One of the most important issues facing the sharing economy is how the people choosing to take part in it co-exist with those that aren’t. Our first step in this direction is to give neighbours the opportunity to comment or complain.”\n\nAn Airbnb spokesperson in Australia told the Sydney Morning Herald that, “If issues do arise, we work with our community to try and resolve them. In the next month we are planning to start offering a new feature on our website that will enable neighbours to register a complaint directly to our customer service team for follow up.”\n\nAt Netstrata, we welcome this initiative by Airbnb. We support any actions that assist in creating a harmonious strata community.\n\nOur advice would be to give feedback – both positive and negative – through the Airbnb website if it’s warranted but also continue to lodge noise complaints through the existing mechanisms also. By doing so, you’ll be able to register your dissatisfaction with both the offending holiday-makers and the owner of the property.\n\nProperty owners are ultimately responsible for any guests on their lot regardless if they’re on a long-term lease, short-term rental through Airbnb or simply visiting for the day. If any guest generates noise which disturbs other lot owners’ enjoyment of their property then the owner can be held accountable. This includes noise levels and behaviour both in the common areas and within the apartment.\n\nPrior to renting your property through Airbnb, as an owner, it may be of value to outline the relevant by-laws to the guests so that they’re clear on what’s acceptable and what isn’t appropriate for that particular apartment.\n\nThe first step to resolving a noise infringement would always be calmly addressing the matter directly. However if it’s a massive party and you don’t feel comfortable knocking on the door, then you’re entitled to call the police.\n\nYou should also lodge a formal complaint to the Strata Committee and the Strata Manager.\n\nIf noise violations from Airbnb rentals becomes a significant issue for those living in the building, then the Owners Corporation does have the power to pass a by-law preventing all owners from listing their property on sites such as Airbnb.\n\nFor more information on noise violations, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}