{
  "url": "https://netstrata.com.au/fire-safety-changes/",
  "timestamp": "2025-11-03T17:36:30.325838",
  "success": true,
  "content": {
    "title": "Fire Safety Changes",
    "date": "2024-06-11T06:56:31+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The New South Wales government’s fire safety reforms to make buildings safer are now being progressively rolled out, following the passing of legislation in 2022.\n\nAccording to Fair Trading, the reforms were introduced, “to improve compliance with requirements for the design, certification and maintenance of fire safety measures in buildings through:\n\n- increasing the involvement of Fire and Rescue NSW (FRNSW) in reviewing non-standard fire safety design proposals,\n- creating an independent checker role to assess newly installed fire safety measures before buildings are occupied,\n- improving documentation of fire safety measures by standardising documentation and simplifying amendment processes, and\n- mandating procedures for the maintenance of fire safety measures.”\n\nUltimately the changes are designed to reduce life safety risks, damage to property and the chance of fire safety defects.\n\nThe changes will impact developers, fire safety practitioners, certifiers, building practitioners and in a strata situation, the owners corporation.\n\nFrom February 13, owners corporations of class 2, 3 or 9c buildings must provide a copy of the fire safety certificate to the building practitioner issuing a Building Compliance Declaration.\n\nAnd from August 1, if a construction certificate is required for the building work, owners corporations must ensure the fire safety engineer consults with Fire and Rescue NSW when compiling the non-standard fire safety design proposal. The Fire Safety Schedules will be issued using a standard template as produced by the NSW Government.\n\nPrior to issuing a fire safety certificate, from February 13 2025, owners corporation must engage an accredited person to certify newly installed fire safety measures and include pertinent information about that accredited person on the certificate.\n\nStrata Committees must also maintain essential fire safety measures as stipulated in the Australian Standard 1851-2012 Routine service of fire protection systems and equipment.\n\nThe changes follow from recommendations outlined in a report commissioned by the Office of the Building Commissioner in 2021 entitled Improving fire safety in new and existing buildings. According to strata research and Fair Trading audit data, fire safety is the second most common category of defect.\n\nThe report made four primary recommendations to help improve fire safety:\n\n- Establish a customer-facing building manual.\n- Ensure the effective regulation of fire safety practitioners.\n- Enhance the trustworthiness of Fire Safety Schedules, Fire Safety Certificates and Annual Fire Safety Statements.\n- More effective regulatory and compliance action.\n\nFair Trading have put together a fact sheet on the details of the fire safety reforms.\n\nIf you have any additional questions about the changes in fire safety, please contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}