{
  "url": "https://netstrata.com.au/private-water-supply-to-broadway-units-could-whet-developer-appetite/",
  "timestamp": "2025-11-03T17:50:56.875472",
  "success": true,
  "content": {
    "title": "Private water supply to Broadway units could whet developer appetite",
    "date": "2012-07-31T10:48:17+00:00",
    "category": null,
    "author": "S J",
    "main_content": "WHEN the first of 5000 people begin moving into the vast Central Park apartment complex on Broadway next year, they will be the first city residents to have water in their taps that is not supplied by Sydney Water.\n\nA private water company, Water Factory, will deliver water to the 1800 apartments and to the businesses that will eventually employ 10,000 people on the former Carlton and United brewery site.\n\nUnder a deal signed by the developer, Frasers Property, Water Factory will also collect the sewage, run-off and other waste water produced in the development and recycle it for use in all toilets, washing machines, gardens and air-conditioning towers.\n\nAn underground treatment works is being built in the basement. The Water Factory founder, Terry Leckie, says it will be the biggest in a high-rise residential project.\n\nIt was impossible for a private company to provide drinking water and treat sewage in private developments until the NSW government passed the Water Industry Competition Act in 2006, the first law in the country designed to encourage private companies to bid for the rights to supply and treat water.\n\nSince then, there has been a trickle of interest from companies. A few environmentally sensitive commercial developments in the central business district have installed recycling systems and use grey water in toilets, including Westfield in Pitt Street Mall, No.1 Bligh Street and workplace6 in Pyrmont, where Google is based.\n\nThe plans for Central Park go a lot further and may prompt interest from developers to use private companies to provide water and sewerage in new projects, especially those in more isolated areas if, as Mr Leckie claims, they can do it cheaper.\n\nWhile each apartment will be built with separate pipes for recycled water, the main difference residents will notice is with their bills. Most NSW apartments have one water meter for the whole block and residents pay an equal share regardless of the number of showers they have. In Central Park, each unit will have its own meter, giving residents the same incentive as house owners to save water.\n\nA separate charge for sewage treatment will be calculated depending on how much drinking water each unit uses.\n\nThe Water Factory will buy the drinking water for the complex\n\nThank you SMH for this article",
    "images": []
  }
}