{
  "url": "https://netstrata.com.au/competent-fire-safety-practitioner-regime/",
  "timestamp": "2025-11-03T17:33:34.680851",
  "success": true,
  "content": {
    "title": "Competent Fire Safety Practitioner Regime",
    "date": "2020-08-26T02:57:02+00:00",
    "category": null,
    "author": "S J",
    "main_content": "The NSW Government has introduced reforms to fire safety to improve the quality of checks made throughout the design, approval, construction and maintenance phases of a building.\n\nCertain functions under the Environmental Planning and Assessment Regulation must be undertaken by an ’accredited practitioner (fire safety)’ or a registered certifier.\n\nThese include:\n\n- endorsing plans and specifications for relevant fire safety systems\n- endorsing fire safety performance solution reports\n- endorsing exemptions to the Building Code of Australia for minor works to existing relevant fire safety systems\n- assessing the ongoing performance of essential fire safety measures in a building and endorsing the annual fire safety statement.\n\nThere is no requirement to be accredited to install or do routine maintenance, testing and servicing of essential fire safety measures.\n\n### Legislative changes from 1 July 2020\n\nOn 1 July 2020, legislative changes updated the requirements for accredited practitioners (fire safety) (previously known as ‘competent fire safety practitioners’).\n\nThe only people who can do the work of an accredited practitioner (fire safety) are set out below.\n\nWho can assess fire safety measures for an annual fire safety statement or supplementary fire safety statement?\n\n- People accredited under an approved industry accreditation scheme (see Approved industry accreditation schemes, below). For any function covered by an approved scheme, only a person accredited by that scheme can do the work.\n- A person deemed competent by the building owner to assess:\n\nnon-statutory measures (excluding emergency planning and alarm monitoring)\nperformance solutions for statutory fire safety measures, and non-statutory measures (excluding emergency planning and alarm monitoring).\n\nWho can endorse plans and specifications, prepare performance solution reports or endorse proposed non-compliances for fire safety measures?\n\n- Certain classes of registered certifier as follows:\n\nan engineer—electrical (previously C8) certifier may endorse plans and specifications for a fire detection and alarm system\nan engineer—mechanical (previously C9) certifier may endorse plans and specifications for a mechanically ducted smoke control system\na certifier—hydraulic (building) (previously C14) certifier may endorse plans and specifications for a hydraulic fire safety system.\n- A person who is the subject of a competency certificate issued by a certifier may:\n\nprepare a fire safety performance solution report (cl.130 or 144A of the EP&A Regulation)\nendorse plans and specifications for a ducted smoke control system (cl.136AA or 146B of the EP&A Regulation)\nendorse a fire safety non-compliance (cl.164B of the EP&A Regulation).\n\nHow to appoint an accredited practitioner (fire safety)\n\n[IMAGE_0]\n\nGuidance on appointing an accredited practitioner can be found on the Department of Planning, Industry and Environment website.\n\nAFSS standard templates\n\nStandard templates for an annual fire safety statement and supplementary fire safety statement are available from the Department of Planning, Industry and Environment.\n\nWhat if no accredited practitioner (fire safety) is available?\n\nIf no one is reasonably available to do the work, the building owner or certifier may seek authorisation from Fair Trading to appoint a person the owner or certifier deems competent to do the work.\n\nAuthorisation is needed before any appointment is made.\n\n### Approved industry accreditation schemes\n\nThe Fire Protection Association Australia (FPAA) accreditation scheme was approved on 1 July 2020.\n\nThe scheme covers:\n\n- endorsing the design of relevant fire safety systems: sprinklers, hydrants and hose reels, fire detection and alarm systems, but not mechanical smoke control systems\n- assessing the performance of essential fire safety measures for annual/supplementary fire safety statements\n- endorsing the following non-statutory measures for annual/supplementary fire safety statements: emergency planning and alarm monitoring.\n\nVisit the FPAA for a register of accredited practitioners.\n\nThe FPAA scheme includes a transitional period for those who have not yet obtained a recognised qualification.\n\nFor more information, contact the FPAA.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}