{
  "url": "https://netstrata.com.au/keeping-lifts-operational/",
  "timestamp": "2025-11-03T17:41:39.301317",
  "success": true,
  "content": {
    "title": "Keeping Lifts Operational",
    "date": "2016-07-12T02:27:12+00:00",
    "category": null,
    "author": "S J",
    "main_content": "Lifts are more than a simple convenience. As apartment blocks continue to be constructed higher and higher, the humble lift is now a necessity for many modern buildings.\n\nWhile lifts are a requirement, there is a perception that they’re costly to maintain and a proportion of the quarterly levies contribute to keeping them operational.\n\nAt Netstrata, we believe that it’s far better to conduct regular maintenance on lifts as a preventative measure because it can be far more costly to fix them when they’re broken. For owners, tenants and guests, it can also be a frustrating experience if a lift is out-of-order especially if you have to walk up the emergency staircase or wait an eternity because there’s only one lift in operation.\n\nTo minimise the chance of a breakdown, it’s always best if the Owners Corporation engages the services of a lift consultant. According to Strata Community Australia, a good consultant will provide service audits to, “identify what needs fixing and use their influence to make sure the lift company replaces worn or faulty components at their cost, as per their service contract.”\n\nUltimately, the lift consultant will identify issues before they arise, saving the strata scheme money in the long run. They can also assist with the renegotiation of the lift service agreement. The consultant will most likely have a solid relationship with all the major lift manufacturers and can negotiate a better rate than potentially an Owners Corporation can do in isolation.\n\nThe end game is a reliable lift that’s cost effective.\n\nFor older buildings that have aging lifts, a lift consultant can expertly guide the modernisation and refurbishment of the existing installation and if need be the entire replacement of the lift.\n\nThey can be involved as much or as little as required by the Owners Corporation. Some committees might prefer to have the consultant manage everything from the initial scoping, through to overseeing the upgrade and the final inspection.\n\nAlternatively, you could get the consultant to perform the feasibility study and leave the rest of the project management to the members of the Strata Committee. It really is whatever works best for the Owners Corporation that will result in a hassle-free installation and smooth-running lifts.\n\nFor more information on lift maintenance and modernisation, contact your Strata Manager at Netstrata.\n\n### Subscribe to our newsletter\n\nBy signing up to our monthly newsletter, you’ll be the first to get the latest news and updates from our team.\n\n[SUBSCRIBE](https://netstrata.com.au/subscribe/)",
    "images": []
  }
}