{
  "url": "https://netstrata.com.au/independentreview/",
  "timestamp": "2025-11-03T17:39:43.242993",
  "success": true,
  "content": {
    "title": "Netstrata Independent Review",
    "date": "2025-02-26T05:16:21+00:00",
    "category": null,
    "author": "S J",
    "main_content": "### RESPONSE TO INDEPENDENT REVIEW PUBLISHED BY NSW FAIR TRADING\n\nKey highlights:\n\n- Netstrata contests most of the potential breaches listed in the report and looks forward to working through these in more detail with NSW Fair Trading.\n- Netstrata has already implemented many of the independent reviewer’s recommendations and remains committed to delivering better customer outcomes.\n- Netstrata welcomes the report’s findings that customer charges for a broad range of services Netstrata provides via its wholly owned subsidiaries are charged at or below typical market rates, and that Owners Corporations using Netstrata’s Strata Insurance Services (SIS) typically pay less for their total cost of insurance.\n- Netstrata will also engage with NSW Fair Trading, industry bodies and other strata management firms in efforts to deliver continuous improvement across the sector.\n\nNetstrata acknowledges NSW Fair Trading’s response to the independent review of its business practices, but contests most of the potential breaches of the Strata Schemes Management Act 2015. We look forward to working through these in more detail with NSW Fair Trading.\n\nNetstrata welcomes the report’s findings that customer charges for a broad range of services that Netstrata provides via its wholly owned subsidiaries are typically charged at or below market rates. Netstrata also highlights that the report found Owners Corporations using Netstrata’s Strata Insurance Services (SIS) generally pay less for their total cost of insurance.\n\nNetstrata acknowledges that the report has identified some areas for improvement. Our customers are our top priority, and we will keep them informed of the changes we make to increase transparency and deliver better outcomes for them. We will be contacting those customers mentioned in the report to discuss the findings and recommendations.\n\nNetstrata invited NSW Fair Trading to conduct an independent review of its business operations in May last year following allegations made in the media. Netstrata has fully cooperated throughout the ten-month review process.\n\nDuring this time, Netstrata provided advisory firm McGrathNicol – which was engaged by NSW Fair Trading to conduct the review – with extensive access to its systems, procedures and documentation.\n\nThe independent reviewer has made a series of 22 recommendations. Nine of these have already been implemented by Netstrata since the review began. They include:\n\n- Conflict of interest and code of conduct training for all staff, with annual declarations of any potential or known conflicts.\n- Providing customers with a greater understanding of the dispute resolution process and escalation pathways.\n- The inclusion of customer complaints in quarterly board meetings so that senior executives have greater visibility of any issues.\n- Improving transparency relating to commercial arrangements by providing additional disclosures around external vendor relationships, service fees and referral commissions.\n\nResponses to a further eight recommendations are well underway including reviews of remuneration frameworks, risk management and compliance functions.\n\nThe review has also identified areas where there is uncertainty about how Owners Corporations and Strata Managers should comply with legal requirements. Netstrata welcomes further guidance from NSW Fair Trading given that some of the report’s findings are at odds with industry understanding and practices.\n\nWhile Netstrata does not accept all findings of the review, it will continue to work proactively and cooperatively with NSW Fair Trading. Netstrata will also engage with industry bodies and other strata management firms in efforts to deliver continuous improvement across the sector.\n\n[Ends]\n\nFor media enquiries, please email media@netstrata.com.au with your details and a spokesperson will be in touch. If you live in a strata scheme and have questions specific to your building, please contact your Strata Manager for assistance.",
    "images": []
  }
}